[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMS9hZ2dyZXNzaXZlLWJ1bGwtbWFya2V0LXNwZWN1bGF0aW9uLW9uLWV0aGVyZXVtLWhhcy1ub3QteWV0LWJlZ3VuLWFjY29yZGluZy10by1hbmFseXRpY3MtZmlybS1rYWlrby_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMjEvYWdncmVzc2l2ZS1idWxsLW1hcmtldC1zcGVjdWxhdGlvbi1vbi1ldGhlcmV1bS1oYXMtbm90LXlldC1iZWd1bi1hY2NvcmRpbmctdG8tYW5hbHl0aWNzLWZpcm0ta2Fpa28vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aggressive Bull Market Speculation on Ethereum Has Not Yet Begun, According to Analytics Firm Kaiko - The Daily Hodl",
        "content": "Crypto analytics firm Kaiko says that speculative fervor on Ethereum (ETH) hasn’t yet kicked off, despite being well off its 2022 lows.\n\nIn a new report, Kaiko says that Bitcoin has benefited from the hype surrounding the approval of BTC exchange-traded funds (ETFs) in the US, but that speculation on an Ethereum ETF has not yet begun.\n\nThe U.S. Securities and Exchange Commission (SEC) has recently decided to delay its decision on banking giant Fidelity’s spot market Ethereum ETF application until March.\n\nSays Kaiko,\n\n“While there is some hype around ETH ETF applications, the data suggest that aggressive speculation hasn’t yet begun. ETH trade volume has spiked, but derivatives markets have lacked the telltale signs of traders positioning for a rally. ETH futures ETFs have also had a slow few months of trading.\n\nETH and BTC correlation has sunk to multi-year lows as each asset matures and develops its own narratives. While ETFs were one of the most catalyzing narratives in BTC’s history, it remains to be seen whether ETH will be able to replicate this. However, ETH has many narratives it can lean on; if ETFs don’t spur enthusiasm, perhaps new Layer-2s or the success of EigenLayer and restaking can.”\n\nKaiko says that derivatives data also indicates that recent ETH moves have largely been driven by spot markets rather than by perpetual futures, which the firm says provides evidence that traders are not using leverage in anticipation of an ETH ETF.\n\n“September and October marked a low point in futures markets, with aggregated open interest (in USD) falling more than 20% from its summer levels. At this time, there was little price movement and funding rates were neutral…\n\nPost-BTC approval, funding rates have reset to neutral, while open interest has surged ahead of price, indicative of increased shorting. Even still, we have not yet seen a major build-up in open interest that is typical of a bull market.”\n\nAt time of writing, ETH is trading for $2,473.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjczNjU2L21ldGFtYXNrLWludHJvZHVjZXMtZXRoZXJldW0tdmFsaWRhdG9yLXN0YWtpbmctZmVhdHVyZS1wb3dlcmVkLWJ5LWNvbnNlbnN5c9IBc2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3MzY1Ni9tZXRhbWFzay1pbnRyb2R1Y2VzLWV0aGVyZXVtLXZhbGlkYXRvci1zdGFraW5nLWZlYXR1cmUtcG93ZXJlZC1ieS1jb25zZW5zeXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "MetaMask introduces Ethereum validator staking feature, powered by Consensys - The Block",
        "content": "MetaMask, the popular crypto wallet application, has partnered with Consensys Staking to run Ethereum validator nodes on behalf of users willing to stake at least 32 eth, a current value of about $80,000.\n\nFollowing its transition from a proof-of-work network to a proof-of-stake network in the September 2022 known as ‘The Merge,’ Ethereum’s network is now secured by such validators. Many staking providers allow users to pool smaller amounts of funds together to hit the 32 eth requirement to run one validator, splitting the rewards.\n\nMetaMask’s new staking offering, however, promises no pooling and no hardware or software requirements. Rather, the 32 eth stake is used to run a validator node through the Consensys Staking service, which already operates validators totaling about 4% of all staked eth.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nMetaMask currently promises about 4% annual yield on the rewards, before taking a 10% fee, though the company notes that this yield may increase or decrease due to the inherently random chance of any given validator’s block being selected to add to the network.\n\nMetaMask also offers pooled staking through popular providers Lido and RocketPool, though the advertised rewards are currently lower at 3.53% and 3.14%, respectively."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtZGl2ZS1iZWxvdy0yNDAwL9IBQGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtZGl2ZS1iZWxvdy0yNDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Will ETH Price Hit $2000? Expanding Channel Pattern Sets Dive Below $2400 - CoinGape",
        "content": "The cryptocurrency market is currently on the edge, with increasing concerns that Grayscale might persist in selling its Bitcoin holdings. This fear stems from investors shedding shares of the GBTC ETF, sparking a wider market sell-off. Amid this downturn, the second-largest cryptocurrency Ethereum formed a local top at $2700 and entered a new correction phase.\n\nWithin a fortnight, the ETH price is down 9% to currently trading at $2467. Moreover, a notable development in Ethereum’s Implied volatility and Option writing for coming months projects that future traders are expecting a prolonged correction for this asset.\n\nadvertisement\n\nETH Price Analysis: Expanding Channel Pattern Sets Dive Below $2400\n\nThe formation of an expanding channel pattern reflects increased uncertainty among market participants.\n\nA healthy retracement in ETH price keeps the overall trend bullish\n\nThe intraday trading volume in Ether is $4.63 Billion, indicating a 39% loss.\n\nThe last two months’ recovery in Ethereum price can be followed using two diverging trendlines of an expanding channel pattern. Amid this rally, the coin price has showcased several rebounds from the two trendlines indicating the traders have taken a strict on the pattern structure.\n\nOn January 12th, the ETH price witnessed its latest reversal from the upper trendline, which initiated a new bear cycle within the channel. By the press time, the ETH price is trading at $2469, trying to hold above local support of $2400.\n\nAs per the recent data from Deribit Insight, Ethereum’s implied volatility (IV), as measured by the Dvol proxy over the past week, experienced a significant decline, dropping from 64% to 47%, largely driven by structured call selling in both markets.\n\nThis indicates a change in strategy, with some investors possibly exiting long positions or engaging in overwriting strategies against their Ethereum holdings. Key transactions include the selling of 45,000 February calls with a strike price of $2,700, and 28,000 March calls at a $2,900 strike price. Additionally, there was a strategic move where 25,000 January $2,600 calls were covered, followed by the selling of April calls at a $2,900 strike.\n\nSuch Heavy Call selling at the aforementioned psychological level indicates the option traders believe the Ethereum coin is less likely to surge higher in coming months but rather remains in a sideways or correction trend.\n\nWill ETH Price Correction Hit $2000?\n\nIf the broader market continues to fuel selling pressure, the Ethereum price is likely to break the immediate support of $2400. The post-breakdown fall would tumble the price another 6.5% to retest the channel’s lower trendline at $2300.\n\nThe rising trendline has acted as dynamic support for over two months and its possible breakdown intensifies the supply pressure. The extended downfall may plunge the ETH price to following support of $2140, and $1920.\n\nMoving Average Convergence Divergence: A bearish crossover between MACD and the signal line reflects an active correction sentiment in the market.\n\nBollinger Band: The upper boundary of the Bollinger band going flat reflects a weakening in bullish momentum.\n\nRelated Articles:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvY3J5cHRvLXByaWNlLXByZWRpY3Rpb24tdG9kYXktamFuLTIxLWV0aC1zb2wtbHVuYy_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2NyeXB0by1wcmljZS1wcmVkaWN0aW9uLXRvZGF5LWphbi0yMS1ldGgtc29sLWx1bmMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Prediction: Ethereum (ETH), Solana (SOL), Luna Classic (LUNC) - CoinGape",
        "content": "Crypto Price Prediction: The cryptocurrency market is experiencing relative stability during the weekend, following a bearish trend earlier in the week. This downturn saw Bitcoin, the largest cryptocurrency, fall from a high of $49,000 to $40,300, marking a 17.85% loss.\n\nThis selling pressure is largely attributed to Grayscale beginning to sell its Bitcoin holdings in response to investors offloading shares of the GBTC ETF. The outflow of $2.2 billion from Grayscale’s GBTC and concerns about the Bitcoin ETF being a ‘sell-the-news’ event have led most major cryptocurrencies into a correction phase.\n\nadvertisement\n\nDespite this, several industry experts view the current downturn as a natural correction, necessary for the major cryptocurrencies to gather strength for future growth.\n\nOn the Bitcoin weekly time frame chart, there’s a notable struggle to sustain above the 50% Fibonacci retracement level, around $42,300. This effort to reclaim 50% of the lost value from the recent downtrend reflects a growing conviction among market bulls and a weakening hold by bears on the asset.\n\nWith a positive outlook for the near future, the following cryptocurrencies Ethereum(ETH), Solana(SOL), and Luna Classic (LUNC) can offer suitable pullback opportunities to traders.\n\nWhy Ethereum (ETH) Price Nearing a 22% Breakout Rally\n\nAmid the current downturn in the crypto market, the Ethereum price recently hit a local high of $2700 before starting a correction phase this week. The price now stands at $2487, reflecting a loss of 8.35% over the past two weeks.\n\nA closer examination of the 4-hour chart reveals that this correction is contained within two converging trendlines, forming what appears to be a pennant pattern. If this pattern proves accurate, it suggests that the current correction phase could be a consolidation period, allowing buyers to gather strength for a potential upward movement.\n\nAdding to this bullish perspective is a notable observation by Ki Young Ju, CEO of CryptoQuant, regarding Ethereum’s staking activity. On January 18th, he highlighted in a tweet that 24% of Ethereum’s total supply is now staked, with only 11% available on exchanges. Contrary to expectations of significant unstaking post the Shapella upgrade, the staking rate continues to rise.\n\nGiven these technical and on-chain developments, the ETH price might break through the pennant’s upper trendline, indicating an end to the correction phase. This breakout could potentially spark a rally of around 22%, pushing the price beyond the $3000 mark..\n\nNew Found Support Bolsters Solana (SOL) Price Rally to $125, But There’s More\n\nSolana, the fourth largest cryptocurrency by market cap, has displayed impressive resilience amid the broader market’s downturn, holding steadily above the crucial $85 mark. This level coincides with the 38.2% Fibonacci retracement, signaling that buyers are maintaining a strong foothold.\n\nAs highlighted in a recent analysis by Coingape, the Solana price correction is shaping the ‘handle’ of a larger Cup-and-Handle pattern, a bullish chart formation. This suggests that the ongoing retracement could rejuvenate the bullish momentum, potentially driving the SOL price up by 35% to breach the critical neckline resistance at $125.\n\nA successful breakout from this neckline, particularly if backed by a daily candle closing above it, would be a robust indication of a trend reversal. Such a development could set the Solana price on a path towards a significant target of $255.\n\nTerra Classic (LUNC) Price Wavering In a Mark-or-Break Scenario\n\nThe Terra Classic (LUNC) price has been in a corrective phase since December 2023, with its price dropping from a high of $0.00028 to its current value of $0.000118, indicating a substantial 60% loss.\n\nThe coin found crucial support at the 78.6% Fibonacci retracement level around $0.0000102, changing its course from a downward trend to sideways. The daily chart shows that this consolidation has evolved into a symmetrical triangle pattern, typically a sign of the continuation of the existing trend.\n\nA breakdown below this triangle’s lower support trendline might lead to further price declines for LUNC, potentially towards $0.0000975 and then $0.0000842. Alternatively, a rare upside break from this pattern could signal an attempt by buyers to regain bullish momentum.\n\nIf buyers manage a breakout, they could be looking at an upward rally towards resistance levels at $0.000147, followed by $0.000173, providing a much-needed boost to reverse the bearish sentiment.\n\nRelated Articles:"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMS9jcnlwdG8td2hhbGVzLXRha2luZy1hZHZhbnRhZ2Utb2YtYml0Y29pbi1ldGhlcmV1bS1hbmQtY2hhaW5saW5rLWRpcHMtYWNjb3JkaW5nLXRvLWxvb2tvbmNoYWluL9IBhAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMS9jcnlwdG8td2hhbGVzLXRha2luZy1hZHZhbnRhZ2Utb2YtYml0Y29pbi1ldGhlcmV1bS1hbmQtY2hhaW5saW5rLWRpcHMtYWNjb3JkaW5nLXRvLWxvb2tvbmNoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Taking Advantage of Bitcoin, Ethereum and Chainlink Dips, According to Lookonchain - The Daily Hodl",
        "content": "Crypto whales are buying up the correction in digital assets markets, according to blockchain tracking firm Lookonchain.\n\nLookonchain says that as Ethereum dipped in price, a “smart whale” with a solid track record of profitable trades bought up the dip with over 3,600 ETH.\n\n“After the price of ETH dropped [on Friday], this smart whale bought 3,600 ETH ($8.9 million) back at a lower price…\n\nThis whale is very good at buying ETH at low prices and selling ETH at highs.\n\nThe profit is ~$25.8 million currently!”\n\nAt time of writing, ETH is trading at $2,470.\n\nLookonchain also spotted a whale scooping up decentralized oracle provider Chainlink (LINK) as it dipped to the $14.81 level.\n\nAfter the price of LINK dropped [on Friday], a whale spent $8.9 million to buy 601,949 LINK at $14.81 with three new wallets.\n\nThe price of LINK appeared to have stabilized after the large whale purchase. At time of writing, LINK is trading for $15.53.\n\nLooking at Bitcoin, the on-chain data tracking firm says that a crypto whale withdrew nearly $30 million worth of BTC from crypto exchange Binance as the price fell below the $42,000 level.\n\n“It seems that a whale is buying BTC!\n\nIn the recent market drop, a new wallet withdrew 700 BTC ($29.36 million) from Binance at an average price of $41,948.”\n\nAt time of writing, BTC is trading for $41,570.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvLm5ld3MvbG9va2luZy1iZXlvbmQtZXRoZXJldW0tYW5kLXhycC1leHBsb3JpbmctYWx0ZXJuYXRpdmVzLWluLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Looking beyond Ethereum and XRP: exploring alternatives in 2024 - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum successfully deployed the Dencun upgrade on the Goerli testnet.\n\nRipple’s transfer of 80 million XRP tokens triggers uncertainty in crypto.\n\nNuggetRush (NUGX) combines gaming, blockchain, and play-to-earn concepts.\n\nReports suggest that investors are showing keen interest in NuggetRush (NUGX). This follows the activation of Dencun on the Ethereum (ETH) testnet. Meanwhile, XRP is under pressure due to whale transactions and regulatory scrutiny.\n\nEthereum gears up for Dencun\n\nOn Jan. 17, 2024, the Dencun upgrade was successfully deployed on the Goerli testnet.\n\nThis upgrade was initially scheduled for 2023 but was postponed to Q1/2024 due to unsuccessful upgrade tests.\n\nDencun is expected to enhance Ethereum’s scalability and will be activated on the mainnet if everything goes as planned.\n\nYou might also like: Dencun upgrade goes live on Ethereum’s Goerli testnet\n\nEthereum has been recording a constant increase in the number of new addresses created daily and a consistent drop in its supply on crypto exchanges.\n\nAlmost 90,000 new addresses were added daily in the last week.\n\nOn Jan. 18, 2024, ETH was trading at $2,525.62, down 0.06% in the past week.\n\nAnalysts believe ETH is consolidating and may rise to $2,615.75 by the end of January.\n\nXRP uncertainty\n\nOn Jan. 17, 2024, a transfer of 80 million XRP worth nearly $46 million was a source of concern.\n\nAccording to Whale Alert, some tokens were recently transferred to an undisclosed XRP wallet, causing suspicion about the purpose of the transfer.\n\nThis move happened at the same time as another large transaction by a whale, where 25.7 million XRP was sent to the Bitstamp exchange.\n\nYou might also like: SEC drops lawsuit against Ripple and its execs\n\nRipple now holds 46.34 million XRP after the transfer.\n\nThe future of XRP remains uncertain amid whale transactions and the presence of the SEC.\n\nThe current market dynamics and regulatory scrutiny combination have made XRP’s journey more complex.\n\nAs of Jan. 18, 2024, XRP was trading at $0.5696, down 6.44% in the past week.\n\nAnalysts predict that XRP will drop to close January at $0.5350.\n\nNuggetRush multi-sector plans\n\nNuggetRush combines gaming, blockchain technology, play-to-earn (P2E) concepts, and cryptocurrency to create a fun and rewarding digital space.\n\nYou might also like: Bitcoin bulls target $50k, NuggetRush and Bonk vie for dominance\n\nIt also collaborates with gold merchants, allowing for the direct delivery of RUSHGEM winnings to gamers.\n\nIn addition, the platform plans to launch an NFT marketplace where gamers can trade and customize their avatar NFTs.\n\nIn round 5 of its presale, NUGX is available for $0.018. The token will list at $0.020 when the crowdfunding event ends.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1idGMtYnVsbHMtaG9sZC00MTAwMC1hbmQtZXRoLWNvbnNvbGlkYXRlcy1hdC0yNDAwLXJhbGx5LXNvb24uaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as BTC Bulls Hold $41,000 and ETH Consolidates at $2,400 – Rally Soon? - Cryptonews",
        "content": "In the dynamic realm of cryptocurrencies, Bitcoin (BTC) maintains its foothold above the $41,000 mark, currently trading at $41,700 with a modest 0.25% increase as the week concludes.\n\nThe market buzzes with speculation as X, a notable player, unveils plans for a dedicated Payments account, promising potential shifts in crypto transaction dynamics.\n\nMeanwhile, the Commodity Futures Trading Commission (CFTC) casts a shadow with reports that Debiex, a crypto exchange platform, has fallen prey to romance scams, leading to a substantial loss of $2.3 million.\n\nThis revelation underscores the ongoing challenges within the digital asset space, reminding investors of the vigilance required amidst the pursuit of innovation.\n\nAmidst these unfolding narratives, Ethereum exhibits a steady posture, consolidating its position around $2,400. Both Bitcoin and Ethereum traders are on the lookout for signs of a forthcoming rally, as the market digests the latest developments and braces for the week ahead.\n\nX’s New Crypto Payments Account Stirs Market Speculation; Bitcoin Gains Support\n\nUnder Elon Musk’s direction, X (previously Twitter) has opened a special account for its future payments function, causing conjecture in the cryptocurrency world. It is anticipated that cryptocurrencies will be included in the X app, which is anticipated to launch in-app payment services by mid-2024.\n\nAlthough the dedicated account has been validated and linked to X, there has been no indication that it supports cryptocurrency in addition to conventional fiat money.\n\nResearchers Mason Versluis and other cryptocurrency fans are excited about the app’s possible integration of cryptocurrencies like XRP, Stellar, and XDC.\n\nSpeculation regarding its inclusion is fueled by Elon Musk’s previous affiliation with DOGE for Tesla payments.\n\nAs mainstream integration and acceptance of cryptocurrencies continue to expand, this move could have a beneficial impact on Bitcoin values by escalating ongoing speculation about X’s development into a full platform.\n\nDebiex Exchange Hit by $2.3M Loss Amid Romance Scam Claims"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWhpZ2gtbmV0d29yay1hY3Rpdml0eS1sZWFkLXRvLWEtcHJpY2UtaGlrZS_SAVNodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0td2lsbC1oaWdoLW5ldHdvcmstYWN0aXZpdHktbGVhZC10by1hLXByaWNlLWhpa2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Will high network activity lead to a price hike - AMBCrypto News",
        "content": "ETH was down by more than 2% in the last 24 hours.\n\nBuying pressure on Ethereum was high, and whale activity increased.\n\nEthereum [ETH] once again proved that it is the king of altcoins, as it outshone the rest. If the latest data is to be considered, ETH was the leader in recent volatility and average intraday price changes among top-tier capital assets. Does this hint at a price uptick soon?\n\nEthereum sits at the top\n\nAs per IntoTheBlock’s data, the Ethereum ecosystem remained highly active on the price font and other related aspects, outperforming the rest. This could possibly indicate a price rise in the coming days.\n\nAccording to CoinMarketCap, ETH’s price rose by over 12% in the last 30 days.\n\n#Ethereum is leading in recent volatility and average intraday price changes among top tier capital assets.@intotheblock data is simplified and indicates that the #eth ecosytem is strongly active. A price run would not be a surprise.#crypto #bitcoin #Market #currency #BBB24 pic.twitter.com/O1pLDxgiNw — 🍞ℤ𝕐ℝ𝔼 (@lord_zyre) January 19, 2024\n\nWhile ETH’s activity on the price front remained high, AMBCrypto planned to check its network activity.\n\nAn analysis of Artemis’ data clearly revealed that both Ethereum’s daily active addresses and daily number of transactions remained relatively high throughout the last 30 days.\n\nNot only that, but things on the captured value front also looked promising. This seemed to be the case as ETH’s fees gained upward momentum.\n\nIn addition to the uptick, the blockchain’s revenue also followed a similar increasing trend. However, a negative flag was the drop in its TVL.\n\nWill ETH’s price move up further?\n\nThough ETH’s value surged in double digits last month and network activity remained high, its daily chart turned red. The king of altcoins was down by more than 2% in the last 24 hours.\n\nAt press time, ETH was trading at $2,477.74 with a market capitalization of over $297 billion.\n\nTo see how investors were reacting to this, we checked Santiment’s data. Our analysis revealed that investors were exerting buying pressure on the token. This was evident from the fact that Ethereum’s supply on exchanges dipped while its supply outside of exchanges went up.\n\nAdditionally, whales were also confident in ETH as its supply held by top addresses increased last week.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nConsidering the high ecosystem activity and buying pressure, the possibility of a price uptick in the coming days can’t be ruled out. Therefore, AMBCrypto then took a look at ETH’s liquidation heatmap to see the upcoming resistance levels.\n\nOur analysis revealed that ETH would face strong resistance near the $2,600 mark. If it managed to climb above that level, it would again face resistance between $2,770 and $2,800."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2p1c3Rpbi1zdW4td2l0aGRyYXdzLTYwLW1pbGxpb24taW4tZXRoZXJldW0tYWF2ZS1zaGliLWxpbmstYW1vbmctb3RoZXItYXNzZXRzLWZyb20tYmluYW5jZS0yMDI0MDEyMTA5MznSAZoBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvanVzdGluLXN1bi13aXRoZHJhd3MtNjAtbWlsbGlvbi1pbi1ldGhlcmV1bS1hYXZlLXNoaWItbGluay1hbW9uZy1vdGhlci1hc3NldHMtZnJvbS1iaW5hbmNlLTIwMjQwMTIxMDkzOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Justin Sun withdraws $60 million in Ethereum, AAVE, SHIB, LINK among other assets from Binance - FXStreet",
        "content": "Typically, accumulation of altcoins by large wallet holders like Justin Sun could reduce the selling pressure on the assets and pave the way for prices to recover or rally in the short-term. Previously, Justin Sun has withdrawn SHIB from Binance in large volumes. The impact of the large volume withdrawals on altcoin prices remains to be seen.\n\nThe large volume withdrawal comes at a time when the altcoin season ends in the ongoing cycle, Bitcoin and Ethereum prices have declined in the past week. The Alt season index reads 73 as of January 21.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5mb3JleGxpdmUuY29tL0NyeXB0b2N1cnJlbmN5L2NyeXB0by1ldGhlcmV1bS1zcG90LWV0Zi11bmxpa2VseS10by1nZXQtdXMtc2VjLWFwcHJvdmFsLWJlZm9yZS1tYXktc2F5cy1qcC1tb3JnYW4tMjAyNDAxMjIv0gGJAWh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vY3J5cHRvY3VycmVuY3kvY3J5cHRvLWV0aGVyZXVtLXNwb3QtZXRmLXVubGlrZWx5LXRvLWdldC11cy1zZWMtYXBwcm92YWwtYmVmb3JlLW1heS1zYXlzLWpwLW1vcmdhbi0yMDI0MDEyMi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto - Ethereum spot ETF unlikely to get US SEC approval before May says JP Morgan - ForexLive",
        "content": "A note from JP Morgan back on Friday expresses hesitancy on expecting an ETH approval in the next 3 months:\n\nwe are sympathetic to the arguments favoring Ether’s classification as a commodity\n\n(but)\n\nwe remain skeptical of the SEC reaching such a decision by May\n\nExpectations for an ETH Spot ETF have risen since the U.S. Securities and Exchange Commission (SEC) gave approval for exchange-traded funds indexed to BTC spot prices.\n\nFor the folks awaiting an ETH ETF the wait appears to be just a little longer."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWV0aC11cHNpZGUtYml0Y29pbi1idGMtbWF4LXBhaW4tYWhlYWQtYW5hbHlzdC_SAVBodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1ldGgtdXBzaWRlLWJpdGNvaW4tYnRjLW1heC1wYWluLWFoZWFkLWFuYWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Upside, Bitcoin (BTC) 'Max Pain' Ahead: Analyst - CoinGape",
        "content": "Cryptocurrency analysts are currently divided on the future trajectory of Bitcoin (BTC) in relation to Ethereum (ETH), its closest counterpart in market capitalization ranking.\n\nOne prominent analyst, known by the handle @hedge__x on X has predicted that Bitcoin’s price will experience an upward trajectory in the current market cycle.\n\nadvertisement\n\nHowever, the forecast comes with a caution – the analyst suggests that despite the optimism, many investors might find themselves disappointed if the peak only reaches $100,000.\n\nEthereum (ETH) Ascent Signals Potential\n\nAmidst the varied sentiments surrounding Bitcoin’s projected peak, there is a prevailing belief in the crypto space that Ethereum (ETH) holds significant upside potential.\n\nThe analyst highlighted Ethereum as a potentially more lucrative investment compared to Bitcoin. Similar predictions were made at the start of January that Ethereum would reach $10,000 which prompted a series of debates and analysis.\n\nThis perspective is anchored in the anticipation of several catalysts, prominently the potential introduction of an Exchange-Traded Fund (ETF) product for Ethereum. The sentiment echoes through the crypto community, suggesting that while Bitcoin may experience a peak at $100,000, Ethereum is poised for more substantial gains.\n\nThe ongoing discussion around Bitcoin’s peak performance and Ethereum’s potential rise highlights the complex dynamics that shape the perceptions of analysts and investors in this rapidly evolving market.\n\nFor instance, Samson Mow recently made a big claim on the X platform in his Silver comparison as the “poor man’s gold.” In the post, he also took a jab at Ethereum, comparing it to the link between silver and gold. He even made a direct claim that Ethereum is the “stupid man’s Bitcoin.”\n\nBrighter Upsides for ETH\n\nIn the ever-evolving world of the cryptocurrency market, analysts and investors diligently scrutinize multiple factors to make informed predictions and investment decisions. According to some market analysts, Ethereum (ETH) is poised to overtake Bitcoin as the dominant player in the market in 2024.\n\nRegulatory developments, technological advancements, and market trends are among the critical aspects under constant observation. The overall market capitalization of the cryptocurrency market is alluded to by the analyst @hedge__x’s reference of “Total2” in his analysis.\n\nAs debates rages on in the crypto community, attention will be on Ethereum (ETH), especially as the protocol is undergoing one of its most important upgrades thus far – the Dencun Upgrade."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vaG93LXNvbGFuYS1zdWktbWFkZS1nYWlucy1mcm9tLWV0aC1vdXRmbG93cy_SAUpodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2hvdy1zb2xhbmEtc3VpLW1hZGUtZ2FpbnMtZnJvbS1ldGgtb3V0Zmxvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "How Solana, Sui made gains from ETH outflows - AMBCrypto English",
        "content": "Solana and Sui take in Ethereum outflow.\n\nSUI and SOL have seen declines but flash different RSI signals.\n\nSolana [SOL] and Sui [SUI] have experienced significant inflows from Ethereum [ETH] over the past month, according to data from Wormhole. However, it raises the question of whether this has influenced the overall transaction volume on these networks.\n\nSui and Solana take in the Ethereum flow\n\nWormhole data showed that around $370 million in liquidity shifted away from Ethereum in the last month. Sui and Solana accounted for about 90% of this outflow.\n\nPresently, these two networks continue to dominate, with an Ethereum outflow totaling over $106.2 million. Sui received around $68 million, while Solana received approximately $27 million, making up a combined 89% of the outflow from Ethereum.\n\nAnalyzing the Sui and Solana volume\n\nA recent analysis of Sui’s volume on DefiLlama showed a significant uptick in the past few days. Examining the chart reveals that the volume witnessed in January surpassed that of the preceding three months.\n\nThe upward trend peaked on 13th January, reaching over 76 million, marking the highest point in months. As of this writing, the volume was around 44 million.\n\nNotably, Sui’s Total Value Locked (TVL), despite a recent dip from around $344 million to $322 million, remained at its historically highest level.\n\nConversely, Solana has experienced a shift in volume trends. While the network’s volume increased towards the end of the year, it has witnessed a recent decline. Presently, the volume is over $740 million, reflecting a decrease but still outpacing Sui’s volume.\n\nSOL and SUI post different price trends\n\nAnalyzing the daily price trend of Sui showed an uptrend that peaked around 15th January, reaching around $1.3 with a notable 9% increase.\n\nDuring this rise, the price entered the overbought zone, as evidenced by the Relative Strength Index (RSI). After this peak, the price experienced declines, causing the RSI to dip below 60.\n\nAt present, the price has decreased by nearly 5%, trading at around $1.1.\n\nRead Solana (SOL) Price Prediction 2023-24\n\nIn contrast, Solana has dipped below the neutral line on its RSI, reflecting a decline in the price over the past three days.\n\nAs of this writing, SOL was trading at around $92, marking a decrease of over 1% in its price."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aGVyZXVtLXN0YWtpbmctaGVscC1yYWlzZS1ldGhzLXByaWNlcy_SAUdodHRwczovL2FtYmNyeXB0by5jb20vd2lsbC1ldGhlcmV1bS1zdGFraW5nLWhlbHAtcmFpc2UtZXRocy1wcmljZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum staking help raise ETH’s prices? - AMBCrypto News",
        "content": "ETH’s reserves on exchanges have been on a multi-year downtrend.\n\nIncrease in staking could also result in less volatility for ETH.\n\nUsers have shown heightened interest in Ethereum [ETH] staking since the Shapella Upgrade went live last year in April.\n\nThe freedom to withdraw their holdings at any given point of time restored the credibility in the process, resulting in more number of ETH getting staked into the network.\n\nStaked supply nearing 25%\n\nAccording to AMBCrypto’s analysis of CryptoQuant data, the amount of ETH staked as a percentage of the total circulating supply jumped from 15% at the time of the upgrade to 24.5% as of this writing.\n\nInterestingly, the demand for staking lifted despite a marked drop in staking yields, in pursuit of which users participated in the activity in the first place.\n\nThe annualized financial return per validator was 3.64% at press time, down from 5.2% in June 2023.\n\nLiquid supply continues to plummet\n\nIn total contrast, ETH’s reserves on exchanges have been on a multi-year downtrend, with a liquid supply of just around 11% as of this writing.\n\nTo put it simply, the number of ETH coins available for active buying and selling has dipped significantly, creating a scarcity in the market.\n\nWhy does this matter?\n\nIn line with economic fundamentals, an asset’s scarcity boosts its demand in the long-term, provided the demand stays consistent.\n\nThis has been particularly evident in the case of Gold, and much closer home, in Bitcoin [BTC].\n\nHowever, unlike Bitcoin, Ethereum’s supply isn’t hard-capped. Hence, the continued uptick in staking deposits acted as a major catalyst towards making ETH elusive for trading.\n\nMoreover, with more ETH getting locked up, the volatility was bound to drop eventually. This could pave way for steadier prices in the future, akin to a store of value.\n\nOn-chain analyst Leon Waidmann observed these developments and said,\n\n“We’re witnessing an ETH scarcity like never before, eclipsing all past Bullrun! Eventually, this supply squeeze will lead to a massive price explosion.”\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt the time of writing, ETH was exchanging hands at $2,454, with double-digit gains over the past month, according to CoinMarketCap.\n\nThe second-largest asset’s monthly performance helped to stabilize the crypto market, which has otherwise witnessed massive Bitcoin sell-offs following spot ETFs launch."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZXhhbWluZXIuY29tL2Zyb20tMC0zNC1ldGhlcmV1bS10by01MDBrLXRyYWRlcnMtZm9ydHVuZS1za3lyb2NrZXRzLWluLTgtaG91cnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "From 0.34 Ethereum to $500K: Trader's Fortune Skyrockets in 8 Hours - Examiner.com",
        "content": "A trader turned a modest investment of 0.34 Ethereum ($878) into a staggering $550,000 in just eight hours , as reported by on-chain tracker Lookonchain, stirring excitement in the crypto community.\n\ninto a staggering in just , as reported by on-chain tracker Lookonchain, stirring excitement in the crypto community. After FERRET meme tokens went live for trading, the trader used five new wallets to purchase 80 million FERRET tokens and made a series of sales, culminating in a profit of $54,000 from selling 11.8 million tokens and retaining FERRET tokens valued at $495,000 .\n\nand made a series of sales, culminating in a profit of from selling 11.8 million tokens and retaining FERRET tokens valued at . Lookonchain’s investigation suggests a possible connection between the trader and the FERRET meme token creator, hinting at insider involvement and adding to the mystique of this profitable trade amidst a pattern of similar meme coin investment successes in the crypto market.\n\nImagine turning a handful of Ethereum into a staggering $550,000 in the blink of an eye. That’s the kind of story that gets every crypto enthusiast’s heart racing. Recently, a trader did just that, flipping 0.34 ETH into a small fortune within a mere eight hours. This tale of rapid riches has sent shockwaves through the crypto community, raising eyebrows and questions about the mysterious ways of the crypto market.\n\nFrom Ethereum to Fortune: A Trader’s Swift Success\n\nDramatic gain from 0.34 ETH to $550,000.\n\nLookonchain reports on the trader’s fast-paced trading.\n\nSequence of trades viewed as potentially informed by insider knowledge.\n\nStrategic Trades Behind the Windfall\n\nDetails of the trader’s actions revealed by Lookonchain.\n\nInitial purchase of 80 million FERRET tokens following the token’s launch.\n\nProfit-making by selling FERRET tokens in batches.\n\nTrader’s remaining FERRET token stash valued at nearly half a million dollars.\n\nThe Trader’s Mysterious Identity\n\nSpeculation about the trader’s possible link to the FERRET token creator.\n\nEvidence of shared wallet addresses between the trader and the token creator.\n\nRising curiosity about the trader’s true identity and intentions.\n\nNot the First Crypto Fairytale\n\nPrevious similar incidents of substantial gains from meme coins.\n\nQuestions about the timing and insider connections in such trades.\n\nContinuing trend of meme coin trading leading to significant profits.\n\nThe story of an anonymous trader’s overnight success is not just a testament to the volatility and opportunity within the crypto market; it’s a modern-day digital fairy tale that keeps the dream alive for millions of traders worldwide. However, it also casts a spotlight on the shadowy edges of meme coin trading, where the line between luck and insider knowledge can often appear blurred.\n\n: The content featured is created with the assistance of generative AI, accompanied by human review to ensure quality. Despite our efforts for accuracy, it may contain errors and should not replace professional or financial advice. This material should not be the basis for significant decisions. Any offensive or inaccurate content should be reported. Readers are urged to perform their own due diligence before engaging in financial actions, as Examiner.com assumes no liability for monetary losses. Details about our AI content process can be accessed on our AI Generated Content Policy page."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9wYXJhbGxlbGl6ZWQtZXZtcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "What Are Parallelized EVMs? A Beginner's Guide - Unchained - Unchained",
        "content": "Parallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency, allowing multiple transactions to be executed at the same time rather than sequentially.\n\nThe blockchain landscape is constantly evolving to overcome limitations and unlock new possibilities. One of the latest innovations to address scalability within the Ethereum ecosystem is Parallelized Ethereum Virtual Machines (PEVMs).\n\nRead on to learn about parallelized EVMs and the potential impact of parallelization on Ethereum’s scalability.\n\nWhat Are Parallelized EVMs?\n\nTo understand parallelized EVMs, let’s first grasp the Ethereum Virtual Machine (EVM).\n\nThe EVM allows for the execution of smart contracts on the Ethereum Network. It provides the infrastructure vital to all transactions happening on the blockchain. The growing adoption of Ether and other Ethereum-based tokens strains the EVM, leading to calls for its scaling.\n\nOne intervention that’s gaining traction is parallelized EVMs.\n\nParallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency by allowing multiple transactions to be executed simultaneously rather than sequentially.\n\nImagine them as supercharged versions of their predecessor capable of handling multiple transactions together. This approach is crucial in tackling the blockchain trilemma as it significantly reduces latency, boosting transaction throughput.\n\nSome of the front runners in the PEVM adoption are the Sei network, Neon, and Monad. The Sei Network went live in August 2023, attracting roughly 29,000 active users. Neon is also active and working on integrating Ethereum decentralized applications (dApps) into the Solana ecosystem. Meanwhile, Monard is yet to launch despite being production-ready.\n\nHow Do Parallelized EVMs Work?\n\nPEVMs leverage the power of parallel processing to achieve timely and scalable transactions.\n\nUnlike the typical EVMs that handle transactions back-to-back, PEVMs split transactions into smaller, independent tasks that can be tackled simultaneously. This means setting up different points for the concurrent handling of multiple trades.\n\nThere are many approaches to parallel processing, but two popular ones stand out:\n\nSharding : Imagine dividing the Ethereum blockchain into smaller, self-contained shards, each with its own EVM. Transactions are then distributed across these shards, allowing for independent and simultaneous processing.\n\nRollups: These batch transactions off the main Ethereum chain, processing them on a separate layer, and then re-submitting them to the mainnet for verification. This significantly reduces the burden on the main Ethereum network, leading to faster and cheaper transactions.\n\nThe Potential Impact of Parallelized EVMs on Ethereum\n\nPEVMs can significantly reduce transaction times and fees by removing network bottlenecks, making Ethereum more user-friendly and accessible to developers and users alike.\n\nWith PEVMs paving the way for faster and cheaper transactions, Ethereum can potentially handle a much larger volume of activity. This opens the door to widespread adoption of dApps and DeFi, bringing the power of blockchain to a broader audience.\n\nThe increased processing power of PEVMs could unleash a wave of more complex and resource-intensive dApps, pushing the boundaries of what’s possible on Ethereum. Applications that might have previously been impractical on the blockchain could become feasible.\n\nAdditionally, making improvements on Ethereum’s mainnet could significantly impact other Ethereum layers. L2 scaling solutions could gain more attention, leading to further development and adoption among users.\n\nPEVMs, however, also present a possible downside. The technical complexity required to implement parallelized EVMs might lead to centralization if only a few big players can implement it. They could also present backward compatibility and transition challenges to existing smart contracts.\n\nBenefits and Drawbacks of Parallelized EVMs\n\nPEVMs could hold so much promise for crypto enthusiasts. But like any technology, it could have its drawbacks too.\n\nPros\n\nReduced transaction latency: Devolving transaction handling to many units hastens their confirmation. Users will no longer have to endure lengthy completion times due to network clogging.\n\nLower transaction fees: PEVMs streamline transactions, eliminating the need to pay more for prioritized exchanges, which makes transaction fees more affordable.\n\nEnhanced Interoperability: PEVM projects such as Neon are working on bringing Ethereum dApps to Solana. Such initiatives will make it easy for users to interact with their peers on different networks without migrating to their platforms.\n\nCons\n\nIncreased complexity: Implementing and maintaining robust PEVMs can be technically demanding. As such, developers and users may face a steep learning curve.\n\nPotential security risks: Parallel processing introduces new synchronization and coordination challenges, increasing the likelihood of bugs and errors with improper implementation\n\nFinal Word\n\nParallelized EVMs are the latest attempt at achieving Ethereum scalability. By introducing parallel processing capabilities, PEVMs open the doors to various applications, from real-time financial transactions to seamless cross-chain exchanges. However, these novel projects require meticulous development and rigorous security edits to ensure stability."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1yZW1haW5zLXRoZS1kb21pbmFudC1ibG9ja2NoYWluLWZvci1kZXZlbG9wZXJzLXJlcG9ydC_SAVxodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoZXJldW0tcmVtYWlucy10aGUtZG9taW5hbnQtYmxvY2tjaGFpbi1mb3ItZGV2ZWxvcGVycy1yZXBvcnQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Remains the Dominant Blockchain for Developers: Report - CryptoPotato",
        "content": "Ethereum continues to be the number one blockchain among crypto developers, with more than 70% of new contract codes first deployed on the network, according to the latest report by Electric Capital.\n\nAlso, there has been a spread in the distribution of developers globally, with more crypto devs living outside North America, as opposed to steady growth recorded in regions such as Latin America and Western Africa.\n\nMore Devs Involved in Multi-Chains\n\nElectric Capital’s 2023 Crypto Developer Report revealed that most of the smart contract code launched on the Ethereum network is unique, while 71% of contracts are first deployed on Ethereum, making it the top blockchain choice for developers.\n\nMeanwhile, the number of multi-chain developers expanded in 2023. Based on the report, multi-chain developers grew from three percent in 2015 to 34% in 2023, signaling a growth of over 10x in eight years.\n\nIt is also no surprise to see the cross-pollination of developers across Ethereum and Ethereum Virtual Machine (EVM) blockchains. Such blockchains include BNB Chain, Polygon, Avalanche, and several layer 2 networks. These chains all use the same smart contract logic as Ethereum.\n\nAccording to Electric Capital, cross-pollination occurs between BNB Chain, Polygon, and Ethereum, with all three chains sharing “at least 30% of their multi-chain deployers with each other.”\n\nFurthermore, BNB shares the largest number of multi-chain devs, with Ethereum at 39%, followed by Polygon at 36% and Arbitrum at 24%, while Avalanche is the lowest at 18%.\n\n40% of Developers Worked on Ethereum and Bitcoin in 2023\n\nIn all, a fourth of all blockchain developers deploy either on Ethereum or Bitcoin, with the latter accounting for a larger number of monthly active developers at 7,864 as of December 2023, which was, however, a 25% drop from over 10,400 the previous year,\n\nBitcoin, meanwhile, recorded 1,071 monthly active developers, declining 19% from 1,322 in December 2022. Most of the decline came from part-time developers and those working on multi-chains, with the report noting that developers who focused solely on Bitcoin were likely to continue working on the network.\n\nMeanwhile, more than 1000 developers have supported Bitcoin since 2017. The highest number of new developers joined the network in 2022, at over 2,700.\n\nAlthough Bitcoin transaction volumes skyrocketed in 2023 following the resurgence of Ordinals, only three percent of all Bitcoin developers worked on the project, while 40% were dedicated to Bitcoin layer 2 networks and other scaling solutions.\n\nApart from Bitcoin and Ethereum, there were also over 9,300 monthly active developers working on the top 200 crypto ecosystems by market capitalization as of December 2023. The figure, however, is a 31% reduction from 2022 records.\n\nTotal Number of Blockchain Devs Fell By Almost a Quarter in 2023\n\nAs noted on Electric Capital’s report, monthly active developers dropped 24% to 22,411 in 2023, from 29,611 the previous year, with newcomers less than one year in crypto contributing to a majority of the losses.\n\nMost of these developers with the least tenured experience came into the industry during the bull market and tended to leave during the bear market. The number of newcomers peaked in 2022 at over 90,000 after Bitcoin’s value rose to more than $69,000 and the total market capitalization at nearly $3 trillion in November 2021\n\n“Newcomers who joined in 2022 are the ones who churned and are driving the overall -24% developer loss.”\n\nIn contrast, those who have been in crypto for at least over a year continue to grow and contribute to the ecosystem, with 75% of codes by such developers.\n\nBlockchain developers with more than one year of experience in the industry grew 16% in 2023, while their established colleagues — people over two years in crypto — grew 52% in the last five years, reaching an all-time high.\n\nThe report also touched on developer distribution globally, stating that 74% are located outside of North America, while the US lost 14% of its developer share since 2018, controlling only 26% in 2023.\n\nBlockchain developers, however, are growing in Latin America, Western Africa, South Asia, Southern Europe, and Eastern Europe, increasing by 20% since 2018."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NvbXBhbnkvZS1jb21tZXJjZS1hbmQtY3J5cHRvLWdvLWhhbmQtaW4taGFuZC1maW5kLW91dC13aHktcHVzaGQtcHVzaGQtcHJlc2FsZS1pcy1tYWtpbmctZXRoZXJldW0tZXRoLWFuZC1iaXRjb2luLWJ0Yy1pbnZlc3RvcnMtdHVybi10aGVpci1oZWFkcy_SAbIBaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9jb21wYW55L2UtY29tbWVyY2UtYW5kLWNyeXB0by1nby1oYW5kLWluLWhhbmQtZmluZC1vdXQtd2h5LXB1c2hkLXB1c2hkLXByZXNhbGUtaXMtbWFraW5nLWV0aGVyZXVtLWV0aC1hbmQtYml0Y29pbi1idGMtaW52ZXN0b3JzLXR1cm4tdGhlaXItaGVhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "E-commerce and Crypto go hand in hand, find out why Pushd (PUSHD) presale is making Ethereum (ETH) and Bitcoin (BTC) investors turn their heads - NewsBTC",
        "content": "Shopping on the internet and using digital money are closely connected in the evolving world of online finance. Recognized currencies such as Ethereum (ETH) and Bitcoin (BTC) are widely accepted, and a recently introduced digital currency called Pushd (PUSHD) has gained attention from informed investors.\n\nLet’s explore the connection between online shopping and digital currency, explaining why Pushd’s presale is gaining attention from Ethereum (ETH) and Bitcoin (BTC) enthusiasts. We will analyze market trends, insights from influential figures, and the influence Pushd (PUSHD) is having in the decentralized marketplace.\n\nJoin us as we navigate the coming together of these dynamic fields, where opportunities for innovation are plentiful.\n\nEthereum (ETH) and Bitcoin (BTC) Market Overview\n\nSamson Mow, the Chief Executive Officer of Jan3 and a strong supporter of Bitcoin (BTC), subtly expresses concerns about other assets such as Silver and Ethereum (ETH), highlighting the superiority of Bitcoin.\n\nDespite continuous discussions, Bitcoin’s market capitalization exceeds that of Ethereum, and Mow refers to Ethereum as the “less intelligent person’s Bitcoin.” BTC shows a positive signal known as a golden cross on the weekly chart, indicating potential long-term upward momentum.\n\nNevertheless, Bitcoin encounters a challenge in surpassing the $43,000 mark, and Santiment reports historically elevated risk levels for both Bitcoin and alternative coins.\n\nPushd (PUSHD) – Web3 Marketplace Revolutionizing E-commerce\n\nPushd (PUSHD) enters the scene as a decentralized web3 marketplace challenging traditional e-commerce giants like Amazon and eBay. Operating on the blockchain, Pushd connects global buyers and sellers, offering instant deposits, withdrawals, and a swap service.\n\nThe presale introduces Pushd (PUSHD) tokens with governance rights, allowing investors to propose platform changes. Pushd emphasizes transparency, decentralization, and cost-effectiveness, positioning itself as a first-mover in the evolving market.\n\nWith eternal locked liquidity, investors perceive Pushd (PUSHD) as a secure and promising opportunity for early investment.\n\nMarket Dynamics and Investor Considerations\n\nBitcoin (BTC) experiences selling pressure despite robust ETF inflows, with Santiment signaling high-risk profit levels. Ethereum’s valuation debate continues, with Mow’s analogy fueling discussions.\n\nPushd’s entry into the decentralized marketplace aligns with the growing demand for transparent and user-friendly e-commerce solutions. Investors anticipate capitalizing on Pushd’s potential to disrupt the e-commerce sector as the presale unfolds.\n\nThe focus on blockchain, decentralization, and governance adds value to Pushd’s appeal in a rapidly evolving crypto landscape.\n\nIn summary, the convergence of e-commerce and crypto gains momentum with Pushd’s (PUSHD) presale, offering a unique approach to decentralized online marketplaces amidst broader market dynamics and debates surrounding leading cryptocurrencies.\n\nFind out more about the Pushd presale at their official website\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jYXJkYW5vLWFkYS1zdXJwYXNzZWQtZXRoZXJldW0tZXRoLW9uLW11bHRpcGxlLWZyb250cy1kZXRhaWxzL9IBW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jYXJkYW5vLWFkYS1zdXJwYXNzZWQtZXRoZXJldW0tZXRoLW9uLW11bHRpcGxlLWZyb250cy1kZXRhaWxzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Cardano (ADA) Surpassed Ethereum (ETH) on Multiple Fronts: Details - CryptoPotato",
        "content": "TL;DR\n\nCardano’s whale transaction volumes and NFT sales have been notable lately.\n\nADA’s price has recently underperformed compared to ETH, but experts anticipate a potential rally influenced by upcoming events and developments in the crypto industry.\n\nAccording to IntoTheBlock data, Cardano whales have settled an average of $13 billion in large daily transactions for the past week. In comparison, Ethereum’s figure stood at $5 billion.\n\nCardano whales have been quite active for the past few months. $13B in large transactions (>$100k) is being settled on Cardano daily on average. A significant amount, if you compare it to Ethereum’s $5B 7-day average. pic.twitter.com/8rjeQZaonU — IntoTheBlock (@intotheblock) January 18, 2024\n\nCardano has also made progress on the non-fungible token field, with an NFT sales volume of over $7.6 million for the last 30 days. Ethereum might be a leader with approximately $341 million, but this actually represents a 23% decline on a monthly basis.\n\nDespite the aforementioned developments, Cardano’s ADA has performed worse than ETH as of late. The former currently trades at $0.50 (per CoinGecko’s data), or a 14% plunge on a weekly scale. ETH is hovering around $2,470 and is down 5% for the same period.\n\nHowever, some experts think ADA could be on the verge of a rally, taking into account the importance of several upcoming events.\n\nDan Gambardello (Founder of Crypto Capital Venture) outlined the Coinbase v. SEC lawsuit as a major catalyst, suggesting that a victory for the company might trigger a “mega altcoin run.”\n\nRecall that the regulator sued the exchange last summer, accusing it of breaching several laws and offering trading services with alleged unregistered securities such as ADA, SOL, MATIC, and more.\n\nThose curious to check other Cardano price predictions can take a look at our dedicated video below:"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZXRoZXJldW0tYWx0ZXJuYXRpdmUtdGhhdC1jYW4tYmUtYXMtbWFzc2l2ZS1hcy1ldGgtYW5kLWlzLXByaWNlZC1hdC0wLTA4LWp1c3QtZ290LWNlcnRpay1hdWRpdGVkLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 15:42:46 GMT",
        "title": "Ethereum alternative that can be as massive as ETH and is priced at $0.08 just got Certik Audited - Cryptonews",
        "content": "Ethereum alternative that can be as massive as ETH and is priced at $0.08 just got Certik Audited\n\nThe world of cryptocurrencies has evolved dramatically since the inception of Bitcoin. Ethereum emerged as the pioneer of smart contracts and decentralised applications, offering a new paradigm for blockchain technology. However, the cryptocurrency space is ever-evolving, and investors are always on the lookout for the next big thing. Enter Retik Finance (RETIK), an Ethereum alternative that has been making waves in the crypto world. What sets Retik Finance apart is its commitment to stability, security, and real-life integration. Notably, it has recently received a CertiK audit, adding credibility and trustworthiness to the project.\n\nRetik Finance’s Impressive Journey\n\n\n\nRetik Finance has been turning heads since the start of its presale. Early investors have been rushing to bag this token, and for good reason. The project aims to bridge the gap between the fiat and crypto worlds, making cryptocurrency more practical and accessible for everyday use.While Bitcoin and other cryptocurrencies were initially envisioned to challenge fiat systems, the adoption of cryptocurrency for payments has been slow due to various challenges, including the inertia of the existing fiat payment ecosystem.Retik Finance acknowledges these challenges and offers a different approach. Instead of trying to replace fiat currency, it seeks to create an interface that seamlessly connects the fiat and crypto realms. Leveraging its extensive experience in fiat currency payment processing and its early entry into blockchain technology, Retik Finance divides its bridging agenda into three key categories:\n\nPayment Functions for Commercial Applications: Retik Finance facilitates large-scale commercial applications by providing essential functions such as SwiftPay, which initiates automatic RETIK transfers and authorizes payees to complete payment steps. It also considers multilevel accounts for coordinating multiple authorities in organisational structures. Support Functions for Commercial Applications: Recognizing the need for ongoing adjustments in these systems, Retik Finance emphasises efficient and knowledgeable operational support. Performance Issues with Cryptocurrency Itself: To address liquidity, cross-chain payments, volatility, and transparency in the cryptocurrency realm, Retik Finance takes steps to optimise non-custodial processes and implement well-designed solutions.\n\nCertik Audit: Elevating Trust and Credibility\n\n\n\nThe recent CertiK audit of Retik Finance is a significant milestone that sets the project on a path to success. CertiK is a leading blockchain security firm known for its rigorous auditing processes. When a project receives a CertiK audit, it means that it has undergone a thorough examination of its smart contracts and code to ensure security and reliability. This certification instils confidence in investors, as it signifies that the project is committed to transparency and best practices.\n\nRetik Finance’s Road to Success\n\n\n\nAs of writing, Retik Finance is in its Presale Stage 6, with 1 RETIK priced at $0.080. Impressively, it is on the verge of selling out this stage, with 84.29% of the tokens already sold. The project has raised $10,398,835 out of its $13,150,000 target, with 185,428,147 tokens sold out of a total supply of 220,000,000 tokens.Moreover, Retik Finance has gained visibility on popular cryptocurrency data platforms like CoinMarketCap and CoinGecko, further validating its presence in the crypto space.\n\nThe Vision of Retik Finance\n\n\n\nRetik Finance’s vision extends far beyond the current financial landscape. It envisions a future characterised by heightened financial empowerment, dependability, and transparency for individuals, enterprises, institutions, and governments worldwide. At its core, Retik’s vision is built on cutting-edge technologies designed to serve as bridges, connecting the worlds of cryptocurrency and traditional fiat payment systems.Retik’s vision centers on breaking down barriers, ensuring that anyone, regardless of their location or financial standing, can participate in a global financial ecosystem that is inclusive and empowering. By leveraging innovative technologies, Retik aims to revolutionise financial transactions, introducing a paradigm shift that transcends the limitations of existing systems.In Retik’s envisioned future, financial transactions are no longer constrained by conventional limits but are facilitated by the seamless integration of crypto and fiat payment systems. This integration promises to redefine the dynamics of financial interactions, offering individuals greater control over their financial destinies. Enterprises, institutions, and governments stand to benefit from increased efficiency, reduced complexities, and heightened transparency, departing from the conventional norms that have often hindered progress.In essence, Retik Finance’s vision paints a future where technology acts as an enabler, erasing the lines that traditionally separated crypto and fiat systems. It’s a future where financial transactions transcend geographical boundaries, opening avenues for greater financial inclusion and innovation. As Retik pursues its mission in the complex intersection of finance and technology, its vision serves as a guiding light, illuminating the path toward a more empowered, dependable, and transparent global financial ecosystem.>>>> Click Here To Buy RETIK Tokens <<<<\n\nRetik Finance’s Mission\n\n\n\nRetik Finance is driven by a mission to ensure the accessibility of blockchain services and value using fiat currency, while also making fiat-based services and value accessible through cryptocurrency. The primary objective is to advance the adoption of blockchain technology by effectively bridging the gap between cryptocurrency and traditional fiat currency. Within this overarching mission, Retik has outlined four key goals:\n\nDecentralisation: Retik emphasises decentralisation as a foundational principle in blockchain-based cryptocurrencies. Decentralisation eliminates inefficient, arbitrary, and proprietary procedures, making transactions more cost-effective and user-friendly. The Retik ecosystem comprises five decentralised layers, each governed by an open payment consensus protocol, ensuring compatibility with decentralised applications. Security: Security is paramount in the Retik ecosystem. It employs a robust credit-scoring architecture to ensure trust and reliability in transactions. Retik recognizes the value of blockchain’s transparency in providing a level of trust but also acknowledges the need for trust-based protocols like credit scores in specific scenarios. Sustainability: Retik Finance believes in sustainable evolution through consensus mechanisms. These mechanisms foster innovation and are essential for the long-term sustainability of ecosystems. By empowering innovators connected to the market and creating effective incentive structures, Retik aims to encourage sustainable growth and progress within the ecosystem. Low Cost & High Efficiency: Retik’s decentralised operational support infrastructure plays a pivotal role in managing various operational tasks efficiently. By implementing smart contracts within this infrastructure, Retik streamlines and automates processes, enhancing efficiency and effectiveness across the ecosystem.\n\nConclusion\n\n\n\nRetik Finance has positioned itself as a promising Ethereum alternative with a strong focus on bridging the gap between the crypto and fiat worlds. Its commitment to stability, security, and real-life integration sets it apart from the crowd. The recent CertiK audit adds a layer of credibility that further enhances Retik Finance’s reputation.As the project continues to gain momentum and investors show enthusiasm during its presale stages, Retik Finance is a name to watch in the ever-evolving world of cryptocurrencies. Its vision of a future where crypto and fiat seamlessly coexist, along with its mission to empower users and institutions, makes Retik Finance a significant player in reshaping the financial landscape. With innovative technologies and a dedication to improving financial accessibility, Retik Finance is poised to make a lasting impact in the world of blockchain and decentralised finance.\n\nClick Here To Take Part In Retik Finance PresaleVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance\n\nDisclaimer: The text above is a press release that is not part of Cryptonews.com editorial content."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ibG9ja2NoYWluLXNwZWNpYWxpemF0aW9uLXNvbGFuYS10cm9uLXdheC1ibmIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Blockchain Specialization – Which Platforms Lead in Different Areas? - CCN.com",
        "content": "Key Takeaways\n\nFollowing a model established by Ethereum, modern blockchains can run a variety of applications.\n\nHowever, various user groups have developed preferences for different blockchains, based on their relative merits.\n\nBlockchain specialization runs counter to the generalized logic first proposed by Ethereum.\n\nInspired by Bitcoin’s decentralized design, yet frustrated with its lack of programmability, Vitalik Buterin designed Ethereum as a general-purpose smart contract platform that could support complex software applications. Later generations of blockchain have largely followed Ethereum’s model. In theory, each of these Turing-complete platforms can execute any computation a user requires, as long as they have sufficient gas money. Nevertheless, the universe of blockchains that exist today can be differentiated by their strengths.\n\nOf course, Ethereum remains a powerful force in Web3. But a countercurrent to its generalist logic can also be observed in the distinct specialization of various crypto tribes: communities of Solana, Tron, BNB and Polygon users who have each carved out a niche for their favored blockchain.\n\nThe Rise of DeFi on Solana\n\nAlthough Ethereum’s Uniswap protocol is usually credited with ushering in the revolution in Decentralized Finance, these days, most DeFi trading activity has migrated away from the Layer 1 Ethereum network to more efficient platforms with lower gas fees.\n\nFor example, since Uniswap V3 branched out to sidechains and Layer 2s, the protocol’s Arbitrum and Polygon deployments have typically generated 3 to 5 times higher trading volumes than its Layer 1 instance. Meanwhile, alternative ecosystems now host an array of new DeFi platforms that have forged ahead on their own.\n\nAs we go deep into Jupuary, we would like to acknowledge everyone who's making it possible. Additional shoutout to @jito_sol for the excellent airdrop lib we are building on top of and @Austin_Federa for being super proactive and pulling together everyone needed from labs! https://t.co/Ktrsz4VKJf — Jupiter 🪐 (@JupiterExchange) January 17, 2024\n\nWhile BNB was the first independent blockchain to challenge Ethereum’s status as the most popular DeFi venue, the breakout success of 2023 was Solana. In the last 30 days, the platform’s top 3 DeFi services – Jupiter, Raydium and marginfin – attracted a combined total of 1.5 million users, surpassing the most popular BNB and Ethereum DeXs.\n\nSince mid-December, Solana’s burgeoning DeFi ecosystem has been boosted by surging interest in SPL meme coins like Bonk.\n\nTron Takes the Stablecoin Crown\n\nMirroring the trend set by DeFi users, stablecoin activity has also relocated in recent times, with Tron being the most notable beneficiary of the flight from Ethereum.\n\nIn the last 3 years, Ethereum’s stablecoin transaction count has fallen by around 20%, while Tron’s surged by 600% in the same period.\n\nMoreover, where a strong lead in trading volume balances Ethereum’s dwindling DeFi user base, the same can’t be said for stablecoin activity. Not only does Tron beat Ethereum’s transfer count, but it also comes close to matching its overall transaction volume.\n\nCongratulations on USDT on #TRON 's circulation exceeding $50 billion for the first time. Everyone in the TRON community has made a huge contribution to this achievement. The goal of issuing $100 billion on TRON stablecoins will be achieved soon! @paoloardoino @Tether_to pic.twitter.com/X7d3zm4EAE — H.E. Justin Sun 孙宇晨 (@justinsuntron) January 13, 2024\n\nThe majority of Tron’s stablecoin volumes stem from USDT transactions, which accounted for over 98% of the $366 billion sent over the network in the last year. On January 15, USDT circulating on Tron exceeded $50 billion for the first time, representing over half of the stablecoin’s total supply.\n\nWAX: The Chain of Choice for Low-Cost NFTs\n\nWhen judged by purely financial metrics, Ethereum is by far the most dominant NFT chain, accounting for over 80% of the total market. But just as Ethereum’s high gas fees have driven DeFi and stablecoin users elsewhere, they have also limited its viability for many NFT use cases.\n\nLaunched in 2017, WAX was specifically designed to make NFTs more affordable. Unlike many blockchains, minting new tokens on WAX costs just a few cents, and transferring NFTs between wallets doesn’t incur transaction fees.\n\n🍻Happy Friday, #WAXFAM ! Let's celebrate incredible #WAXNFT creators, from talented #artists to innovative #game developers & inspiring community leaders. Who inspires you on WAX? Tag your favorite creator & share your $WAXP wallet address below ⏬ pic.twitter.com/iux0iwZlQh — WAX (@WAX_io) January 12, 2024\n\nThanks to its fee-free transactions, when ranked by total cumulative sales, WAX hosts 8 of the 20 most popular NFT collections, more than any other blockchain.\n\nThe platform is especially prominent in the blockchain gaming space. After Axie Infinity, which runs on the Ethereum sidechain Ronin, WAX-based Alien Worlds is the most popular NFT game. Since its launch in 2020, around 920,000 Alien Worlds users have generated over 7 million sales.\n\nThe Diverse Ecosystem of BNB DApps\n\nAs the first blockchain built for decentralized applications (DApps), Ethereum’s enduring popularity is maintained by a sizable network effect. According to DAppRadar , there are now more than 4,000 Ethereum-based DApps, but the platform has been knocked from the top spot by BNB chain, which hosts over 5,000\n\nBecause it was created to provide an Ethereum-like development experience, BNB’s DApp ecosystem can draw from a well-established pool of Solidity developers and is home to an array of applications.\n\nOriginally created by Binance to facilitate cryptocurrency trading, the first generation of BNB DApps skewed toward DeFi, but the ecosystem has since evolved into one of the most diverse.\n\nOften incubated by Binance Launchpad, BNB DApps are a hotbed of Web3 innovation. For example, in recent weeks the AI-powered relationship simulator SleeplessAI has emerged as the most popular BNB-based application, amassing over 3 million users since its launch earlier this month.\n\nJoining SleeplessAI at the intersection of blockchain and Artificial Intelligence (AI), the crypto-focused knowledge-sharing platform QnA3 has also gained significant traction since its launch in December 2023."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi13aWxsLTI0MDAtaG9sZC1vci1mb2xkLW1hcmtldC1kb3dudHVybi_SAWJodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2lsbC0yNDAwLWhvbGQtb3ItZm9sZC1tYXJrZXQtZG93bnR1cm4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will $2400 Hold or Fold Amid Current Market Downturn? - CoinGape",
        "content": "Ethereum price prediction: ETH has been on a remarkable upward trajectory within an ascending parallel channel since October 2023. The Ethereum price has recently achieved a significant milestone, touching a value of $2,467. This marks a subtle yet noteworthy 2.78% increase in just 24 hours, reflecting a market sentiment. The trading volume has also surged, reaching $6.7 million in the same period. With a robust market capitalization of $295 billion, ranked as the second-largest cryptocurrency.\n\nThe digital currency experienced a peak at $2,717 on January 12. Over the past week, it has consistently traded above the $2,400 resistance level, indicating a strong positive trend. Ethereum’s value has shown fluctuations within a specific range, depicting a balance of strength and uncertainty. Observing these trends, Crypto analysts suggest a bullish short-term outlook, fostering a sense of optimism about Ethereum’s prospects.\n\nadvertisement\n\nThe Cryptocurrency has recently been oscillating between $2,100 and $2,400, with bears and bulls exerting influence over the past week. Ethereum has witnessed a significant 54% increase over the past year, demonstrating resilience and an enduring bullish sentiment despite occasional dips. Moreover, in the last month alone, Ethereum has seen an impressive rally, surging by over 10%.\n\nTechnical Indicators Bolstering ETH Bullish Outlook\n\nCrypto analyst Tony highlights the critical $2,400 level for Ethereum, suggesting its breach could signal further growth. He predicts a potential rise above $2,500 soon. Despite market fluctuations, Ethereum shows remarkable on-chart resilience. Currently approaching the key resistance zone, this movement might lead to a significant breakout, continuing its upward trend.\n\n$ETH / $USD – Update Important level to hold here at $2,400 legends. Keep an eye on this and make a note of it pic.twitter.com/TK750wv4Up — Crypto Tony (@CryptoTony__) January 19, 2024\n\nIf Ethereum breaks out of its current range, the next target could be the channel’s upper resistance trend line at around $2,700. If the bullish momentum continues, there’s a possibility that Ethereum could reach as high as $3,000 in the short term. However, it’s crucial to note that a fall below the wedge’s support line, particularly at $2,410, could lead to a decline toward the channel’s lower support trend line, currently at $2,300.\n\nThe Relative Strength Index (RSI) hovers near the 53 level, indicating a relatively balanced market momentum. Ethereum’s price trajectory on a daily chart shows an upward trend, especially after breaking above its 200 Moving Average (MA) and exiting a key descending channel. This bullish trend is further evidenced by three consecutive four-hour green candlesticks, showcasing positive market sentiment.\n\nAdditionally, the Moving Average Convergence Divergence (MACD) line crossing above the signal line further supports a bullish outlook. A rising histogram complements this. The upward trajectory of the 20 Simple Moving Average (SMA) and the 50-day SMA crossing above the 200-day SMA reinforces the bullish sentiment. Furthermore, the Chaikin Money Flow indicator, currently at 0.10, is in positive territory, suggesting a bullish market outlook for Ethereum.\n\nRelated Articles"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wcm9tZXRoZXVtLXByb2RpZ3ktcG1weS1ub3ctYXZhaWxhYmxlLTA4MjQwMDAzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Prometheum Prodigy (PMPY) Is Now Available for Trading on LBank Exchange - Yahoo Finance",
        "content": "Road Town, British Virgin Islands--(Newsfile Corp. - January 21, 2024) - In a significant move for cryptocurrency and mobile technology enthusiasts, LBank Exchange, a premier global digital asset trading platform, has announced the listing of Prometheum Prodigy (PMPY) on January 19, 2024. Users of LBank Exchange can brace themselves for the PMPY/USDT trading pair, which went live already.\n\n\n\n\n\nPMPY Listing Banner\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8831/195064_f11361d414b06b35_001full.jpg\n\nPrometheum Prodigy (PMPY) enhances Ethereum's scalability, transaction speed, and security by incorporating cybersecurity and AI technologies for superior network security and performance.\n\nIntroducing Prometheum Prodigy: Revolutionizing Ethereum with Advanced AI and Cybersecurity\n\nLBank Exchange is thrilled to announce the listing of Prometheum Prodigy (PMPY), a pioneering Ai Layer 2 blockchain platform, ingeniously crafted atop the Ethereum network. Its core mission is to significantly enhance scalability, transaction speed, and security within the Ethereum ecosystem. By integrating state-of-the-art cybersecurity and artificial intelligence (AI) technologies, Prometheum Prodigy sets out to revolutionize the blockchain landscape. This innovation not only aims to bolster network safety but also to boost overall performance, ensuring a more robust and efficient blockchain experience.\n\nThe platform is designed with a keen focus on overcoming the existing limitations of the Ethereum network, offering a scalable, secure, and efficient Ai Layer 2 solution. By employing advanced Ai Layer 2 scaling techniques, Prometheum Prodigy strives to reduce transaction costs while simultaneously increasing the throughput of the Ethereum network. The architecture of Prometheum Prodigy is modular, featuring an optimistic rollup protocol combined with AI and cybersecurity technologies. This unique combination allows it to inherit security from Ethereum, offer cost-effective data availability, and includes the innovative Prometheum Prodigy Bot, an autonomous tool that scans blockchains in real-time to identify and capitalize on promising crypto launches.\n\nStory continues\n\nPrometheum Prodigy is not just about its technological infrastructure; it also boasts a range of tools and resources designed to cater to a wide audience, from seasoned blockchain and DeFi experts to newcomers in the crypto sphere. Among these tools are Prodigy Stake, an advanced staking platform; Prodigy Flip, a revolutionary crypto trading mobile app with a decentralized exchange and AI analytic tools; Prodigy Chain, which enhances the Ethereum network with Ai Layer 2 scaling techniques; and Prodigy AI Integrations, which streamline smart contracts on the Ethereum network. Moreover, the Prodigy Robotic Sniper represents a cutting-edge solution in DeFi crypto trading, powered by legendary algorithmic trading functionalities and advanced AI.\n\nIn summary, Prometheum Prodigy represents a bold and innovative step in the evolution of blockchain technology. It stands out as a testament to the potential of combining AI, cybersecurity, and blockchain technology, striving to create a more secure, efficient, and user-friendly experience within the Ethereum ecosystem. With its comprehensive suite of tools and resources, Prometheum Prodigy is poised to be a significant player in the blockchain and fintech industries, offering a unique blend of technology and utility that addresses the needs of a diverse range of users.\n\nAbout PMPY Token\n\nPMPY, standing as the token of Prometheum Prodigy, is a distinctive Ai Layer 2 blockchain asset designed to enrich the Ethereum ecosystem by enhancing scalability, transaction speed, and security. Utilizing advanced cybersecurity and artificial intelligence technologies, PMPY aims to mitigate the limitations of Ethereum, offering a more efficient and cost-effective solution. It's an integral part of a modular platform that includes innovative tools like the Prodigy Stake, Prodigy Flip Mobile App, and Prodigy AI Robotic Sniper, all tailored to elevate the experience for both seasoned and novice participants in the crypto and blockchain sector. PMPY stands as a symbol of technological advancement and a commitment to improving the blockchain infrastructure.\n\nBased on ERC20, PMPY has a total supply of 1 billion (i.e. 1,000,000,000). The ERC20-based token is poised for its debut on LBank Exchange at 11:00 UTC on January 19, 2024. Investors who are interested in PMPY can easily buy and sell on LBank Exchange now.\n\nLearn More about PMPY Token:\n\nOfficial Website: https://www.prometheumprodigy.org/\n\nTelegram: https://t.me/prometheumPro\n\nTwitter: https://twitter.com/PrometheumPMPY\n\nContract: https://etherscan.io/token/0x1123d17fcf93ed2b41440317503346a0fdfe3ed7\n\nAbout LBank\n\nLBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.\n\nStart Trading Now: lbank.com\n\nCommunity & Social Media:\n\nl Telegram\n\nl Twitter\n\nl Facebook\n\nl LinkedIn\n\nl Instagram\n\nl YouTube\n\nPress contact:\n\npress@lbank.com\n\nBusiness Contact:\n\nLBK Blockchain Co. Limited\n\nLBank Exchange\n\nmarketing@lbank.com\n\nbusiness@lbank.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/195064"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlLWRpc3BsYXlzLWNvbmZsaWN0aW5nLW9wdGlvbnMtZGF0YS_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1kaXNwbGF5cy1jb25mbGljdGluZy1vcHRpb25zLWRhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum price displays conflicting Options data - CoinGape",
        "content": "The broader digital currency ecosystem remains on edge as market bulls fight to prop up Bitcoin (BTC) and Ethereum (ETH) prices amid Grayscale’s $2.2 billion GBTC outflows and conflicting Options data.\n\nIs Bitcoin (BTC) and Ethereum (ETH) Bottom In?\n\nAt the time of writing, the duo of Bitcoin and Ethereum brandishes slightly conflicting price outlooks with the former growing by 0.58% to $41,784.51 and the latter slipping by 0.48% to $2,467.64. Despite this relatively stable price outlook, the conversations around potential price bottom settling are invalidated by Deribit Options data.\n\nadvertisement\n\nAccording to Insights from the platform, the GBTC-ETF wargames triggered a massive spike in Implied Volatility (IV) of Ethereum which dropped from 64% to 47% for the week using the Deribit Volatility (DVOL) proxy. Bitcoin also recorded a shrunken volatility featuring a drop from 55% to 47%, a trend powered by Call selling.\n\nThe implications of the IV for both Bitcoin and Ethereum differ slightly. Notably, the steep drop in Ethereum came with massive selling trades recorded for the coin as some traders not only gave up on Longs with other traders but also overwriting ETH Spot AUM.\n\nPer the data presented, a total of 2,700 Calls sold about 45,000 ETH, and in March 2,900 Calls sold 28,000 ETH. This sustained selloff underscores the likelihood of a further drop in Ethereum shortly. Bitcoin on the other hand is witnessing intense accumulation as traders are leveraging the slump in prices to stack up the coin.\n\n2) The most impactful IV selling trades originated on ETH, predominantly Call selling, some giving up on Longs, and some overwriting ETH Spot AUM.\n\nFeb 2.7k Calls sold 45k\n\nMar 2.9k Calls sold 28k\n\nJan 2.6k covered to sell Apr 2.9k Calls 25k\n\nSignificant other Call 2way in Feb Calls. pic.twitter.com/8XU3djFRVV — Deribit Insights (@DeribitInsights) January 20, 2024\n\nWith this outlook, Ethereum’s bottom might be far from being set while Bitcoin’s drawdown might be clearing with the current accumulations.\n\nGrayscale Shaping Market Sentiment\n\nWith the approval and launch of the spot Bitcoin ETF being the most important update from the US stock market, the dumping of Grayscale’s GBTC has shifted the longevity of Bitcoin in investors’ portfolios.\n\nData from the crypto analytics platform IntoTheBlock pegged the average time held of coins transacted to 9 months. For this timeframe, a total of 371,930 BTC was transacted with the average price pegged at $42,663.24.\n\nWhile Grayscale’s influence is still dominant as one of the largest Bitcoin holders among the spot ETF issuers, the BTC holding timeline may shrink further as the firm’s 1.5% fee might serve as a discouragement for its existing holders to move their coins to other funds. If this selloff trend continues to play out, the spot and Options market volatility may continue for the rest of the month and price will also reflect this trend."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL25ld3MvMjAyNC8wMS8yMi9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLXFxcS1hbmQtc3B5LWV0ZnMtaGl0cy1yZWNvcmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction as QQQ and SPY ETFs Hits Record - Bankless Times",
        "content": "Ethereum price has pulled back in the past few days as sentiment in the crypto industry has waned a bit. After peaking at $2,717 on January 12th, the coin has moved into a correction, falling by over 10%. It has dropped to its lowest point since January 10th.\n\nRisk-on sentiment\n\nEthereum, Bitcoin, and other cryptocurrency prices have plunged in the past few days as investors sell the spot Bitcoin ETF news. This is a common occurrence where an asset rallies ahead of a major event and then pulls back after it happens. It happens because the news event, in this ETF approval, was already baked in the market.\n\nStill, there are a few potential catalysts that could push Ethereum price higher soon. First, investors are embracing a risk-on sentiment as evidenced by the performance of the stock market. Last Friday, Invesco QQQ (QQQ), which tracks the Nasdaq 100 index and the SPDR S&P 500 index (SPY) jumped to a record high.\n\nThese indices jumped as the earnings season continued last week. Some of the notable companies that released their results last week were Goldman Sachs, Morgan Stanley, and some regional banks. The earnings season will continue this week as companies like P&G, Tesla, and Netflix publish their results.\n\nThe surge in America’s equities is a sign that investors have embraced a risk-on sentiment, which is a positive thing for stocks and cryptocurrencies. In most periods, these coins tend to rally when there is this sentiment as we saw during the 2021 rally.\n\nThe other catalyst for Ethereum is that some companies like Blackrock have applied for a spot Ethereum ETF. That ETF will track the price of Ethereum and make it easier for institutional investors to invest.\n\nHowever, it is not clear whether the SEC will approve the ETF because of Ethereum’s staking features, which it introduced in 2022. Staking allows people to earn a return by just holding the tokens, something the SEC sees as problematic since Ethereum is not regulated.\n\nEthereum price forecast\n\nThe daily chart shows that the ETH price has pulled back sharply in the past few days, pushing it into a correction. It has retested the key support at $2,450, the highest swing on December 28th. At the same time, the Relative Strength Index (RSI) and the Stochastic Oscillator have retreated to their neutral point.\n\nEthereum remains above the 50-day and 100-day Exponential Moving Averages (EMA), a bullish sign. Therefore, the outlook for ETH price is mildly bullish, with the next point to watch being at $2,700. This price is about 12% above the current level."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL3ByZXNzLXJlbGVhc2VzL2hvdy10by1tYWtlLW1vbmV5LXdpdGgtY3J5cHRvY3VycmVuY3ktbGVzc29ucy1mcm9tLWV0aGVyZXVtLXNjb3JwaW9uLWNhc2luby1hbmQtc3VpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "How To Make Money With Cryptocurrency: Lessons From Ethereum, Scorpion Casino And SUI - NewsBTC",
        "content": "Ethereum, Scorpion Casino and SUI have taught crypto investors a lot over the last year. So what are the lessons learned?\n\nEveryone wants to make money and everyone wants to make a lot of it. Cryptocurrency has emerged as an option to reap significant rewards, as well as an opportunity to take part in a different type of financial world. One of the most commonly Googled phrases is ‘How to Make Money With Crypto’. So we compiled a few of the most important lessons learnt on how to do this safely and effectively. Let’s get started.\n\nLesson 1: Ethereum & The Importance of Multifaceted Uses\n\nEthereum’s success in the cryptocurrency market teaches the importance of investing in platforms with multifaceted uses beyond just currency. Its combination of digital currency, smart contracts, and decentralized applications (dApps) creates a dynamic ecosystem that drives demand and increases its value. Investors in Ethereum benefit not only from its rising value but also from the ecosystem’s growth.\n\nFurthermore, Ethereum’s shift to a proof-of-stake model introduces opportunities for earning passive income through staking. This highlights that cryptocurrencies with innovative technologies and multiple applications can offer varied and potentially more stable investment opportunities.\n\n$SCORP Presale In Its Final Stage!\n\nLesson 2: Scorpion Casino & The Importance Of Innovation Alongside Tangible Rewards\n\nScorpion Casino’s Presale has illustrated a key lesson in cryptocurrency investment: the value of innovation and tangible rewards. Unique to their presale model is a system that allows investors to earn and withdraw rewards even before the official launch, a feature not commonly seen in other presales. Typically, investors must wait until after a launch date to realize any returns.\n\nThis pioneering approach by Scorpion Casino not only enhances the appeal of their offering but also demonstrates a commitment to providing immediate, tangible benefits to early investors. This strategy showcases how integrating innovative reward systems in a presale phase can attract investors looking for immediate returns, setting a new standard in the crypto presale market.\n\nLesson 3: SUI & The Importance Of Timing\n\nSUI hit its highest value at $1.83 on May 3, 2023, and is now stabilizing around a value of $1.24. However, its initial value was much lower and was available at $0.1. SUI’s rise in the cryptocurrency market teaches a vital lesson about the significance of timing.\n\nInvestors who adeptly timed their involvement with SUI capitalized on its potential, underlining how crucial it is to understand market trends in the fast-evolving crypto world. SUI’s story emphasizes that in cryptocurrency, making well-timed decisions is key to maximizing returns.\n\nEssential Lessons On How To Make Money With Crypto\n\nEthereum demonstrates the value of a diverse platform, blending currency, contracts, and applications to drive growth. Its shift to proof-of-stake suggests lucrative, stable opportunities through innovative tech.\n\nScorpion Casino’s presale model, offering early withdrawal rewards, underscores the effectiveness of innovation in attracting investors. SUI’s rise highlights the critical role of timing in crypto investment, where understanding market trends is key to maximizing returns.\n\nThese cases collectively teach that success in crypto investing relies on leveraging unique platform features, whether through technology, timing, or novel models.\n\nFor more information, check out the links below.\n\nPresale: https://presale.scorpion.casino/\n\nTwitter: https://twitter.com/ScorpionCasino\n\nTelegram: https://t.me/scorpioncasino_official\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZmluYm9sZC5jb20vZWNob2VzLW9mLWJ1bGwtbWFya2V0cy1iaXRjb2luLWFuZC1ldGhlcmV1bXMtc2lnbmlmaWNhbnQtdXB0cmVuZHMtYm9ycm9lLWZpbmFuY2UtcHJlc2FsZXMtcm9hZC10by01bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Echoes of Bull Markets: Bitcoin and Ethereum's Significant Uptrends; Borroe Finance Presale's Road to $5M - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nBitcoin and Ethereum are riding a wave reminiscent of past bull markets, signaling exciting times ahead in the crypto universe. And that’s not all – Borroe Finance, a rising star built on the Polygon blockchain, is making its own impressive strides with its ongoing presale. Let’s break down these thrilling developments and see why they’re the buzz of the town.\n\n>>BUY $ROE TOKENS NOW<<\n\nBitcoin and Ethereum: Riding the Bull Market Wave\n\nBitcoin and Ethereum, the two titans of the crypto world, are showing signs of significant uptrends, echoing the bull markets of the past. It’s like déjà vu, but with a twist of 2024.\n\nBitcoin’s Halving Hype\n\nThe Halving Effect: Slated for April 2024, the Bitcoin halving will slash the block reward from 6.25 to 3.125 BTC. Historically, these events have sparked notable market movements.\n\nSpeculative but Promising: Analysts are cautiously optimistic. Though past patterns aren’t bulletproof predictors, there’s a palpable buzz around the potential impact of this halving.\n\nEthereum’s Scalable Future\n\nEthereum’s Growth Spurt: Thanks to factors like the Shapella upgrade and the buzz around spot crypto ETFs, Ethereum’s price has seen a significant surge.\n\nThe Cancun Upgrade: With its focus on scalability and security, the upcoming Cancun upgrade could further bolster Ethereum’s capacity for layer-2 transactions.\n\nBorroe Finance: A Presale Phenomenon\n\nShifting focus to Borroe Finance, this platform is a game-changer in the world of crowdfunding, blending AI-driven efficiency with the exciting realm of NFT Gaming.\n\n>>BUY $ROE TOKENS NOW<<\n\nBorroe Finance’s Crowdfunding Revolution\n\nAI Meets Crowdfunding: Borroe Finance is reinventing crowdfunding with AI, making the process smoother and more efficient.\n\nis reinventing crowdfunding with AI, making the process smoother and more efficient. NFT Integration: By allowing users to mint NFTs based on future earnings, Borroe Finance is creating a unique ecosystem for investors and creators alike.\n\nThe Borroe Finance Presale: Your Ticket to Growth\n\nThe Borroe Finance presale is in full swing, and it’s a train you don’t want to miss. The $ROE governance tokens are priced attractively at $0.019, and the presale is on its way to hitting a whopping $5M.\n\nWhy Invest in Borroe Finance?\n\nDiverse Payment Options: Whether you’re into Bitcoin, USDT, BNB, ETH, or card payments, Borroe Finance makes it easy for you.\n\nmakes it easy for you. Potential for Exponential Growth: With its innovative approach and the stability of the Polygon blockchain, Borroe Finance is poised for significant growth.\n\nThe Crypto Landscape: Diverse and Dynamic\n\nThe current trends in Bitcoin and Ethereum, coupled with the rise of platforms like Borroe Finance, signal a diverse and dynamic crypto landscape. From liquidity pools and CrossFi to token swaps and Dapps, the crypto world is more vibrant than ever.\n\nFor crypto enthusiasts and investors, this is an era of opportunities. The blend of established giants like Bitcoin and Ethereum with emerging platforms like Borroe Finance provides a rich tapestry of investment options.\n\nConclusion: The Future of Crypto is Here\n\nIn conclusion, as Bitcoin and Ethereum echo past bull markets and Borroe Finance makes waves with its presale, the crypto world is buzzing with activity and potential. Whether you’re a long-time HODLer, a fan of NFT Gaming, or intrigued by the prospects of governance tokens, these developments offer a glimpse into a future where digital currency isn’t just a trend – it’s the new financial normal.\n\nSo, are you ready to be part of this revolution? The Borroe Finance presale is your chance to join the future of finance. Don’t let FOMO get you – jump in and be part of the excitement!\n\nLearn more about Borroe Finance ($ROE) here:\n\nVisit Borroe Finance Presale | Join The Telegram Group | Follow Borroe Finance on Twitter"
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL3B1bHNlY2hhaW5zLXR2bC1kb3VibGVzLWluLTctZGF5cy13aGF0LWlzLXVwLXdpdGgtdGhlLWV0aGVyZXVtLWZvcmsv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vcHVsc2VjaGFpbnMtdHZsLWRvdWJsZXMtaW4tNy1kYXlzLXdoYXQtaXMtdXAtd2l0aC10aGUtZXRoZXJldW0tZm9yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Fork PulseChain Records TVL Surge - CoinGape",
        "content": "PulseChain, an Ethereum fork, has surpassed the Total Value Locked (TVL) of $403 million. The growth has positioned it as the 11th largest in terms of TVL, according to DefiLlama.\n\nPulseChain houses 34 protocols and has seen a TVL increase of 110% over the past week.\n\nadvertisement\n\nPulseX is the largest protocol on PulseChain. It is a decentralized exchange (DEX) that contributes a TVL of $234.45 million to the chain. As an Ethereum competitor that was born to solve the scalability issue on the OG blockchain, it is still behind.\n\nPulseChain is 0.71% of total TVL\n\nIn terms of total dollars locked, PulseChain accounts for only 0.71% of the market, while Ethereum dominates at over 57%.\n\nHowever, its recent rise is noteworthy. This surge in TVL began post-January 8, when it was just over $128 million. At the same time, the approval of the first spot Bitcoin ETF was just around the corner. The US SEC approved the much-awaited ETP on January 10, pushing liquidity into the market.\n\nThis contributed to the rise in the chain as well, with the TVL hitting $209 million by January 14 and soaring to $496.5 million by January 19. In the process, the conversation around Ethereum ETFs has also been adding optimism to the chain. In December, GoPulse said in a statement that it has unleashed interoperability by allowing trading between Pulse and Ethereum.\n\nPulseChain launched in May last year and has been operational for eight months. Meanwhile, PulseX enables users to exchange tokens on the blockchain in a decentralized setup. It is somewhat akin to Uniswap on Ethereum.\n\nPulseChain comes wrapped in controversies\n\nRichard Heart, the founder of HEX and developer of PulseChain and PulseX, said in a recent post on X that there are benefits of integrating major stablecoins like $DAI, $USDC, and $USDT directly on PulseChain. According to him, this could enhance security and reduce costs.\n\nIf you got $DAI, $USDC & $USDT to have their stable coins directly on PulseChain, as they do on other networks, it would increase security and reduce costs. PulseChain is nearly the most decentralized and secure L1 in the world. PulseChain has operated flawlessly since launch… pic.twitter.com/xVWRuWkfjn — Richard Heart (@RichardHeartWin) January 20, 2024\n\nDeFi analyst @goldk3y_ underlined the growth of PulseChain, citing over 700,000 active wallets. He is betting on PulseChain’s growth, stating, “There is currently $112M bridged to PulseChain. Up +$42M in the past 7 days.”\n\nHe highlighted that PulseChain boasts 100% uptime, low transaction costs, a growing developer community, and over 52,000 validators, making it a strong competitor in the space.\n\nThe Pulse Wallet noted on Saturday that DAI is increasingly moving from Ethereum to PulseChain. It has reportedly surpassed its previous high, which was achieved in June 2023. Although confidence in the chain is on the rise, it’s not without setbacks.\n\nIn July last year, the SEC sued Heart for conducting an unregistered securities offering, targeting HEX, PulseChain, and PulseX.\n\nMeanwhile, the founder also has a reputation for boosting his project with massive claims. He was pulled up by not only the regulators but also the community for misrepresentation and making potentially fraudulent claims."
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yNC8wMS8zNjcxMDUxNi9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLWRyb3AtYXMtZ29vZ2xlLXNlYXJjaC1pbnRlcmVzdC1pbi1zcG90LWV0ZnMtcGx1bmdlcy1hbmFseXN0LWZvcmXSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzY3MTA1MTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Drop As Google Search Interest In Spot ETFs Plunges: Analyst Foresees King Cr - Benzinga",
        "content": "Major cryptocurrencies on Sunday evening dropped as the interest in Bitcoin exchange-traded funds (ETFs) continued to wane.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EST) Bitcoin BTC/USD -0.89% $41,278 Ethereum ETH/USD -1.37% $2,436 Dogecoin DOGE/USD -6.25% $0.083\n\nWhat Happened: According to the data from Google Trends, the search interest for the keyword ‘Bitcoin ETF’ peaked at 100 (maximum interest) on January 10, but dropped to less than 8 on January 22.\n\nIn other news, Ron DeSantis, a vocal opponent of Central Bank Digital Currency, has decided to withdraw from the race for the White House.\n\n\"I can’t ask our supporters to volunteer their time and donate their resources. We don't have a clear path to victory. Accordingly, I am today suspending my campaign,\" DeSantis shared the news on X (formerly Twitter). \"I will not stop now. It's clear to me that a majority of Republican primary voters want to give Donald Trump another chance.\"\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Manta Network MANTA/USD +20.52% $2.68 Siacoin SIA/USD +7.28% $0.013 Ronin RON/USD +7.17% $2.43\n\nThe global cryptocurrency market cap now stands at $1.62 trillion, showing a 3.45% decrease in the past 24 hours.\n\nStock futures showed minimal movement on Sunday evening as investors aimed to capitalize on the S&P 500’s recent historic peak on Friday Futures linked to the S&P 500 edged up by 0.1%, while Nasdaq 100 futures saw a 0.2% increase. Additionally, Dow Jones Industrial Average futures ascended by 37 points, marking a 0.1% uptick.\n\nFollowing a brief retreat earlier in the week, stocks made a robust comeback on Friday. The S&P 500 shattered both its intraday and closing records established in January 2022.\n\nInvestors will closely monitor a series of economic reports scheduled for release this week, notably including gross domestic product data on Thursday and personal consumption expenditures prices on Friday. Both releases are expected to offer valuable insights into the perspective of central bank policymakers regarding future monetary policy.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: Cryptocurrency analyst Michael Van de Poppe said, \"The total market capitalization for crypto seems ready for another push towards $2.1 trillion, but that will be done through coins other than Bitcoin. Consolidative period, before the next impulse, is likely going to occur.\"\n\nPseudonymous cryptocurrency analyst Crypto Tony suggested the possibility of Bitcoin dropping below $40,000 before the upcoming block subsidy halving in April.\n\nSantiment, an on-chain analytical firm reported that Bitcoin has rapidly surged by 3.2% in the last 3 hours, reclaiming the $42,000 threshold just as the market appeared gloomy for traders. This surge comes as Bitcoin was approaching the $40,000 mark, with bullish signals emerging on the RSI and 30-day MVRV metrics.\n\nImage Via Shutterstock\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    }
]