[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGYtdG8tYnJpbmctbWF4LXBhaW4tZm9yLWJ0Yy1kb21pbmFuY2UtdHJhZGVyLXNheXPSAVBodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRmLXRvLWJyaW5nLW1heC1wYWluLWZvci1idGMtZG9taW5hbmNlLXRyYWRlci1zYXlzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF to Bring Max Pain for BTC Dominance, Trader Says - U.Today",
        "content": "Top analyst and crypto commentator who goes by @hedge__x on X (formerly Twitter) is sure that Ethereum (ETH) has all chances to outshine Bitcoin (BTC) in the coming bull run.\n\nAdvertisement\n\n\"Max pain for Bitcoin Dominance\": Trader skeptical about Bitcoin (BTC)\n\nBitcoin (BTC), the largest cryptocurrency, is going to set a new all-time high in this cycle. However, even over $100,000 per BTC, it will be disappointing for many Bitcoiners, @hedge__x shared on Jan. 19 on his X.\n\nCorn is going higher this cycle but many will be disappointed at $100k peak.\n\n\n\nETH has much more upside potential w many more future catalyst including ETF.\n\n\n\nMax pain for BTC.D. Max gain for Total2. — Hedgex.eth (@hedge__x) January 19, 2024\n\nBy contrast, Ethereum (ETH) has way more impressive upside potential compared to the orange coin. Among other catalysts, Ethereum (ETH) has possible ETF approval ahead. This might be an amazing catalyst for the next ETH rally.\n\nIt should be noted that Ethereum (ETH) is getting closer to EIP-4844 or Proto-Danksharding upgrade activation. It is set to change the game in L2s and make them more resource-efficient.\n\nAs such, the analyst is positive about the potential of Total2, an indicator of cumulative cryptocurrency markets capitalization excluding Bitcoin (BTC).\n\nThe Bitcoin Dominance (BTC.D) indicator is due to go through \"maximum pain,\" the trader concluded.\n\nLegal status of Ether is crucial for ETH ETF approval\n\nIn January 2024, Bitcoin Dominance (BTC.D) is losing momentum. After registering a local high over 55% on Jan. 9, it lost 7.5% (4.6 points) in less than 10 days.\n\nEthereum ETF is one of the most anticipated events for the cryptocurrency segment in 2024. The community and experts are moderately optimistic about its potential approval.\n\nHowever, the court processes between the U.S. SEC and crypto exchanges over illegal securities offering might affect the timeline of the ETH ETF approval.\n\nTogether with other large-cap altcoins, Ether is one of the tokens the SEC claimed to be unregistered securities."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmxpdmViaXRjb2lubmV3cy5jb20vZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24tMjAyNC1pcy02MDAwLXBvc3NpYmxlL9IBWmh0dHBzOi8vd3d3LmxpdmViaXRjb2lubmV3cy5jb20vZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24tMjAyNC1pcy02MDAwLXBvc3NpYmxlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction 2024, Is $6000 Possible? - Live Bitcoin News",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by market capitalization, has recently shown remarkable resilience and strength in the crypto market. As of now, Ethereum is trading at $2,563, reflecting a minor drop of -2.67% over the past 24 hours. This decline follows a period of impressive growth in which ETH surged by 23.22% in just three weeks. The recent bullish momentum has catapulted Ethereum back above the 50% level, signaling a potential continuation of the positive price action in the coming months. The ETH price prediction algorithm paints an even more optimistic picture, forecasting a staggering +253% price increase by the second quarter of 2024. If this prediction holds, Ethereum could be valued at an all-time high of $6,339.What’s driving this anticipated surge? The primary catalyst is the upcoming Bitcoin (BTC) halving event, a significant occurrence in the world of cryptocurrency.\n\nUnderstanding the Bitcoin Halving and Its Timing\n\nThe Bitcoin halving event takes place approximately every four years or after every 210,000 blocks mined. During this event, the rewards miners receive for verifying transactions and securing the network are halved. This reduction in mining rewards introduces deflationary pressure into the Bitcoin ecosystem, gradually decreasing the supply of new BTC entering circulation. Historically, Bitcoin’s deflationary mechanism has triggered new bull markets for cryptocurrencies. Each halving event has been followed by a surge in Bitcoin’s price, ultimately leading to new all-time highs. The last Bitcoin halving took place in 2020, and the next one is scheduled for April 15, 2024.\n\nEthereum’s Potential Post-Halving Growth\n\nEthereum has a history of significant price increases following Bitcoin’s halving events. After the previous BTC halving, Ethereum’s price skyrocketed by +2133%. This remarkable surge firmly established Ethereum as the second-most valuable cryptocurrency, propelling its native token, Ether (ETH), from $217 to an astonishing $4,864 within 18 months. One trader, known as Sporia on TradingView, has charted a long-term projection for ETH’s price. The chart highlights two parallel trading channels that Ethereum has followed since the 2018 alt season, featuring a strong support line that has withstood the bearish market conditions of 2022 and 2023. Sporia points out an essential indicator: the reversal indicator signal, which has only been triggered four times in Ethereum’s history, each time preceding a massive rally. According to Sporia’s analysis, Ethereum is likely to maintain this market structure over the next five years. The upper resistance line in the chart provides price targets for Ethereum during the next two bullish phases of Bitcoin’s four-year cycles, including a target of $16,090 in 2025. This represents an impressive +799% price increase from its current level. While Ethereum has experienced relative underperformance compared to other cryptocurrencies during recent bullish periods, with a +60% gain compared to the total crypto market cap’s +80% rise in the past year, this should not raise alarm. Ethereum underwent a significant upgrade during the bear market, transitioning from a proof-of-work to a more energy-efficient proof-of-stake consensus mechanism, known as The Merge. Moreover, Ethereum has benefited from increased regulatory clarity from the U.S. Securities and Exchange Commission (SEC) and the introduction of new exchange-traded funds (ETFs). Additionally, Ethereum’s layer-2 scaling solutions have made substantial progress, further boosting the demand for the native ETH token. In summary, Ethereum is poised for significant growth, with a price prediction algorithm suggesting a +253% increase in the next seven months. This projection aligns with the timing of the next Bitcoin halving event, which could catalyze Ethereum’s surge to new all-time highs. Amid the excitement surrounding Ethereum’s potential and the upcoming Bitcoin halving, another cryptocurrency is making waves in the crypto market—Retik Finance (RETIK). This groundbreaking token has attracted significant interest due to its impressive performance, having recently entered its presale stage 6. It has successfully raised over $10 million, achieving a remarkable 160% gain to date, with further potential for growth.\n\nRetik Finance (RETIK): A Token Poised for Gains\n\nRetik Finance stands as a gateway to decentralized finance (DeFi), offering a comprehensive ecosystem that goes beyond typical DeFi offerings. It boasts robust lending protocols, automated portfolio balancing powered by artificial intelligence, and user-friendly DeFi debit card and payment solutions. One standout feature of Retik Finance is its P2P lending platform, which employs AI to match borrowers and lenders. This platform offers fee-free, collateral-free crypto lending, underpinned by a smart credit scoring system that evaluates user behaviour and transaction history. This approach enhances inclusivity within the crypto space, making financial services more accessible to a broader audience.\n\nWith competitive rates, flexible terms, and incentives for timely repayments, Retik Finance is pioneering financial inclusion within the DeFi realm. Additionally, its secure and non-custodial framework ensures user privacy and control over their funds.Retik Finance’s presale stages have attracted significant interest, with the sixth presale stage offering tokens at an attractive price point of $0.08. As Retik Finance continues to gain traction and with its innovative technology, it is positioned to contribute to the growth of decentralized finance in 2024. Investors are increasingly drawn to this promising project, making it one to watch as it seeks to carve its niche in the ever-evolving crypto landscape.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWRlbmN1bi11cGdyYWRlLWNvdWxkLWdvLWxpdmUtb24tbWFpbm5ldC1hcy1lYXJseS1hcy1tYXJjaC0yMDI0LTIwMjQwMTIwMDYzONIBhwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1jb3VsZC1nby1saXZlLW9uLW1haW5uZXQtYXMtZWFybHktYXMtbWFyY2gtMjAyNC0yMDI0MDEyMDA2Mzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun upgrade could go live on mainnet as early as March 2024 - FXStreet",
        "content": "Share:\n\nEthereum developers discussed the Dencun upgrade’s activation on the Goerli testnet in their All Core Developers Execution Call.\n\nDevelopers confirmed the timeline for the Dencun upgrade’s rollout on Sepolia and Holesky testnets.\n\nEthereum Dencun upgrade is likely to see its mainnet release in March, despite a lack of Layer 2 readiness.\n\nEthereum core developers are committed to the Dencun upgrade’s testnet timelines. Despite the issues that arose on the Goerli testnet, the timeline has remained unchanged for Sepolia and Holesky testnet release of the upgrade.\n\nCore developers picked 30 January for Sepolia and 7 February for Holesky rollout of the Dencun upgrade.\n\nAlso read: Lido DAO Community Staking Module to make mainnet debut in the second half of 2024\n\nEthereum developers set fixed timelines for Dencun upgrade\n\nEthereum developers stayed committed to the Dencun testnet timeline, according to the All Core Developers Execution call number 179. The timeline for testing remains unchanged and Galaxy Digital’s Christine Kim believes the likelihood of mainnet activation for the upgrade by the end of March is now 60%.\n\nLayer 2 chains are not currently ready for the upgrade, however, developers are moving ahead with the testnet releases in the next three weeks. It is likely that Dencun goes live on mainnet as early as February if the upgrades on Sepolia and Holesky do not encounter issues.\n\nDevelopers are likely to run additional tests and Layer 2 chains may want to perform client releases on Sepolia and Holesky before the mainnet upgrade. If this occurs, then the likelihood of mainnet release in February is limited to 30%.\n\nThe implementation of EIP-4844 is expected to boost the features of Ethereum and drive adoption of the chain.\n\nExpected Impacts of EIP 4844. Source: Galaxy Research\n\nIf major bugs are discovered in either of the two testnets, Dencun’s arrival on the mainnet could be delayed from March to April.\n\nKey dates to watch out for are January 30 and February 7, dates for the Sepolia and Holesky forks."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL3NlYy1kZWxheXMtZmlkZWxpdHlzLWV0aGVyZXVtLWV0Zi1kZWNpc2lvbi_SAURodHRwczovL2Zvcmthc3QubmV3cy9zZWMtZGVsYXlzLWZpZGVsaXR5cy1ldGhlcmV1bS1ldGYtZGVjaXNpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity's Ethereum ETF decision - Forkast News",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NvbXBhbnkvZXRoZXJldW0tZXRoLW5leHQtaW4tbGluZS1hZnRlci1iaXRjb2luLWJ0Yy1ldGYtaW52ZXN0b3JzLWxvb2stZm9yLWVyYzIwLWdlbXMtbGlrZS1wdWxsaXgtcGx4L9IBhwFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NvbXBhbnkvZXRoZXJldW0tZXRoLW5leHQtaW4tbGluZS1hZnRlci1iaXRjb2luLWJ0Yy1ldGYtaW52ZXN0b3JzLWxvb2stZm9yLWVyYzIwLWdlbXMtbGlrZS1wdWxsaXgtcGx4L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Next In Line After Bitcoin (BTC) ETF, Investors Look For ERC20 Gems Like Pullix (PLX) - NewsBTC",
        "content": "The cryptocurrency market is currently awaiting the introduction of an Ethereum ETF after the approval of a Bitcoin ETF. Meanwhile, because of Pullix’s security, investors are becoming more interested in ERC20 tokens.\n\nWhat Has Happened To Bitcoin (BTC) Since Its ETF Approval?\n\nThe United States Securities Exchange Commission (SEC) recently approved 11 spot Bitcoin ETFs—the news of the approval spiraled across the crypto community.\n\nBefore the approval, analysts predicted a surge in Bitcoin price due to increased inflows from institutional investors. Standard Chartered analysts predicted fund inflows ranging from $50 billion to $100 billion in 2024.\n\nHowever, Bitcoin has yet to rally a few days after the Bitcoin ETF approval. According to CoinMarketCap, Bitcoin price has fluctuated between $41,753.68 and $48,494.62 in the past week.\n\nAt the moment, Bitcoin is facing huge selling pressure around the $48k level. Still, analysts remain bullish on the flagship cryptocurrency. All eyes are now on the Bitcoin halving to spark a bullish run. Analysts predict a surge to $50k and $100k in the long run.\n\nEthereum (ETH) ETF Approval Coming?\n\nSince the US SEC approved spot Bitcoin ETF, the crypto community has been betting on spot Ethereum ETFs. While some analysts believe spot Ethereum ETFs could be next in line, others have a different opinion. An example of such an analyst is JPMorgan’s Nikolaos Panigirtzoglou.\n\nAccording to the analyst, the regulator must classify Ethereum as a commodity before approving spot Ethereum ETFs. On the other hand, Bloomberg ETF expert Eric Balchunas forecasts a 70% possibility that an Ethereum ETF will be approved by May.\n\nSeveral big firms, including Fidelity and BlackRock, have filed for spot Ethereum ETFs. An approval of Ethereum ETF could push the price of Ethereum as high as $4500, per analysts.\n\nPullix (PLX) Native Token Catches Investors’ Interest\n\nPullix (PLX) ERC20 token, PLX, has been the main talk of investors since the beginning of its presale. The token is built on the Ethereum blockchain, meaning more security. Also, its price has increased 100% to $0.08 in less than a month. All these have gained attention among investors.\n\nThe upcoming launch of the Pullix exchange also adds to the increased interest from investors. This DeFi project is prepared to launch in Q1 2024 following its presale. It is a hybrid exchange platform, combining the strengths of both centralized and decentralized exchanges.\n\nUsers of the Pullix platform are able to trade in a range of markets such as stocks, commodities, forex indices and options. Daily turnover in the forex market is more than $6.6 trillion. Given the profit-making nature of PLX, analysts are positive about its growth in 2024. Pullix allows users to generate passive revenue by staking the PLX altcoin.\n\nStaking basically implies locking tokens in a smart contract to strengthen the platform’s liquidity. Based on the quantity and duration of staking, a reward is issued. As the period of investment increases, the profits increase, too. Pullix further presents the Market-Making Liquidity Contribution, which means that any user can act as a market maker and contribute liquidity to this platform.\n\nThe annual return paid to market makers on Pullix is between 8% and 18%. This strategy is likely to increase the number of users using Pullix, which will encourage its use. With its price now standing at $0.08 per token, Pullix is already regarded as one of the best DeFi projects to invest in 2024.\n\nFinal Thoughts\n\nWhile Bitcoin ETF approval has not given the expected price movement, investors are hoping Ethereum will perform differently. Meanwhile, analysts are predicting a 100x rise in Pullix’s altcoin value.\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zZWMtbWFrZXMtc3BvdC1ldGhlcmV1bS1ldGYtZGVjaXNpb24tYXMtZXRoLW91dGZsb3dzLWhhdmUtdGhlaXItc2F5L9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zZWMtbWFrZXMtc3BvdC1ldGhlcmV1bS1ldGYtZGVjaXNpb24tYXMtZXRoLW91dGZsb3dzLWhhdmUtdGhlaXItc2F5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "SEC makes spot Ethereum ETF decision as ETH outflows have their say - AMBCrypto News",
        "content": "SEC extends spot ETH ETF decision by 45 days\n\nMore ETH flows out of exchanges as the wait begins\n\nThe U.S. Securities and Exchange Commission has taken its first concrete step of the year on the route to either approving or rejecting an Ethereum spot ETF. This action was conveyed through a response sent by the SEC to Fidelity.\n\nSEC responds to Fidelity’s spot Ethereum ETF application\n\nAs per a letter dated 18 January, the U.S. Securities and Exchange Commission (SEC) has decided to extend its decision-making process regarding the Fidelity spot Ethereum ETF application. The application, submitted on 17 November 2023 and opened for comments on 6 December, will now undergo an extended resolution period. This follows the SEC’s choice to extend the decision timeline by 45 days.\n\nConsequently, the resolution is anticipated to be around 5 March 2024. Also, Bloomberg analyst James Seyffart suggests that approval may be possible in May. Notably, BlackRock’s CEO Larry Fink is pretty confident of the value attached to a spot Ethereum ETF. He claimed so in an interview shortly after the approval of the spot Bitcoin ETF.\n\nEthereum remains in a downtrend\n\nUpon the approval of the spot Bitcoin ETF, there was no notable surge in price, with analysts attributing this to it being priced in before the announcement. Interestingly, for Ethereum, the news of the proposal submission and the subsequent decision announcement may significantly impact the price more than the actual approval.\n\nAt the time of writing, ETH was trading at around $2,400, experiencing a slight loss of less than 1% in 24 hours. Although it seems to be on a downtrend, ETH’s present value is higher than what its value was a year ago.\n\nAn analysis of the daily timeframe chart revealed that ETH did not reach the present price level over the previous year. Additionally, the ongoing bull trend continued while showing signs of weakening. Notably, the Relative Strength Index (RSI) remained above the neutral line, indicating a bullish trend at press time.\n\nObserving the exchange flow\n\nAMBCrypto’s examination of Ethereum’s exchange flow showed that the balance between inflow and outflow shifted around 14 January. Since then, there has been a consistent trend of more outflow than inflow. This suggested that a more significant amount of ETH is leaving exchanges, compared to the incoming volume.\n\nAlso, the trend implied that fewer Ethereum assets are being offered for sale recently.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nAs of 18 January, the data highlighted that over 90,000 ETH have moved out of exchanges, further supporting the notion that market participants are withdrawing their assets from exchange platforms."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1yYXBpZGx5LWJyZWFrcy1kb3duLWV0aGVyZXVtLWV0aC1sb3Nlcy10cmFjdGlvbi13aGlsZS1zb2xhbmEtc29sLXByZXNlbnRzLWhpZGRlbtIBc2h0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1yYXBpZGx5LWJyZWFrcy1kb3duLWV0aGVyZXVtLWV0aC1sb3Nlcy10cmFjdGlvbi13aGlsZS1zb2xhbmEtc29sLXByZXNlbnRzLWhpZGRlbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nShiba Inu has experienced a significant breakdown from its recent consolidation phase. The chart depicts a clear downward trajectory as SHIB failed to maintain its position within the ascending triangle pattern it had formed over the past few months.\n\nThe breakdown was signaled as SHIB prices breached the key support level at $0.000009, which had previously acted as a reliable floor for the price during consolidation phases. Following this, SHIB prices tumbled further, slicing through subsequent support near $0.0000087. This price action marked a decisive shift in market sentiment from accumulation to distribution.\n\nThe next support level to watch is at $0.0000082, where SHIB may find a temporary reprieve from the selling pressure. If this level fails to hold, the next critical support lies at $0.0000076, which could serve as the last line of defense before a more significant drop.\n\nFor a reversal to occur and for SHIB to regain its upward momentum, it would need to reclaim previous support levels and transform them back into supports. This would require a substantial influx of buying pressure, potentially sparked by positive developments within the Shiba Inu ecosystem or broader cryptocurrency market rallies.\n\nThe first sign of a possible reversal would be a return above $0.0000087, followed by a sustained move above the $0.000009 price level. A breakout above these levels, accompanied by increasing volume, could indicate that the downtrend is losing steam and that bulls are regaining control.\n\nSolana paints reversal pattern\n\nSolana has been developing a subtle yet potentially pivotal chart pattern. The asset has been tracing a slow and steady ascending channel, a formation that suggests a controlled and consistent uptrend. This pattern, characterized by higher lows and higher highs contained within two parallel trendlines, speaks to potential for continued growth.\n\nThe significance of this pattern lies in the momentum it could provide for SOL. Should the price action remain strong within the upper half of the channel, and particularly if it challenges the upper trendline, we could see Solana break through and embark on a more aggressive rally.\n\nSuch a bullish scenario would likely be supported by increased trading volume and positive developments within the Solana ecosystem, such as new project launches or updates that enhance network performance.\n\nThe immediate local resistance stands at around $55, and a confident push beyond this could confirm bullish sentiment. Inversely, if Solana's price dips below the channel's lower boundary, around $48, it could indicate that a bearish narrative is taking hold.\n\nEthereum momentum decreasing\n\nEthereum is exhibiting signs of waning momentum, as observed in recent price movements. The asset, which has long been considered the backbone of the decentralized finance sector, is facing a pivotal moment that could determine its trajectory for the coming weeks.\n\nThe provided chart illustrates Ethereum's struggle to maintain its grasp on the market. The price has been on a downward trend, edging closer to the local 26-day Exponential Moving Average. This level, currently near $2,465, is critical; if Ethereum fails to hold this line, we might see it descend to test the more significant 50 EMA, which stands around the $2,300 mark.\n\nThe 26 EMA serves as a short-term sentiment gauge, and its breach could signal a lack of immediate bullish support. Should this level fail to act as a springboard for price recovery, Ethereum's next stop could indeed be the 50 EMA. A breach below this longer-term moving average could potentially open the gates for a test of lower support levels, highlighting the need for investors to brace for more volatility.\n\nMarket participants are now recalibrating their expectations, understanding that the road to sustainable gains is a long-term journey."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jbGFzc2ljLXB1bGxzLWJhY2stYWZ0ZXItcmFsbHktZnVlbGVkLWJ5LWV0Zi1hcHByb3ZhbC_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tY2xhc3NpYy1wdWxscy1iYWNrLWFmdGVyLXJhbGx5LWZ1ZWxlZC1ieS1ldGYtYXBwcm92YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic pulls back after rally fueled by ETF approval - AMBCrypto News",
        "content": "ETC’s price has dropped by double digits in the last week.\n\nDespite the price dip, bullish momentum remains.\n\nFollowing a post-ETF-approval rally, Ethereum Classic [ETC] has begun to shed its gains. AMBCrypto reported earlier that Ethereum-linked tokens ETC and Ethereum Name Service [ENS] climbed to 12-month highs after the long-awaited ETF decision on 10th January.\n\nAs of this writing, ETC exchanged hands at $23.90, dropping by 19% in the last week, data from CoinMarketCap showed.\n\nBullish momentum remains\n\nETC’s price surge post-ETF approval was backed by no real uptick in demand for ETC. Now that the excitement surrounding the ETF has waned, the coin has witnessed a drop in value.\n\nHowever, despite the recent price pullback, an assessment of ETC’s price movements on a daily chart revealed that bullish momentum persisted. At press time, the coin’s momentum indicator rested above their respective center lines, suggesting that buying pressure exceeded coin sell-offs.\n\nFurther, the coin’s Chaikin Money Flow (CMF) returned a value above the zero line. When an asset’s CMF value rests above zero, it signals the presence of more buying pressure.\n\nAt 0.06 and in an uptrend when writing, ETC’s CMF showed rising liquidity being supplied to the coin’s spot market. This is known to drive up an asset’s value.\n\nConfirming the bullish trend, readings from ETC’s Directional Movement Index (DMI) showed its positive directional index (green) resting above the negative directional index (red).\n\nWhen these trend lines are positioned in this manner, it suggests that the strength of the bulls exceeds that of the bears.\n\nHowever, the price decline experienced in the last week has resulted in a fall in ETC’s futures open interest. According to data from Coinglass, since 12th January, ETC’s open interest has plunged by 22%.\n\nAs of this writing, the coin’s futures open interest was $162.34\n\nVolatility lingers in the market\n\nThe hike in ETC price post-ETF approval led to a surge in market volatility.\n\nWith the gap between the upper and lower bands of the coin’s Bollinger Bands (BB) indicator still widening at press time, ETC remained prone to price swings."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ0Yy1zcGlrZXMtdXAtYW5kLWV0aC1oaXRzLTI1MDAtdGltZS10by1idXkuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as BTC Spikes Up and ETH Hits $2,500 – Time to Buy - Cryptonews",
        "content": "As the weekend unfolds, Bitcoin (BTC) has seen a notable uptick, trading at $41,700 with nearly 1.40% increase on Saturday. Despite this positive momentum, skepticism remains as The New York Times maintains a cautious stance on Bitcoin’s prospects. Adding to the wary outlook, the RBI Governor has flagged cryptocurrencies as a risk to the stability of the Indian Rupee, urging investors to proceed with caution.\n\nMeanwhile, the Commodity Futures Trading Commission (CFTC) has reported a loss of $2.3 million by the cryptocurrency exchange Debiex due to alleged romance scams, highlighting the vulnerabilities within the crypto space. Furthermore, the strength of the US Dollar Index (DXY) is seen as a potential threat to Bitcoin’s recovery, compounded by the selling pressure from Grayscale Bitcoin Trust (GBTC).\n\nWith such diverse factors at play, investors are pondering whether it’s the opportune moment to buy into Bitcoin and Ethereum as the latter taps the $2,500 mark.\n\nRBI Governor Cautions: Cryptocurrency Threatens Rupee Stability\n\n\n\nGovernor of the Reserve Bank of India (RBI), Shaktikanta Das, has spoken about the serious risks that come with cryptocurrencies, particularly for developing nations. Das underlined the possible effects on the monetary system, currency stability, and financial stability. He voiced worries about cryptocurrencies’ lack of underlying assets and their ability to replace money in payment systems and banking.\n\nDas highlights the speculative nature of cryptocurrencies and sees considerable risks, even in spite of the U.S. Securities and Exchange Commission having approved spot Bitcoin exchange-traded funds (ETFs). The governor’s cautious approach increases the regulatory obstacles that cryptocurrencies must overcome and may lead to more volatility in the market.\n\nCFTC Reports: Debiex Exchange Hit by $2.3M Romance Scams\n\n\n\nThe Commodity Futures Trading Commission (CFTC) has labeled cryptocurrency exchange Debiex as a “fraudulent digital asset platform,” accusing its senior staff of orchestrating romantic deceptions to defraud money.\n\nCFTC Charges Bogus Digital Asset Platform with Fraud and Misappropriation in an Online Romance Scam: https://t.co/RpskNapy7i — CFTC (@CFTC) January 19, 2024\n\nThe CFTC’s report alleges that Debiex representatives engaged in forming intimate relationships with potential clients, gaining their trust, and subsequently persuading them to open and fund trading accounts. This scheme reportedly siphoned over $2 million, with five victims currently identified over two years.\n\nThese romance scam allegations add to a series of challenges within the cryptocurrency industry, potentially impacting investor sentiment and activity by undermining the trust and credibility of crypto exchanges.\n\nUS Dollar Rally and GBTC Sell-Off Endanger Bitcoin’s Recovery\n\n\n\nThe U.S. Dollar Index’s (DXY) rally, up 2.71% from its December 27 low, poses a challenge to Bitcoin’s price recovery. Bolstered by robust retail sales and positive economic data, the DXY has seen significant gains. Concurrently, Grayscale’s Bitcoin Trust (GBTC) has experienced substantial outflows, with around 38,000 BTC withdrawn since January 11, when spot Bitcoin ETFs were introduced.\n\nEconomist Peter Schiff attributes these GBTC outflows as a key factor preventing Bitcoin’s price rise. Technical analysis suggests Bitcoin could potentially fall back to around $34,000, having been repelled at the $48,000 level, which aligns with the upper limit of an ascending parallel channel."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8yMTM0OTQvdGhpcy13ZWVrLWluLWNvaW5zLWRlc3BpdGUtZXRmLWh5cGUtYml0Y29pbi1hbmQtZXRoZXJldW0tcGx1bmdlLWhhcmTSAWRodHRwczovL2RlY3J5cHQuY28vMjEzNDk0L3RoaXMtd2Vlay1pbi1jb2lucy1kZXNwaXRlLWV0Zi1oeXBlLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXBsdW5nZS1oYXJkP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Despite ETF Hype, Bitcoin and Ethereum Plunge Hard - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nLittle over a week since the launch of spot Bitcoin exchange-traded funds (ETF), and the crypto markets are suffering.\n\nOver the past week, Bitcoin (BTC) has shed more than 10% of its value, according to CoinGecko. The biggest digital coin by market cap is now priced at $41,002.\n\nAD\n\nAD\n\nLast week, it was closing in on $49,000.\n\nThe long-awaited Bitcoin ETFs have been a roaring success—with BlackRock's iShares ETF collecting over $1 billion in assets under management.\n\nSo, why the dip in price? It probably has something to do with investors cashing out their gains from the initial ETF hype.\n\nSome analysts said that ETF approval had already been \"priced in.\" This likely means that traders and investors were unlikely to continue buying after the approval was made official.\n\nThe rest of the crypto market has been hit hard over the past week, too. Solana (SOL) has shed over 7% of its value in the past week and is priced at $92.38.\n\nWhile Avalanche (AVAX) is down by more than 14%, trading hands for $32.82. Both assets had done very well in December as they attracted institutional investor interest.\n\nAD\n\nAD\n\nMeanwhile, Ethereum (ETH), the second-biggest digital coin, has lost 8% of its value in the past week. It's now priced at $2,466.\n\nFollowing the U.S. Securities and Exchange Commission's approval of 10 spot BTC ETFs, the crypto sphere is now awaiting spot ETH ETFs to drop.\n\nWall Street's top regulator on Thursday pushed back its deadline for a decision on Fidelity's proposed spot Ethereum ETF to March 5, leading to a price dip in the asset.\n\nThe entire crypto market now stands at $1.7 trillion, having dropped by 2.8% in the last 24 hours."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMC9jcnlwdG8tc3RyYXRlZ2lzdC1taWNoYWVsLXZhbi1kZS1wb3BwZS1zYXlzLXRoaXMtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1jb3VsZC1zdXJnZS1vdmVyLTE2MC1hZ2FpbnN0LWJpdGNvaW4v0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzIwL2NyeXB0by1zdHJhdGVnaXN0LW1pY2hhZWwtdmFuLWRlLXBvcHBlLXNheXMtdGhpcy1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWNvdWxkLXN1cmdlLW92ZXItMTYwLWFnYWluc3QtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Crypto Strategist Michaël van de Poppe Says This Ethereum-Based Altcoin Could Surge Over 160% Against Bitcoin - The Daily Hodl",
        "content": "Cryptocurrency analyst and trader Michaël van de Poppe says that one top-15 digital asset could soon soar against Bitcoin (BTC).\n\nVan de Poppe tells his 685,300 followers on the social media platform X that decentralized oracle provider Chainlink (LINK) could rally more than 167% against Bitcoin (LINK/BTC).\n\n“Chainlink has held a crucial level of support on the BTC pair and is likely going to continue from here. Crucial breakout above 0.00045 BTC, if that breaks, a run to 0.0008-0.001 BTC seems next.”\n\nLooking at his chart, the trader suggests that LINK/BTC is on the verge of a trend reversal and about to break through a key resistance level at 0.0004480 BTC ($18.63).\n\nLINK/BTC is trading for 0.0003741 BTC ($15.59) at time of writing.\n\nThe trader also weighs in on Bitcoin as the crypto king dipped to the low $40,000s this week. He believes Bitcoin is in the early stages of a bull market cycle and wouldn’t be surprised to see a correction to the $36,000 level.\n\n“Bitcoin isn’t into a bear market; it’s at the start of a new bull cycle. However, as it’s at the start of a new bull cycle, discussions will be heavy between the two groups…\n\nPerhaps we’re there already for Bitcoin, but it seems likely that we’ll test lower before we can have a reversal back up. My personal interest is between $36,000-$40,000 to be accumulating more into Bitcoin. The range remains defined.”\n\nBitcoin is trading for $41,636, up slightly in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbmlkb2wuY29tL2V0aGVyZXVtLWhlYWRpbmctZm9yLWhpZ2hlc3QtcHJpY2Uv0gE8aHR0cHM6Ly9jb2luaWRvbC5jb20vZXRoZXJldW0taGVhZGluZy1mb3ItaGlnaGVzdC1wcmljZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Hovers Above $2,400 And Is Heading For Its Highest Price - CoinIdol",
        "content": "Jan 20, 2024 at 11:41 // Price\n\nCoin Idol Author\n\nThe price of Ethereum (ETH) is trading above the moving average lines. The largest altcoin is trading below the resistance level of $2,600 in anticipation of a further rise.\n\n\n\nLong-term analysis of the Ethereum price: bullish\n\nEthereum has been in a sideways movement between $2,400 and $2,600 over the past week. Today, the altcoin has fallen and found support above the $2,400 support level. Ether is moving towards the recent highs of $2,600 and $2,700.\n\nIf buyers overcome the resistance at $2,700, Ether could rise to the high of $3,000. It is currently trading above the $2,400 support level, also known as the 21-day SMA. The largest altcoin is at risk of a decline once the current support levels are breached. The altcoin is set to drop to a low of $2,200. Meanwhile, the ETH/USD exchange rate stands at $2,500.80.\n\nAnalysis of the Ethereum indicators\n\nEther's price bars are moving above the moving average lines, indicating that the price will continue to rise. The price bars on the 4-hour chart are below the moving average lines, which is due to the recent downtrend. The moving average lines are sloping north, indicating an upward trend.\n\nTechnical indicators:\n\nKey resistance levels – $2,200 and $2,400\n\nKey support levels – $1,800 and $1,600\n\n\n\n\n\nWhat is the next direction for Ethereum?\n\nEther's price bars are moving above the moving average lines, suggesting that the price will continue to rise. The price bars on the 4-hour chart are below the moving average lines, which is due to the recent decline. The moving average lines are sloping north, indicating a rise.\n\n\n\n\n\nDisclaimer. This analysis and forecast are the personal opinions of the author and are not a recommendation to buy or sell cryptocurrency and should not be viewed as an endorsement by CoinIdol.com. Readers should do the research before investing in funds."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1kZWNvdXBsZXMtZnJvbS1idGMtaGVyZXMtd2hhdC1pdC1tZWFucy1mb3ItZXRocy1mdXR1cmUv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWRlY291cGxlcy1mcm9tLWJ0Yy1oZXJlcy13aGF0LWl0LW1lYW5zLWZvci1ldGhzLWZ1dHVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum decouples from BTC – Here’s what it means for ETH’s future - AMBCrypto News",
        "content": "Ethereum’s correlation to Bitcoin declined as prices fell.\n\nNew developments on the Ethereum network may help ETH in the future.\n\nBitcoin [BTC] was in the limelight for quite some time due to anticipation around the ETF. Due to this, Ethereum [ETH] got left behind and the correlation between the two coins witnessed a decline.\n\nParting ways\n\nAccording to Kaiko’s data, the BTC to ETH correlation has fallen below its historical average of 0.71 for the first time since 2021. In recent months, the two cryptocurrencies have demonstrated divergent price movements, with BTC benefiting from ETF-related hype and speculation, while ETH underwent a comparatively subdued rally.\n\nFor the first time since 2021, the BTC:ETH correlation dropped below its all time average of 0.71. What does this mean for a possible spot #ETH ETF approval? pic.twitter.com/qJSqVVDkbJ — Kaiko (@KaikoData) January 18, 2024\n\nAnalyzing BTC’s performance leading up to its ETF approval offers insights into ETH’s potential trajectory. Over the past 365 days, BTC has witnessed a robust 100% increase in returns, outpacing ETH’s more modest 60% returns.\n\nHowever, a shift occurred on the day of BTC’s approval, with BTC experiencing a decline and ETH rallying, fueled by the growing anticipation that ETH could be the next in line for such approval.\n\nIn the past week, ETH spot volume on Centralized Exchanges (CEXs) surged to its highest level since the FTX collapse.\n\nNotably, there was a substantial disparity in volume between ETH and altcoins, favoring ETH and representing the most significant gap since March 2023.\n\nThis surge in volume suggests heightened market activity and interest in ETH, potentially indicative of a changing dynamic within the cryptocurrency landscape.\n\nDevelopments on Ethereum\n\nHowever, some factors may help generate interest in ETH in the next few months.\n\nApart from the potential approval of the Ethereum ETF, the new developments on the Ethereum network may also provide some hope to ETH holders.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nRecently, the Dencun upgrade was deployed on the Goerli testnet, further cementing the fact that the development teams progress in terms of development.\n\nMoreover, in the recent ACD call, discussions around deploying the Dencun upgrade on other testnets also ensued."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2hpYmEtaW51LWV0aGVyZXVtLXdoYWxlLW1ha2VzLW1hc3NpdmUtc2hpYi1wdXJjaGFzZS1hZnRlci1yb2Jpbmhvb2TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu: Ethereum Whale Makes Massive Shib Purchase After Robinhood - Watcher Guru",
        "content": "Within the constantly evolving cryptocurrency sphere, an Ethereum whale identified by the wallet address “0xfb2” has reemerged after a prolonged period of dormancy to undertake a substantial investment in the Shiba Inu (SHIB) cryptocurrency. According to data from Etherscan, the enigmatic investor conducted a series of purchases. The whale acquired an astounding 606.36 billion SHIB in the past 24 hours. This translates to a noteworthy investment of $5.80 million.\n\nShiba Inu Portfolio Soars\n\nThis abrupt surge in buying activity has elevated the Ethereum whale to the pinnacle of the SHIB token buyers’ list for the specified period. Presently, the investor’s cryptocurrency portfolio showcases an impressive 733.21 billion SHIB. This is valued at $6.97 million, with SHIB now standing as the second-largest holding in the portfolio, surpassed only by Ethereum.\n\nThe Ethereum whale’s dedication to SHIB traces back to two years ago when it initially procured nearly 200 billion tokens. This recent resurgence in SHIB holdings introduces a captivating aspect to the dynamic crypto market. It seizes the attention of both SHIB enthusiasts and traders.\n\nAlso Read: Shiba Inu [SHIB] Forecasted To Rise 400%: Here’s When\n\nRobinhood’s Growing SHIB Stash\n\nConcurrently, information from Arkham Intelligence indicates a parallel development, revealing that Robinhood, the prominent stock brokerage giant, has expanded its SHIB holdings. Recent data illustrates a substantial growth in Robinhood’s SHIB reserves, escalating from approximately 35 million SHIB to an impressive 36.454 trillion SHIB within the last 24 hours.\n\nMy #Robinhood Tweet yesterday shows 36.454 Trillion #SHIB by Robinhood from data provided by Arkham\n\n\n\nand now in less than 24 hours , they have 36.684 Trillion $SHIB . 231 Billion Shiba INU added on that exchange\n\n\n\nThey are accumulating while #TRADEFI accumulating #Bitcoin… — Lola (@CryptoLollla) January 17, 2024\n\nWith major players such as the mysterious Ethereum whale and Robinhood displaying renewed interest in Shiba Inu, the cryptocurrency community is eagerly awaiting the repercussions of these developments on the Shiba Inu token in the upcoming days. The heightened attention and investments from influential entities underscore the dynamic and ever-changing nature of the cryptocurrency market.\n\nAlso Read: Robinhood Buys 230 Billion Shiba Inu in Less Than 24 Hours"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2V0aGVyZXVtLW5mdC1zYWxlcy1oZWF0LXVwLXdpdGgtYm9vc3QtZnJvbS1jcnlwdG9wdW5rcy1iYXljL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2V0aGVyZXVtLW5mdC1zYWxlcy1oZWF0LXVwLXdpdGgtYm9vc3QtZnJvbS1jcnlwdG9wdW5rcy1iYXljL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum NFT sales heat up with boost from CryptoPunks, BAYC - AMBCrypto Blog",
        "content": "Ethereum network recorded sales worth $19.8 million in the last 24 hours.\n\nCryptoPunks, BAYC, and Pudgy Penguins lifted Ethereum to the top in recent days.\n\nAfter a brief scare, Ethereum [ETH] has reclaimed its position as the top blockchain for non-fungible token (NFT) trading activity.\n\nAccording to AMBCrypto’s analysis of CryptoSlam’s data, the Ethereum network recorded sales worth $19.8 million in the last 24 hours, more than twice that of second-ranked Solana [SOL].\n\nMoreover, Ethereum was the top blockchain over the last week as well, with more than a $100 million in sales of NFTs.\n\nEthereum reclaims numero uno rank\n\nAMBCrypto noticed that the gap between Ethereum and Bitcoin [BTC] started to widen again following the latter’s stupendous performance late last year.\n\nDriven by surge in demand for Ordinals, Bitcoin-based NFTs topped the charts in December, pushing traditional powerhouse Ethereum to the second rank on the list.\n\nHowever, the new year turned out to be game changer for Ethereum, with marquee collections like CryptoPunks and Bored Ape Yacht Club (BAYC) rising to the occasion.\n\nBlue-chip collections exert dominance\n\nAs per CryptoSlam, CryptoPunks was the top-selling NFT collection in the last 24 hours, recording over $4.7 million in sales.\n\nIn fact, the largest collection by market cap saw its floor price hitting a nine-month high of 59.95 ETH as of this writing, AMBCrypto spotted using NFT Price Floor data.\n\nIn the world of NFTs, floor price is considered as an important barometer of a collection’s popularity. Therefore, high floor price might signal that interest in that project is increasing.\n\nThe other prominent Yuga Labs-owned entity BAYC stood at the sixth position, with $1.19 million in trading volume.\n\nBAYC also registered a 24-hour change of 1.84% in its floor price, seen at 24.849 ETH as of this writing.\n\nRead ETH’s Price Prediction 2024-25\n\nDon’t ignore Pudgy Penguins\n\nHowever, if one were to analyze the past week’s statistics, Pudgy Penguins NFT collection seemed to have done the heavy-lifting.\n\nThe collection of unique 8,888 cartoon NFTs featuring adorable penguins recorded $9.1 million in cumulative sales in the last seven days, marking a 6x jump."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2ZpbmJvbGQuY29tL2NoYXQtZ3B0LW1ha2VzLWJvbGQtcHJpY2UtcHJlZGljdGlvbi1mb3Itc29sYW5hLXNvbC1hbmQtZXRoZXJldW0tZXRoLWluLTIwMjQtYXJndWVzLXJldGlrLWZpbmFuY2UtcmV0aWstd2lsbC1kby1iZXR0ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Chat GPT makes bold price prediction for Solana (SOL) and Ethereum (ETH) in 2024, argues Retik Finance (RETIK ... - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nThe year 2024 is shaping up to be a landmark year in the world of cryptocurrencies, with Chat GPT making bold predictions for prominent players like Solana (SOL) and Ethereum (ETH).However, the spotlight is increasingly shifting towards a rising star in the decentralized finance (DeFi) realm – Retik Finance (RETIK), which is showing potential to outperform its more established counterparts.\n\nSolana (SOL) and Ethereum (ETH): Predictions and Prospects\n\nSolana’s 2024 Trajectory\n\nSolana, known for its high-speed transactions and low fees, is poised for a significant recovery in 2024. Chat GPT predicts a resurgence in SOL’s value, considering its technical robustness and growing adoption.Solana’s ability to handle up to 65,000 transactions per second positions it as a preferred choice for DeFi and NFT projects. This advantage could drive SOL’s price upwards, potentially reaching the $200 mark, a significant increase from its current standing.\n\nEthereum’s Progressive Outlook\n\nEthereum, the leading smart contract platform, is expected to continue its dominance, especially with its upcoming Ethereum Cancun upgrade. This upgrade, anticipated to increase scalability and efficiency significantly, is likely to draw more users and developers to the platform, bolstering ETH’s price. Chat GPT foresees Ethereum potentially breaking past its previous all-time high, with a price target hovering around $5,000 by the end of 2024.While Solana and Ethereum have their strengths, Retik Finance is emerging as a formidable contender in the DeFi space. Priced attractively at $0.08, Retik Finance is not just another token in the crypto market; it’s a revolution in the DeFi ecosystem.\n\nRetik Finance (RETIK): A New Era in DeFi\n\nDespite the promising outlook for SOL and ETH, Retik Finance is emerging as a potential market leader, offering groundbreaking innovations in DeFi. Recently audited by Certik and listed on CoinMarketCap and CoinGecko, Retik Finance is gaining credibility and visibility in the crypto space.\n\nWhy Retik Finance Stands Out\n\nRetik Finance is revolutionising DeFi with its comprehensive suite of products, including DeFi debit cards, a next-gen payment gateway, AI-powered P2P lending, and a highly secure multi-chain DeFi wallet. These offerings are not just technological advancements but also practical solutions that address real-world financial challenges, bridging the gap between cryptocurrencies and everyday transactions.\n\nCertik Audit – A Testament to Security and Reliability\n\nThe Certik audit of Retik Finance underscores the platform’s commitment to security and reliability. This audit provides an additional layer of trust and confidence for investors, ensuring that Retik Finance’s smart contracts are robust and secure against potential vulnerabilities.\n\n2024: The Year of Retik Finance\n\nChat GPT’s analysis suggests that 2024 could very well be the year of Retik Finance. With its innovative features and growing ecosystem, RETIK is projected to experience substantial growth, potentially outperforming both Solana and Ethereum.\n\nRobust Features and Market Appeal: Retik Finance’s array of features, particularly its DeFi debit cards, are set to transform how people interact with cryptocurrencies. These cards will facilitate the widespread adoption of crypto in everyday transactions, a significant leap towards mainstream acceptance.\n\nAI-Powered Lending – A Game-Changer: The platform’s introduction of AI-powered P2P lending is a significant innovation in the DeFi space. This feature is expected to attract a broad user base, offering a more accessible and efficient lending and borrowing mechanism.\n\nMarket Confidence and Adoption: Retik Finance’s presence on prominent platforms like CoinMarketCap and CoinGecko, coupled with its Certik audit, is building market confidence. These factors contribute to a growing investor base eagerly anticipating the platform’s full launch.\n\nBold Price Predictions for Retik Finance\n\nLooking at Retik Finance’s trajectory and market potential, Chat GPT predicts a remarkable performance in 2024. The platform is expected to provide substantial returns for early investors, with a price prediction indicating a surge of over 900% from its current value. This growth is not just based on market speculation but also on the tangible utility and innovation Retik Finance brings to the DeFi landscape.\n\nConclusion: A Transformative Year Ahead\n\nAs 2024 unfolds, the cryptocurrency market is set for a transformative journey. While Solana and Ethereum are predicted to see significant growth, Retik Finance is poised to make a more substantial impact. With its innovative solutions, Certik audit, and listings on key crypto platforms, Retik Finance is not just another token in the crowded crypto space; it’s a harbinger of change in DeFi. For investors and enthusiasts alike, Retik Finance represents an opportunity not just for substantial financial returns but also to be part of a revolution in decentralized finance.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMjAvZXRoZXJldW0tYXR0ZXN0YXRpb24tc2VydmljZS1sYXVuY2hlcy1idWlsZGVyLXByb2dyYW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Attestation Service Launches Builder Program - Crypto Times",
        "content": "The Ethereum Attestation Service (EAS) has announced its latest initiative, the Attestation Fellowship Builder Program. The program represents a significant step forward in fostering innovation and supporting the Ethereum ecosystem in its early-stage development.\n\nAnnouncing the Attestation Fellowship! 🎉\n\n\n\nIt's a 6-week builder program taking promising attestation founders from idea stage to demo day in front of leading ecosystem partners.\n\n\n\nApply to the inaugural batch!https://t.co/CG99x0cC0V pic.twitter.com/p7d3Y2WJaz — Ethereum Attestation Service (@eas_eth) January 19, 2024\n\nThe six-week, fully remote, carefully planned Attestation Fellowship Builder Program is meant to enable programming teams to take their attestation and related products from co-creation to launch.\n\nThe program covers a wide range of areas within its ambitiously broad scope, such as RWA (Real-World Asset) verification, voting systems, content authenticity, reputation systems, data markets, audit verification, collateral loans, and knowledge provenance.\n\nThe project is evidence of EAS’s dedication to supporting a new wave of blockchain applications that make use of attestation; it is not just another incubator program.\n\nEAS intends to tackle some of the most important issues in the blockchain space by concentrating on attestation-related products. These issues include assuring data integrity and authenticity, building trust in a decentralized system, and extending the use of blockchain technology across various sectors.\n\nThe EAS encourages applications from a wide range of talents and visions. The application period is still open through February 18th, providing a great chance for innovators to take center stage.\n\nWithin the six-week timeframe, each team will have tailored direction, resources, and mentorship, so that they can successfully launch their attestation products. It is worth noting that the program is a launchpad and does not guarantee immediate success or investment.\n\nEAS has communicated transparently that although the program does not offer direct investment, it represents a profound investment in the capabilities, potential, and future of the participating teams."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYm9sZC5jb20vZ3Jvay1haS1waWNrcy0zLWNyeXB0b2N1cnJlbmNpZXMtdG8taW52ZXN0LWluLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Grok AI picks 3 cryptocurrencies to invest in 2024 - Finbold - Finance in Bold",
        "content": "Grok, an artificial intelligence (AI) developed by xAI under Elon Musk’s guidance, has quickly gained popularity on X (formerly Twitter) and in the crypto world. The model processes diverse data streams and has real-time analysis of X’s user-generated content.\n\nPreviously, Grok made waves by choosing an ideal cryptocurrency for payments on X.\n\nIn the meantime, cryptocurrencies are getting ready for what could be a brewing bull market. Investors are managing their portfolios, looking for the best opportunities and value asymmetry to invest in 2024.\n\nFinbold turned to Grok, seeking valuable insights on three recommended cryptocurrencies for three different investment profiles. Particularly, we asked xAI’s model to pick one cryptocurrency for a conservative, aggressive, and very aggressive investor.\n\nGrok picks Ethereum (ETH) for conservative investors\n\nFirst, Grok named Ethereum (ETH) as the ideal investment for a conservative cryptocurrency profile in 2024. The AI forecasts a fair value of $8,000 to $10,000 for ETH, which justifies its pick.\n\n“Ethereum is a well-established and widely adopted platform with strong fundamentals and a large developer community. The successful implementation of Ethereum 2.0 and the continued growth of DeFi and NFT projects on the Ethereum network could drive its value higher.” — Grok, by xAI\n\nGrok picks Ethereum (ETH) for conservative investors. Source: Finbold\n\nElon Musk’s AI names Polkadot (DOT) to invest in 2024\n\nMeanwhile, aggressive investors should look at Polkadot (DOT) and a price range of $200 to $300 in 2024.\n\n“Polkadot is a promising interoperability platform that enables cross-chain communication and transactions. With its strong development team, growing ecosystem, and potential to become a critical infrastructure for the next generation of blockchain projects, it could see significant growth in the coming years.” — Grok, by xAI\n\nGrok picks Polkadot (DOT) for aggressive investors. Source: Finbold\n\nChainlink (LINK) is for the very aggressive investors, according to Grok\n\nFinally, Grok names Chainlink (LINK) as the right pick for very aggressive speculators looking for higher risks. LINK is expected to reach the price range of $150 to $250 per token, according to the AI.\n\n“Chainlink is a decentralized oracle network that provides real-world data to smart contracts. As the demand for reliable off-chain data in DeFi and other blockchain applications continues to grow, Chainlink’s adoption and value could increase significantly.” — Grok, by xAI\n\nGrok picks Chainlink (LINK) for aggressive investors. Source: Finbold\n\nConclusion\n\nIn summary, three different types of investors could benefit from deploying capital to Ethereum, Polkadot, and Chainlink, according to Grok. Notably, each project focus on different use cases like Web3 infrastructure, cross-chain solutions, and real-world data oracles, respectively.\n\nNevertheless, Grok warned for the speculative nature of its predictions and that “the cryptocurrency market is highly volatile and unpredictable.”\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vdS50b2RheS9pbnF1YmV0YS1xdWJlLXByZS1zYWxlLWluLWZvY3VzLWZvci1uZXctd2F2ZS1vZi1pbnZlc3RvcnMtYXMtZXRoZXJldW0tZXRoLXN0ZWxsYXItbHVtZW5zLXhsbdIBcGh0dHBzOi8vdS50b2RheS9pbnF1YmV0YS1xdWJlLXByZS1zYWxlLWluLWZvY3VzLWZvci1uZXctd2F2ZS1vZi1pbnZlc3RvcnMtYXMtZXRoZXJldW0tZXRoLXN0ZWxsYXItbHVtZW5zLXhsbT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "InQubeta (QUBE) Pre-Sale In Focus for New Wave of Investors as Ethereum (ETH), Stellar Lumens (XLM) Recovering - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAs the crypto market enters 2024, Ethereum (ETH) and Stellar (XLM) are experiencing mixed trends,\n\nInQubeta (QUBE), an innovative AI cryptocurrency ICO, is gaining momentum in January, 2024.\n\nSupporters of InQubeta (QUBE) can take part in pre-sale and buy tokens here.\n\nEthereum (ETH might be due to healthy correction\n\nEthereum, the second best cryptocurrency by market capitalization, has recently undergone a notable correction, retreating to key support levels. Despite this downturn, Ethereum has shown signs of resilience, indicating a potential resurgence from a lower level. Technical indicators paint a mixed picture; the Hourly MACD reveals diminishing bullish momentum, while the Relative Strength Index (RSI) for ETH/USD hovers just above the equilibrium point of 50. This suggests a degree of hesitation in the market, reflecting the uncertainty and fluctuating investor sentiment.\n\nStellar (XLM) community remains strongly optimistic\n\nStarting 2024 on a bearish note, Stellar has struggled to maintain or boost its price since December. Investors who hoped for a positive change in price trajectory with the new year have been disappointed, as Stellar records a decline in price value.\n\nAdditionally, trading volumes for Stellar have been decreasing, contributing to the negative sentiment surrounding the token. Experts anticipate that Stellar may break out of its bearish form in the coming weeks, but the current trend indicates a period of challenge for this top altcoin.\n\nInQubeta (QUBE) pre-sale gains momentum\n\nInQubeta emerges as a beacon of positive momentum in the crypto space. This platform, powered by its QUBE token, is starting to turn heads in the investment world, especially among those keen on the growing intersection of AI and crypto. What makes InQubeta stand out is how it's making it simpler for everyday investors to get into AI startups. With QUBE tokens, fractional investments are possible, opening up a field that was mostly played by the big guns.\n\nOn the InQubeta platform, AI startups have the opportunity to create popular NFTs that represent either rewards or a stake in their company. This offers investors a variety of direct ways to invest, which is pretty exciting. It's a win-win: startups get the funding they need, and investors have the chance to benefit from the success of these innovative AI ventures.\n\nThe QUBE token is at the heart of all this. It's a deflationary ERC20 coin, and it's got a unique approach where each transaction gets a 2% tax that goes to a burn wallet. Plus, there's a 5% tax that's set aside as a reward for those holding their coins.\n\nInQubeta, a new ICO, is tapping into what's hot right now: investments in AI startups. If we take a leaf out of crypto history, QUBE, InQubeta's token, could be gearing up to be a major player in the next bull run. It's this kind of potential and excitement that keeps the crypto arena interesting and full of surprises.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMjAvYWxseS1tYXJrZXRwbGFjZS1oaXRzLTEwMDAtZXRoLWluLWRhaWx5LXZvbHVtZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "ALLY Marketplace Hits 1,000 ETH in Daily Volume - Crypto Times",
        "content": "The emergence of the community-backed ALLY marketplace has hit a major milestone as it traded over 1,00 ETH daily and surpassed $10 million in its market cap.\n\nThis is another amazing launch that continues to consolidate the power of account abstraction technology within the Ethereum Virtual Machine (EVM) environs.\n\nAlthough there have been other EVM inscription platforms, ALLY is the first to use an account abstraction protocol exclusively for minting. This revolutionary method, enabled by Particle Network’s full-chain solution, provides a simple interface and increased security.\n\nAccording to the report, the platform has over 120k on-chain addresses and about $3M gas consumption that have been caused by inscriptions which is a clear indication of strong early adoption.\n\nThe successful launch of ALLY Marketplace reflects an increasing trend towards account abstraction, a technology from which user participation within the blockchain infrastructure can be reinvented.\n\nALLY is positioned to create a long-term trend on the EVM in terms of its high trading volume and vibrant community"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGMtcHJpY2UtcHJlZGljdGlvbi10ZWFzZXMtdHJlbmQtcmV2ZXJzYWwtdG8taGl0LTQwL9IBXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGMtcHJpY2UtcHJlZGljdGlvbi10ZWFzZXMtdHJlbmQtcmV2ZXJzYWwtdG8taGl0LTQwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "ETC Price Prediction Teases Trend Reversal To Hit $40 - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights ETC price action shows a retest phase of a bullish breakout of the consolidation range in the weekly chart.\n\nThe range breakout ends the long-term lower-high formations and marks a trend reversal.\n\nAs per the Fibonacci levels in the weekly chart, the reversal trend can reach the $40 mark.\n\nFollowing the impressive recovery of 37% last week, the ETC price shows a minor pullback this week. With a 6.47% decline, the minor pullback humbles the Ethereum Classic buyers and retests the breakout level.\n\nWith the weekly chart signaling an overall trend reversal spark getting brighter in the ETC price trend, the retest comes as an entry spot. Moreover, our ETC price prediction aligns with the trend reversal possibility as we expect a bull run for Ethereum Classic in 2024.\n\nSource – Tradingview\n\nETC Price Prepares A Takeoff Beyond $30\n\nIn the daily chart, the recent correction marks a quick retest of the 50-day EMA and the 38.20% Fibonacci level. However, the increased demand at lower levels pushes the Ethereum Classic price higher back with a long-tail bullish candle.\n\nFurther, an uptick in the trading volume supports the idea of a bullish comeback to conclude the ongoing retest. Currently, the ETC price trades at $24.82 and shows a 2.05% drop, resulting in a new bear candle, teasing a sideways shift above $24.\n\nTechnical indicators:\n\nStochastic RSI: The K and D lines in the stochastic RSI maintain a declining slope and approach the oversold boundary. Hence, a bounceback is possible as the lines may soon reverse from the oversold.\n\nEMA: In the daily chart, the 50-day EMA reflects a dynamic solid support ready to absorb overhead supply.\n\nWill Ethereum Classic Price Reach $40?\n\nFollowing the impressive reversal last night from the confluence of supports at $24, the Ethereum Classic sustains the uptrend. In addition, the weekly chart reflects a potential trend reversal with the range breakout.\n\nHence, the technical chart signals an entry opportunity for sideline traders in both weekly and daily charts.\n\nIf the buyers manage to lift the uptrend, the ETC price may break past $30 to reach $40 shortly. However, if ETC fails to maintain its momentum, it may break the $24 level to test the $20 mark."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvd2ViLTMtZ2FtZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Top Web3 Games To Explore In 2024; Here List - CoinGape",
        "content": "Editorial Note: The Coingape Marketing Editor Team provided a neutral viewpoint when creating the content. Though we receive commission for sponsored additions, this has no bearing on our assessments of the subject.\n\nOur editorial policy follows strict guidelines and review methodology when it comes to transparency and accuracy of the content we publish. We inculcate the extensive knowledge and wisdom of seasoned writers in our team so that the content is well-researched and crafted, tailoring to crypto readers.\n\nThe arrival of Web 3.0 has reshaped numerous industries, and gaming is certainly one of them. Each day, a new and insanely Web 3.0 game pops into the market, attracting the eyeballs of gamers around the world. With the efficient use of blockchain, smart contracts, and decentralized networks, those games offer a greater interactive and fun environment for players.\n\nHowever, with so many alternatives on the market, selecting the best Web 3.0 games may be a bit difficult. So, to make your work less complicated, we’ve indexed the top Web 3.0 games in this article based sentiment feed in respect of active addresses in the past 30 days. Before moving ahead, let’s first understand what exactly Web 3.0 games?\n\nWhat are Web 3.0 games?\n\nWeb 3.0 games, also referred to as blockchain games, are a new generation of video games. They are incredibly well designed with the assistance of Web 3.0 technology. Unlike conventional games, which might be centralized and managed by software providers, Web 3.0 games are created on blockchain platforms, which offer transparency, safety, and consumer ownership. These games use non-fungible tokens to symbolize in-sport assets, providing you with real ownership in addition to the capability to exchange, sell, or use these assets throughout several games."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyNC8wMS90aGVzZS0zLWNyeXB0b3MtYXJlLXdpbm5pbmctdGhlLW1vc3QtZnJvbS1iaXRjb2luLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "These 3 Cryptos Are Winning the Most From Bitcoin ETF Approval - CryptoDaily",
        "content": "Table of Contents\n\nAs Bitcoin steadily climbs, it boosts the whole crypto scene's confidence, nudging investors to take a shot at altcoins with their higher risk but tantalizing potential. Bitcoin's market dominance has declined by 6% since the ETFs' introduction, also indicating a growing interest in alternative cryptocurrencies. Experts hint we might be on the cusp of an 'altseason' where these under-the-radar cryptos start stealing the spotlight with their rising value: Ethereum (ETH), Solana (SOL), and Xai (XAI).\n\nRide The Wave Of Innovation With ScapesMania\n\nAs the ScapesMania presale nears its completion in February, the team is working hard to secure a quick listing on tier-1 exchange platforms. There is a good probability that the token's value will increase exponentially after the listing.\n\nThe team behind ScapesMania, with years of expertise, has crafted a robust post-listing marketing strategy. Buyback, burn, staking, and all the perks for holders keep attracting new adopters. Through DAO governance, backers will be able to influence and benefit from a multi-billion-dollar industry.\n\nMoreover, the token's utility is impressive. It's not another meme coin whose success relies heavily on trends and hype. ScapesMania (MANIA) is a well-balanced, meticulously designed project that acts as a gaming ecosystem.\n\nAs the presale is wrapping up, you need to act fast and grab your discounted tokens now! The countdown is on – don't let this chance pass you by.\n\nPresale is Live Now – Join Now for a Chance to Benefit with MANIA\n\nScapesMania, a player in the $376 billion gaming industry, leverages the market's growth potential. Post-exchange debut, holders can anticipate greater liquidity and easier trading.\n\nThe community's excitement about the project is evident so far, with $4,400,000+ raised to date from crowd/retail contributions alone. Notably, the fundraising amount is growing by $50,000+ daily and the follower count has reached 60K+ and showcases a weekly growth of 12%.\n\nThe growing interest from crypto whales with checks of $20,000+ might expedite ScapesMania's transition from niche to mainstream.\n\nScapesMania's smart contract has received approval from prominent security-ranking firms, ensuring peace of mind for holders. Additionally, the award-winning team behind ScapesMania secured a prestigious grant from a prominent player in the blockchain industry.\n\nFurthermore, ScapesMania is notable for putting its community front and center. Driving customer engagement and making sure that everyone benefits through great tokenomics and generous rewards is where ScapesManias stands out.\n\nMake sure you don't pass up the opportunity to get the early bird discount as the presale nears its end. Be quick if you want to get your hands on those lucrative tokens before they're all gone.\n\nPresale Closing Soon – Seize Opportunities Now!\n\nEthereum (ETH): Navigating the ETF Approval Landscape\n\nEthereum (ETH) is currently experiencing a significant shift in narrative due to speculation about a potential exchange-traded fund (ETF) approval in the USA. While an Ethereum spot ETF could potentially boost altcoin prices, it's prudent to temper expectations and invest judiciously. The market is closely monitoring the upcoming Bitcoin halving and the U.S. presidential election, both of which could significantly impact Ethereum's (ETH) trajectory.\n\nEthereum's (ETH) price has been fluctuating within a range of $2,188 to $2,736. The 10-day Moving Average is at $2,493, while the 100-day Moving Average is at $2,418. Key support levels are identified at $1,357 and $1,904, with resistance levels emerging at $3,000 and $3,548.\n\nShould regulators approve an Ethereum ETF, the token’s price will probably soar. However, the influence of global events and broader economic trends cannot be overlooked – the future of cryptocurrency regulation in the USA, possibly affected by the presidential election's outcome, could also impact Ethereum (ETH). Ethereum's (ETH) future price movement is likely to be shaped by these external factors, as well as its own technological advancements and adoption rate.\n\nSolana (SOL): Riding the Altcoin Season Wave\n\nSolana (SOL) is gaining recognition as a prominent player in the emerging altcoin season –. the Altcoin Season Index recently exceeded the critical threshold of 75, signaling the start of this period. Known for its high throughput and low transaction costs, Solana (SOL) has demonstrated a notable price increase and is now forming a bullish pattern on its chart.\n\nThe current price range for Solana (SOL) is between $64.84 and $132.36. The 10-day Moving Average lies at $96.62 and the 100-day Moving Average stands at $65.74. Solana (SOL) has support at $27.97 and faces resistance at $163.01 and $230.54.\n\nSolana's (SOL) performance during the altcoin season and its technical indicators suggest a bullish outlook. However, the volatile nature of the crypto market should not be underestimated – significant gains are possible, but so are losses. The sustainability of this momentum and Solana's (SOL) ability to reach new heights will be closely monitored by the community.\n\nXai (XAI): The Rising Star in Gaming Cryptocurrency\n\nXai's (XAI) recent price surge is attributed to several key developments: an airdrop that distributed free coins, listings on major exchanges like BNB, and a strong presence in the gaming world's digital currency scene. With a blockchain designed for the gaming community, Xai (XAI) aims to address common challenges faced by gamers online.\n\nXai (XAI) is currently nestled between $0.93 and $1.124. The 10-day Moving Average sits at $0.87 and the 100-Day Moving Average hovers at $0.97. Support levels are set at $0.67 and $0.85, with resistance levels looming at $1.22 and $1.41.\n\nXai's (XAI) near-term prospects appear promising given its recent airdrop and new exchange listings that provided a significant boost. However, to prosper in the long run, Xai (XAI) has to sustain its momentum and capitalize on the potential of the gaming sector. If it innovatively integrates blockchain with gaming and creates new ways to share games, the Xai (XAI) token stands a great chance of growing and succeeding.\n\nConclusion\n\nThe introduction of spot Bitcoin ETFs has notably influenced the crypto market, particularly benefiting Ethereum (ETH), Solana (SOL), and Xai (XAI) and heralding the beginning of an 'altseason' – a period during which alternative cryptocurrencies gain in value and prominence. Ethereum (ETH) is poised for growth with the potential of an ETF approval, Solana (SOL) is capitalizing on its technical strengths during the altcoin season, and Xai (XAI) is emerging as a significant player in the gaming cryptocurrency sector. Their future price action depends on several factors which are tech developments, market adoption, and broader economic and regulatory events.\n\nDisclaimer: This is a sponsored article and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1idWxsLXdoby1ib3VnaHQtcmV0aWstZmluYW5jZS1yZXRpay1pbi1wcmVzYWxlLXN0YWdlLTEtYWNjdW11bGF0ZXMtbW9yZS1pbi1zdGFnZS02LWhlcmVzLXdoeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Bull Who bought Retik Finance (RETIK) in Presale stage 1, Accumulates more in Stage 6, Here's Why - Analytics Insight",
        "content": "A renowned Ethereum bull has emerged as one of the early adopters of Retik Finance (RETIK). He first bought RETIK in presale stage 1, when the price was only $0.03 per token. He was impressed by Retik’s vision and potential. The platform’s flagship product—the Retik DeFi debit cards—allows anonymous transactions without KYC and provides lucrative cashback rewards with each transaction. He continues to invest more as the Retik Finance presale progresses in stage 6.\n\nRetik Finance?\n\nRetik Finance is a comprehensive DeFi solution that bridges the gap between the crypto realm and real-life utility. It believes in bringing cryptocurrency to the forefront of everyday experiences. Retik Finance provides a range of financial products that enhance the accessibility, security, and efficiency of decentralized transactions.\n\nSome of the main features of Retik Finance are:\n\nDeFi Debit Cards: Retik Finance offers DeFi debit cards that allow users to make anonymous transactions without KYC requirements, prioritizing user privacy. The cards can be used for daily transactions, online and offline, across borders, and at any ATM. The cards also offer a rewards program, with cashback benefits ranging from 2.5% to 5%, depending on the card tier. Additionally, cardholders can enjoy complimentary airport lounge access worldwide.\n\nSmart Payment Gateway: Retik Finance enables online businesses to seamlessly accept cryptocurrencies as a payment option, expanding their customer base and revenue potential. The payment gateway is fast, secure, and easy to integrate, with no hidden fees or chargebacks.\n\nP2P Lending: Retik Finance leverages AI to analyze lending options and provide the best and most profitable solutions for borrowers and lenders. Users can lend and borrow various assets with flexible terms and low interest rates.\n\nSecure Wallet: Retik Finance offers a non-custodial wallet that supports multiple blockchains, giving users full control over their assets. The wallet is highly secure, with features such as biometric authentication, multi-signature, and anti-theft protection.\n\nSwap Aggregator: Retik Finance allows users to effortlessly find the most favorable rates by instantly comparing quotes and fees across various decentralized exchanges (DEXes). Users can swap any asset with minimal slippage and gas fees.\n\nPerpetual Futures/Options Trading: Retik Finance enables users to engage in long and put options directly from the app, simplifying their trading experience across different assets. Users can trade with leverage, hedge their risks, and profit from market movements.\n\nWhat is Retik Presale?\n\nRetik Presale is the initial offering of RETIK tokens to the public before they are listed on centralized and decentralized exchanges. The presale consists of 10 stages, each with a different price and allocation of tokens. In the current stage 6, the price of each RETIK token has increased to 0.08, which is still a bargain as these prices are expected to rise even further in the remaining presale stages.So far, Retik Finance has raised over $10.5 in the presale from individual investors. Notably, the team behind Retik Finance could have taken funds from the VCs based on how good the concept is, but they decided to go for a fair and transparent launch. They wanted to give every individual a chance to make money and have a hand in changing and revolutionizing DeFi forever.\n\nWhy is the Ethereum Bull accumulating RETIK?\n\nOne of the early adopters of Retik Finance is an anonymous Ethereum bull who bought RETIK tokens in the first stage of the presale and has been accumulating more in the subsequent stages. The Ethereum bull believes that Retik Finance is a game-changer in the DeFi space and that its price will appreciate significantly post-launch.The Ethereum bull is likely impressed by the vision, innovation, and utility of Retik Finance and sees it as a long-term investment with huge potential. Retik Finance is a DeFi ecosystem that offers a variety of financial tools and services, powered by its native token, RETIK. Retik Finance aims to redefine how people conduct financial transactions in the digital age by bringing cryptocurrency to the forefront of everyday experiences.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvbmV3cy1pbi1jcnlwdG8vb2JzZXJ2ZXJzOnZpdGFsaWstYnV0ZXJpbi1kZWZpbmVzLWwycy1vbi1jZWxlc3RpYS1hcy12YWxpZGl1bXMtbm90LXJvbGx1cHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Defines L2s on Celestia as Validiums, Not Rollups - CryptoDaily",
        "content": "Ethereum Foundation co-founder Vitalik Buterin has recently weighed in on the classification of the blockchain's Layer 2 (L2) scaling solutions and declared that validiums associated with Ethereum should not be confused with genuine rollup solutions.\n\nThe discussion gained momentum this week, when Ethereum enthusiast and Soul Wallet co-founder Zeng Jiajun noted that ethereum.org and Buterin define \"Layer 2 = rollup\" and added that \"if one uses any other chain (Celestia, for example) as DA [data availability], it is a Celestia L2.\"\n\nButerin agreed with Daniel Wang, the founder of Taiko, an Ethereum rollup solution, who suggested that Ethereum rollups relying on external data chains for data availability, like Celestia, should be classified as validiums.\n\nThis is correct.\n\n\n\nThe core of being a rollup is the unconditional security guarantee: you can get your assets out even if everyone else colludes against you. Can't get that if DA is dependent on an external system.\n\n\n\nBut being a validium is a correct choice for many apps, and… — vitalik.eth (@VitalikButerin) January 16, 2024\n\nButerin shared the defining feature of rollups, stating that \"the core of being a rollup is the unconditional security guarantee: you can get your assets out even if everyone else colludes against you.\" He also pointed out the inherent security risks when data availability (DA) is dependent on an external system and recognized that a validium is a viable choice for many applications. He suggested that implementing robust, distributed DA systems could significantly bolster the practical security of a validium.\n\nValidiums, as defined by ethereum.org, are a scaling solution for Ethereum that enhances transaction processing capacity by allowing off-chain transactions through zero-knowledge (ZK) proofs while relying on the blockchain's mainnet for verification processes and security. Unlike rollups, validiums bypass storing all transaction data to an L1, boosting scalability by limiting on-chain data storage.\n\nValidiums also introduce reliance on third-party operators for accurate proof postings, potentially impacting data availability, a challenge less prevalent in rollups. Validiums are crucial in balancing transaction speed and privacy in systems like Celestia's modular blockchain.\n\n\n\nCelestia uses a modular design, differing from Ethereum's architecture, by separating data availability and validation into distinct layers. This structure offers customizable data availability and independent validation layer deployment.\n\n\n\nIn contrast, Ryan Berckmans, a member of the Ethereum community and the founder of Ethereum payments app 3cities, challenges Buterin's view. Berckmans commented that validiums should be considered L2 networks, arguing that a Layer 2 chain is defined by its settlement on Ethereum, not by the location of its data availability. He emphasizes the industry's flexibility in still being able to define 'L2' and suggests a more inclusive definition encompassing both rollups and validiums. Berckmans also references L2Beat, a platform tracking the adoption of layer-2 protocols, which currently includes validiums in its L2 lists.\n\nYes, but validiums are L2s.\n\n\n\nThis is a new industry, we can define \"L2\" to mean whatever we want.\n\n\n\nThe maximally useful definition of L2 includes both rollups and validiums.\n\n\n\nThat's why L2Beat lists validiums today.\n\n\n\nL2 = rollup or validium https://t.co/WwtkAV2sAE — Ryan Berckmans ryanb.eth (@ryanberckmans) January 16, 2024\n\nL2Beat's website, however, states that validiums are not L2s: \"by not publishing data on L1 they introduce additional trust assumptions on top of it. If the data to reconstruct the state is not made available by the operators of the off-chain DA solution, funds are at risk.\" So L2Beat considers validiums to fall outside the scope of traditional rollup-style L2 solutions.\n\n\"We include Validiums and Optimiums along with L2s mainly for historical reasons. We introduced them when the L2 space was still in its infancy and we wanted to provide a comprehensive overview of the space. We will continue to track these projects to provide the community with a broader perspective on the state of the space and to provide tools to evaluate the different tradeoffs between the various solutions.\"\n\nAlthough there is still debate over whether a validium should fall under the L2 umbrella, Vitalik clearly sees the structure as something separate."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tYm9zcy1ibGFzdHMtZmlybXMtZm9yLWZvdW5kYXRpb25hbC1zaW4v0gFLaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ldGhlcmV1bS1ib3NzLWJsYXN0cy1maXJtcy1mb3ItZm91bmRhdGlvbmFsLXNpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Boss Unleashes: Buterin Blasts Crypto Firms For 'Foundational Sin' - Bitcoinist",
        "content": "Renowned Ethereum founder, Vitalik Buterin, has ignited a fervent debate within the crypto industry, urging stakeholders to prioritize transparency and accountability. Drawing attention to recent governance challenges, Buterin’s insights shed light on a critical need for open dialogue and the industry’s responsibility to rectify its past missteps.\n\nEthereum Founder: Address Crypto Industry’s Governance Issues\n\nButerin’s reflections were prompted by two prominent incidents that have rattled the crypto sphere: the controversy surrounding Sam Bankman-Fried and governance issues within the OpenAI board. However, his focus extends beyond these specific cases, delving into the broader challenges faced by the tech and crypto sectors.\n\nCentral to Buterin’s argument is the call to address the industry’s governance shortcomings, which he refers to as a “foundational sin.” He emphasizes that the core issue lies not only in the controversial actions themselves but also in the lack of transparent and accountable dialogue with the public. This failure to foster trust and engagement has far-reaching consequences for the industry’s credibility and long-term sustainability.\n\nI feel like my response survived ok: my main critique in both cases was “respect public legitimacy more” (Sam’s sin was the fraud plus the “woke shibboleths” thing, the OpenAI board’s sin was making a sudden huge decision and feeling entitled to not explain itself to the public) — vitalik.eth (@VitalikButerin) January 20, 2024\n\nThe FTX scandal serves as a timely example of the consequences of this foundational sin. Buterin underscores the importance of substantiated evidence before passing swift judgment on high-ranking CEOs involved in deceptive behavior. The absence of a governing board at FTX highlights the critical need for robust oversight mechanisms to ensure checks and balances within corporate structures.\n\nEthereum currently trading at $2,409 on the daily chart: TradingView.com\n\nButerin: Rectify ‘Foundational Sin’\n\nButerin’s astute analysis examines the intricacies of corporate governance, especially within the ever-evolving ethereum and crypto landscape. He argues that rectifying the industry’s foundational sin requires a paradigm shift that values public trust and legitimacy. Instances like Sam Bankman-Fried’s fraudulent activities and the opaque decision-making process at OpenAI serve as cautionary tales, exposing the pressing need for improved governance practices in the tech and crypto sectors.\n\nThe key question arises: How can crypto companies restore trust, transparency, and accountability? Buterin proposes a governance model that not only complies with legal mandates but also genuinely engages with the community. By fostering open dialogue and involving stakeholders, companies can rebuild public trust and address the industry’s governance challenges head-on.\n\nWhile the Ethereum founder’s vision has garnered support from many quarters, skeptics question the practicality of implementing such a governance model in the complex crypto landscape.\n\nAs the crypto industry grapples with these profound challenges, the discussions ignited by Buterin’s insights on transparency and accountability have become pivotal to its evolution.\n\nFeatured image from Getty Images"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtLWF0dGVzdGF0aW9uLXNlcnZpY2UtYnVpbGRlci1wcm9ncmFtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Attestation Service Launches Innovative Builder Program - Cryptopolitan",
        "content": "The Ethereum Attestation Service (EAS) has unveiled its latest initiative – the Attestation Fellowship Builder Program. The program represents a step forward in fostering innovation and supporting early-stage development within the Ethereum ecosystem.\n\nUnleashing potential: The Attestation Fellowship Builder program\n\nThe Attestation Fellowship Builder Program is a meticulously structured six-week journey, entirely conducted remotely, designed to empower participating teams to bring their attestation-related products from conception to launch. The program’s ambitiously broad scope encapsulates a variety of domains, including but not limited to knowledge provenance, reputation systems, data markets, content authenticity, voting systems, audit verification, collateral loans, and RWA (Real-World Asset) verification.\n\nThe initiative is not just another incubator program; it’s a testament to EAS’s commitment to nurturing a new generation of blockchain applications that leverage the power of attestation. By focusing on attestation-related products, EAS aims to address some of the most pressing challenges in the blockchain space, such as ensuring the authenticity and integrity of data, enhancing trust in decentralized systems, and expanding the applicability of blockchain technology in diverse sectors.\n\nA gateway for innovators and visionaries\n\nThe Attestation Fellowship Builder Program is not just an incubator; it’s a beacon for early-stage founders and teams that have yet to secure funding. Recognizing the importance of diversity and inclusion in fostering innovation, EAS has opened its doors wide, inviting applications from a broad spectrum of talent and vision. The application window remains open until February 18th, offering a valuable opportunity for those at the forefront of innovation to step into the spotlight.\n\nThe selection process is keenly competitive, with an estimated ten teams set to be officially admitted into the program by the end of February. The exclusivity ensures that each team receives tailored guidance, resources, and mentorship, maximizing their chances of successfully launching their attestation products within the ambitious six-week timeframe.\n\nBeyond the program: A commitment to long-term success\n\nIt’s crucial to understand that the program is a launchpad, not a guarantee of immediate success or investment. EAS has been transparent in communicating that while the program does not offer direct investment, it represents a profound investment in the capabilities, potential, and future of the participating teams.\n\nBy not guaranteeing investments from partners, the program instills a sense of realism and self-reliance in participants. It encourages teams to focus on building robust, market-ready solutions that can stand on their own merits. However, the real value of the program lies in the exposure, networking opportunities, and credibility that comes with being an EAS Fellow. The knowledge, experience, and connections gained during the program are assets that will continue to yield benefits long after the six weeks.\n\nConclusion\n\nThe launch of the Attestation Fellowship Builder Program by the Ethereum Attestation Service is a clear signal of the burgeoning potential and increasing importance of attestation services in the blockchain ecosystem. By focusing on empowering innovators and visionaries with the tools, knowledge, and support they need to succeed, EAS is paving the way for a future where blockchain technology realizes its full potential, not just as a ledger for cryptocurrencies but as a foundational technology for a wide array of applications across various industries. As the application deadline approaches and the selection process unfolds, the tech community eagerly anticipates the innovative solutions and transformative projects that will emerge from the pioneering program."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vY2FyZGFuby1hZGEtc3VycGFzc2VzLWV0aGVyZXVtLWV0aC1pbi13aGFsZS10cmFuc2FjdGlvbnMtc2lnbmFscy1zdHJlbmd0aC1hbWlkLWJlYXJpc2gtbWFya2V0L9IBhgFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vY2FyZGFuby1hZGEtc3VycGFzc2VzLWV0aGVyZXVtLWV0aC1pbi13aGFsZS10cmFuc2FjdGlvbnMtc2lnbmFscy1zdHJlbmd0aC1hbWlkLWJlYXJpc2gtbWFya2V0Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Cardano (ADA) Surpasses Ethereum (ETH) in Whale Transactions, Signals Strength Amid Bearish Market - Crypto News Flash",
        "content": "Despite facing market declines, Cardano surpasses Ethereum in large transactions, with daily volumes reaching $13 billion.\n\nCardano’s ADA price dropped by 2.56% to $0.5177, while Ethereum saw a milder 0.85% decrease to $2,516.35 in the past 24 hours.\n\nCardano (ADA) has recently outpaced Ethereum (ETH) in large transaction volumes. Data from the crypto analytics platform IntoTheBlock (ITB) reveals that Cardano’s 30-day volume of large transactions, defined as those exceeding $100,000 in fiat value, significantly surpasses Ethereum’s. This development emerges as the crypto market attempts to navigate through a bearish phase.\n\nCardano whales have been quite active for the past few months. $13B in large transactions (>$100k) is being settled on Cardano daily on average. A significant amount, if you compare it to Ethereum's $5B 7-day average. pic.twitter.com/8rjeQZaonU — IntoTheBlock (@intotheblock) January 18, 2024\n\nCardano, known for its scientific approach to blockchain development and a strong focus on sustainability, has seen its market price and capitalization dip by 4% in the past 24 hours, at $0.5 and $17 billion respectively. In contrast, Ethereum, the industry’s foremost smart contract network, has experienced a milder decline of 1.96% in the same period, with its price adjusting to $2,487.35.\n\nEthereum’s Position in the Market\n\nWith a slower growth rate, Ethereum holds its position, while Cardano shows a strong influx of large transactions. According to IntoTheBlock data, the weekly average of Ethereum’s huge transactions—mostly those made by market whales—is approximately $5 billion. Ethereum’s transaction volume has, however, recently increased. Over the past 24 hours, it has increased by 6.74% to $4.16 billion. This increase contrasts Cardano’s higher volume, currently at $11.24 billion but has dropped 8.74% in the same period.\n\nEthereum continues to be a major force in the cryptocurrency market, having been the first to develop smart contract technology and spur the emergence of decentralized apps (dApps). It continuously upgrades to a proof-of-stake consensus process to address scalability and environmental concerns, factors crucial to its long-term viability.\n\nThe competition between Layer-1 networks like Ethereum and Cardano reflects the larger dynamics in the cryptocurrency market. To have the Cardano protocol surpass Ethereum in market valuation is one of the community’s aspirational goals. This objective seems far-fetched, though, given that Ethereum’s market capitalization is $302,549,903,898 while Cardano’s is only $903,898.\n\nCardano’s immediate focus may be leveraging its current strengths, including the recent surge in whale transaction volume and its ongoing developer activity. These factors play a crucial role in establishing Cardano as a strong competitor in the blockchain market, which could challenge Ethereum’s established dominance.\n\nThe Bearish Sentiment and Future Prospects\n\nThe prevailing bearish sentiment in the crypto market has impacted both Cardano and Ethereum, albeit in different magnitudes. ADA has recently fallen below the 50-day Exponential Moving Average (EMA), a critical market sentiment indicator. This drop is typically considered a bearish signal, often leading to further declines or a market consolidation period. The significance of this drop lies in the combination of high transaction volumes with ADA’s negative price action, raising questions about the long-term strategies of large-scale investors in Cardano.\n\nDespite these challenges, Cardano’s community remains optimistic about its long-term prospects, especially in its ambition to surpass Ethereum in market capitalization. However, with Cardano’s market cap currently at $18.3 billion, significantly lower than Ethereum’s $302.5 billion, this goal appears more aspirational in the current market context.\n\n."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZnhkYWlseXJlcG9ydC5jb20vYWlyZGFvLWxhdW5jaGVzLWFtYi10b2tlbi1vbi1ldGhlcmV1bS1leHBhbmRpbmctcHJlc2VuY2Utd2l0aC11bmlzd2FwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "AirDAO Launches AMB Token on Ethereum, Expanding Presence with Uniswap - FXDailyReport.com",
        "content": "In a noteworthy development for the AirDAO community, the new AMB token is set to launch on the Ethereum network come January 22. This strategic move marks an expansion of presence across diverse decentralized and centralized exchanges (DEXs and CEXs). The latest addition is being added on the widely recognized Uniswap platform.\n\nToken Deployment and Seamless Transfers: AirDAO Enhancing User Experience on Ethereum\n\nThe smart contract for the AMB token on the Ethereum network has undergone deployment. It has been done in order to ensure a transparent and verified environment for users engaging in Uniswap transactions. Come January 22, 2024, the AMB/wETH pair will go live on Uniswap. This pair will be providing users with the opportunity to seamlessly trade the AMB token for ETH.\n\nMoreover, for the esteemed AMB-Net users, the bridge to Ethereum is now open. It will allow for a smooth transfer of AMB tokens to Ethereum starting January 22, 2024. It’s important to note that the transfer process is anticipated to take approximately 24 hours.\n\nFees and Expansion – Navigating Costs for AMB Token Transition to Ethereum\n\nTo facilitate this transition, AirDAO has now introduced nominal fees to cover the services provided. Users will incur a Network Fee, payable in AMB tokens, when transferring from AMB-NET to Ethereum. The cost is contingent on the prevailing Ethereum network transaction fees, typically around $20. Additionally, a symbolic 0.3% fee for transactions of $100,000 or less has been implemented as a bridge fee. For transactions exceeding this amount, the fee is reduced to 0.1%.\n\nTrending Now: Huobi Initiates Transition from HT TOKEN to HTX TOKEN\n\nThis expansion represents a significant stride in AirDAO’s journey, empowering the whole community to seamlessly interact with the Ethereum ecosystem, particularly on the Uniswap platform. AirDAO is enthusiastic about the potential opportunities this brings for the community and eagerly anticipates an exciting future filled with decentralized possibilities."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL3NlYy1kZWxheXMtZGVjaXNpb24tb24tZXRoZXJldW0tZXRmLW1hcmtldC1hbnRpY2lwYXRlcy1pbXBhY3Qtb24tZXRoLXByaWNlcy05MDkwMdIBf2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL3NlYy1kZWxheXMtZGVjaXNpb24tb24tZXRoZXJldW0tZXRmLW1hcmtldC1hbnRpY2lwYXRlcy1pbXBhY3Qtb24tZXRoLXByaWNlcy05MDkwMS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays Decision on Ethereum ETF: Market Anticipates Impact on ETH Prices - The Currency Analytics",
        "content": "In a recent development, the U.S. Securities and Exchange Commission (SEC) has opted to prolong its assessment of Fidelity’s application for a spot Ethereum ETF. This decision, conveyed through a letter to Fidelity dated January 18, 2024, marks a pivotal moment in the cryptocurrency landscape, prompting industry watchers to contemplate potential parallels with the journey of Bitcoin ETF approvals.\n\nThe application, initially submitted on November 17, 2023, and open for public comments since December 6, will now undergo an extended evaluation process, with the resolution expected around March 5, 2024. Notably, this 45-day extension has fueled speculation, with Bloomberg analyst James Seyffart suggesting that approval might materialize in May. BlackRock’s CEO, Larry Fink, expressing confidence in the value of a spot Ethereum ETF, added weight to the conversation, noting the significance of such a development shortly after the approval of the spot Bitcoin ETF.\n\nWhile the approval of the spot Bitcoin ETF failed to trigger a notable surge in prices, Ethereum, on the other hand, might experience a more pronounced response to both the proposal submission and the eventual decision. The cryptocurrency, currently trading around $2,400, has witnessed a minor loss of less than 1% in the last 24 hours. Despite this apparent downtrend, Ethereum’s current value surpasses its worth from a year ago.\n\nAnalyzing the daily timeframe chart, it becomes evident that ETH did not reach its present price level over the past year. The ongoing bull trend, while displaying signs of weakening, remains evident, with the Relative Strength Index (RSI) indicating a bullish trend at press time by remaining above the neutral line.\n\nThe impact on Ethereum’s market trends is being closely monitored. Unlike Bitcoin, where the ETF approval had a minimal immediate effect on prices, Ethereum’s market may be more responsive to the news of the proposal submission and subsequent decision. As of the latest update, Ethereum (ETH) is trading at approximately $2,400, reflecting a marginal loss of less than 1% in the last 24 hours. Despite the current downtrend, Ethereum’s value remains higher than its position a year ago.\n\nAnalyzing the daily timeframe chart for ETH/USD, it becomes evident that the present price level was not reached over the past year. However, the ongoing bull trend shows signs of weakening, with the Relative Strength Index (RSI) remaining above the neutral line, indicating a prevailing bullish trend.\n\nExamining the exchange flow of Ethereum, it is notable that the balance between inflow and outflow shifted around January 14. Since then, a consistent trend of more outflows than inflows has emerged. This suggests a significant amount of ETH is leaving exchanges, with fewer Ethereum assets available for sale recently. This dynamic in exchange flow could potentially impact the cryptocurrency’s market dynamics in the coming weeks.\n\nTaking a closer look at Ethereum’s exchange flow, a recent examination by AMBCrypto reveals a noteworthy shift in the balance between inflow and outflow around January 14. Since then, a consistent trend has emerged, indicating more outflow than inflow. This suggests a substantial amount of ETH is leaving exchanges, while the incoming volume remains comparatively lower. Furthermore, this trend implies a reduction in the number of Ethereum assets available for sale in recent times.\n\nAs the cryptocurrency community awaits the SEC’s decision, the impact on Ethereum’s market dynamics and valuation remains a focal point of discussion. While the spot Bitcoin ETF approval did not lead to an immediate surge in prices, Ethereum’s unique circumstances and the increasing outflows from exchanges raise questions about how the market will react.\n\nPotential investors and enthusiasts are advised to stay vigilant, as the SEC’s decision holds the potential to reshape Ethereum’s trajectory in the coming months. Whether the market will witness a surge in prices following approval or if the current trends in exchange flows will continue, only time will tell.\n\nIn the ever-evolving landscape of digital assets, regulatory decisions play a crucial role in shaping market sentiment. As Ethereum enthusiasts and investors eagerly await the outcome of the SEC’s review, the cryptocurrency market is poised for a period of heightened anticipation and speculation."
    }
]