[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtZGVsYXlzLWJsYWNrcm9jay1zcG90LWV0aGVyZXVtLTA0MzAyMjY3NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays BlackRock's Spot Ethereum ETF Decision - Yahoo Finance",
        "content": "SEC Delays BlackRock’s Spot Ethereum ETF Decision\n\nThe United States Securities and Exchange Commission (SEC) has delayed its decision on BlackRock's proposed spot Ether (ETH) exchange-traded fund (ETF), citing the need for more time to review the proposed rule change. The delay, announced one day ahead of the January 25 deadline, marks the first of several delays the SEC can exercise across a 240-day period. This first deadline comes nearly 45 days after BlackRock filed for an iShares Ethereum Trust through Nasdaq on December 11.\n\nBlackRock's spot Ethereum ETF has a final deadline decision date of August 7, 2024. However, Bloomberg ETF analyst Eric Balchunas believes that a final decision will be made on all pending spot Ether ETFs in May, with the analyst giving a 70% chance of approval. May 23 is the earliest final deadline of all applicants, similar to the SEC's decision on 10 pending spot Bitcoin ETFs on January 10. Other spot Ether ETF applications have final decision deadlines ranging from May 23 to August 3.\n\nBloomberg ETF analyst James Seyffart expects to see more spot Ether ETF delays \"sporadically\" over the next few months. He also further emphasized the importance of May as the crucial decision date for Ether ETFs applications. The SEC's decision-making process for spot Ether ETFs is being closely watched by the cryptocurrency industry and investors alike. The approval of spot Ether ETFs would provide a more accessible and regulated way to invest in Ether, the second-largest cryptocurrency by market capitalization.\n\nHowever, the SEC's delay in deciding on BlackRock's spot Ether ETF proposal suggests that the Commission is taking a cautious approach to approving these products. The SEC's decision will likely depend on its assessment of the risks and benefits of spot Ether ETFs, as well as the adequacy of the proposed rule changes."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wbHVuZ2UtdG8tMmstaW1taW5lbnQtYXMta2V5LXN1cHBvcnQtbGluZS1jcnVtYmxlcy_SAWtodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtcGx1bmdlLXRvLTJrLWltbWluZW50LWFzLWtleS1zdXBwb3J0LWxpbmUtY3J1bWJsZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Plunge To $2K Imminent as Key Support Line Crumbles - NewsBTC",
        "content": "Ethereum price extended losses and tested the $2,150 support. ETH is struggling to recover and might continue to move down toward the $2,000 support zone.\n\nEthereum started a fresh decline below the $2,350 and $2,250 levels.\n\nThe price is trading below $2,250 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair attempt a fresh increase if it clears the $2,240 and $2,280 levels.\n\nEthereum Price Extends Losses\n\nEthereum price remained in a bearish zone below the $2,400 pivot level. ETH extended its decline and traded below the $2,250 support level, like Bitcoin.\n\nIt even spiked below the $2,000 level. A new weekly low was formed near $2,165 and the price is now consolidating losses. There was a minor increase above the $2,220 level. The price tested the 23.6% Fib retracement level of the downward wave from the $2,480 swing high to the $2,165 low.\n\nEthereum is now trading below $2,250 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,240 level. There is also a key bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD.\n\nThe next hurdle could be $2,280, above which the price could aim for a decent recovery. The next major resistance is now near $2,360 or the 61.8% Fib retracement level of the downward wave from the $2,480 swing high to the $2,165 low.\n\nSource: ETHUSD on TradingView.com\n\nA clear move above the $2,360 level might start a decent increase. In the stated case, the price could rise toward the $2,415 level. Any more gains might send the price toward the $2,550 zone.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $2,440 resistance, it could start another decline. Initial support on the downside is near the $2,200 level.\n\nThe next key support could be the $2,165 zone. A downside break below the $2,165 support might send the price further lower. In the stated case, Ether could test the $2,120 support. Any more losses might send the price toward the $2,000 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,165\n\nMajor Resistance Level – $2,480\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0Mzc1L3NlYy1kZWxheXMtZGVjaXNpb24tdGltZWxpbmUtZm9yLWJsYWNrcm9ja3MtcHJvcG9zZWQtc3BvdC1ldGhlcmV1bS1ldGYtdG8tbWFyY2jSAXdodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzQzNzUvc2VjLWRlbGF5cy1kZWNpc2lvbi10aW1lbGluZS1mb3ItYmxhY2tyb2Nrcy1wcm9wb3NlZC1zcG90LWV0aGVyZXVtLWV0Zi10by1tYXJjaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC delays decision timeline for BlackRock's proposed spot Ethereum ETF to March - The Block",
        "content": "The Securities and Exchange Commission delayed its decision timeline on BlackRock's proposal for a spot Ethereum ETH +1.16% exchange-traded fund to March, according to a filing.\n\n\"The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" according to Wednesday's filing.\n\nThe SEC will now face a March 10 deadline to approve, disapprove or institute additional proceedings on the proposed fund.\n\nBlackRock filed for its spot Ethereum ETF, called the iShares Ethereum Trust, in November. Fidelity's application for the Fidelity Ethereum Fund was also delayed, according to a filing posted last week.\n\nBloomberg Intelligence ETF analyst James Seyffart said delays for spot Ethereum ETF proposals will likely continue.\n\n\"Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,\" Seyffart said on Wednesday in a post on X.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nWill there be a spot ether ETF?\n\nCrypto experts have been both optimistic and pessimistic that a spot ether ETF is on the horizon, and some think an approval from the SEC could come as early as May following the approval of spot bitcoin ETFs earlier this month.\n\nSEC Chair Gary Gensler threw some cold water on the idea of other crypto linked exchange traded products.\n\n\"As I said two weeks ago, that which we did with regard to bitcoin exchange traded products is cabined to this one commodity non-security and shouldn't be read to be anything other than that,\" Gensler said during a media briefing earlier on Wednesday."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZ2lsYWhlcmFsZC5jb20vZXRoZXJldW0tY29udGludWVzLXRvLXNlZS1jaGFuZ2VzLW9uLXRoZS1wYXRoLXRvLWdyb3d0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum continues to see changes on the path to growth - The Gila Herald",
        "content": "Image source: https://unsplash.com/photos/a-close-up-of-a-gold-coin-with-the-word-ether-on-it-gWoL3zunCZE\n\nEthereum had a tough time in 2023, dealing with considerable external pressures from regulatory authorities, as well as the collapse of exchanges and crypto-friendly banks that rocked the digital money environment to its core. Binance data shows that the coin has regained much of its former strength over the past couple of months, but a lot of work remains to be done. As Ethereum continues to recover bit by bit, here are some of the most critical changes in the system that could mean prices will continue to change.\n\nCensorship\n\nThe cryptocurrency world is best known for being a fully decentralized environment. That means that no single person or company owns all the data; instead, it is distributed across the different nodes in the system. In light of the recent talks about imposing stricter regulations on blockchains, many investors have discussed the possibility that this is the beginning of the end for the decentralized ledger. Many traders believe that the only reason regulations would ever be enforced is to keep the system under control and switch it to a more centralized model.\n\nSome are concerned that these shifts have already begun to happen for Ethereum. The US government recently sanctioned an Ethereum blockchain program allowing investors to perform transactions without leaving a trace. The OFAC claimed that the program was used by entities prohibited by the United States, including military organizations. Many investors criticized the motion while also saying that the Ethereum blockchain will likely remain immune due to its decentralized nature.\n\nHowever, it seems now that they weren’t exactly correct, and at the moment, over 70% of data blocks are considered censored. That’s an almost 30% increase compared to November 2022, when Ethereum was going through one of its lowest periods. Block builders generally have complete authority over the order of transactions and how they are arranged in blocks, meaning they decide on the blockchain content by default. Right now, Titan Builder is the only one claiming not to censor transactions, but if it did, that means Ethereum could reach 90% in censorship.\n\nRelayers\n\nThe relayers are third parties who operate software that moves transactions from the builders to the validators. Back in November 2022, the numbers showed that over 75% of them had ceased passing along transactions that official authorities had sanctioned. However, this is also due, at least partially, to the fact that there wasn’t a large number of relayers at the time, and the ones in charge of the larger volumes were removing these transactions from the central system.\n\nAccording to the latest definitions, only 30% of relayed blocks remain censored as of December 2023. Five builders directly contribute to over 90% of the blocks on the Ethereum blockchain, of which four have chosen to edit transactions. Several operators have chosen to be more cautious, especially if they are US-based. Refusing to comply with the regulations could attract significant trouble for both the individuals and their businesses.\n\nSolana\n\nThe phrase “Ethereum killer” has been used for a while now to designate the coins and blockchains that have the potential to remove Ethereum from its throne. While ETH was never able to withstand the sheer force of Bitcoin and surpass it, it is nonetheless the second-largest cryptocurrency in the world. Unlike Bitcoin, Ethereum isn’t known just as a coin but also for the functionalities its blockchain introduced. The system pioneered the discovery and introduction of decentralized finance and apps, as well as non-fungible tokens and the play-to-earn concept.\n\nThis has made it very popular among tech lovers who follow the latest developments religiously. So, who are the supposed Ethereum killers that could replace it? The truth is that different investors and analysts will say different things, with each of them betting on a different coin and platform. However, Solana is probably the most widely discussed of all of them, mainly because it is much more visible and stable than the others.\n\nOne of its co-founders, Anatoly Yakovenko, recently dismissed these claims, saying that the dynamic between the two coins isn’t what it has been made out to be and that it is essential to continue incorporating efficient technologies. Many in the crypto community believe that a multi-chain future is inevitable. Rather than seeing competition as something negative, the outlook instead is to see it as part of the more extensive evolution parameters of the blockchains.\n\nIn fact, some have already begun discussing the existence and emergence of a Solana killer. It’s good for blockchains to collaborate and co-exist, as it shows the system’s potential to continue growing and evolving, as well as expanding to cover different business areas and niches apart from crypto trading.\n\nPrice predictions\n\n2024 is just around the corner, and investors are debating which outcome is the most likely when it comes to the coins they’re trading. There are several price prospects for Ethereum, and whether they’ll occur and when is bound to change due to the different influences that affect the crypto environment. The market trends point towards a bullish upswing set to occur sooner rather than later, and many investors have already started buying more to consolidate their portfolios and see more considerable gains when the prices rise.\n\nHowever, the economic factors and regulatory issues can act as setbacks. The price has been affected by macro factors, especially inflation and interest rates. Even if they didn’t directly cause prices to collapse, they nonetheless caused market stagnation, which affected holdings and caused considerable apprehension among investors. There’s also the possibility that Ethereum could surpass Bitcoin in terms of market capitalization, but that will largely depend on the network updates, as well as whether adoption rates continue to increase or not.\n\nTo sum up, many variables could influence how Ethereum will develop in the next year. That makes it impossible to predict the movements accurately. However, this has always been the case for blockchain currencies, and the investors who have been involved in the market for a few years are already familiar with these shifts. Make sure to carefully weigh your options before buying or selling to ensure you see gains and minimize losses."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1kZWxheXMtYmxhY2tyb2Nrcy1zcG90LWV0aGVyZXVtLWV0Zi1kZWNpc2lvbnMtYXJlLXN0aWxsLWR1ZS1pbi1tYXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC delays BlackRock's spot Ethereum ETF; decisions are still due in May - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) extended the decision period on BlackRock’s planned spot Ethereum ETF on Jan. 24.\n\nThat notice concerns a proposed rule change allowing Nasdaq to list and trade shares of the BlackRock iShares Ethereum Trust.\n\nPreviously, the SEC was required to approve, reject, or institute proceedings to approve or reject BlackRock’s proposal by Jan. 25, 2024. However, securities laws permit the agency to extend the decision period to March 10, 2024.\n\nThe SEC noted Nasdaq initially filed the proposed rule change on Nov. 21, 2023 and that the proposal was published for comment in the Federal Register on Dec. 11, 2023. The date of publication determines the deadlines described above.\n\nThe SEC added that it has not received any comments on BlackRock’s spot Ethereum ETF proposal. By contrast, BlackRock’s spot Bitcoin ETF proposal received about 15 comments within two months of its June 2023 filing.\n\nSEC still expected to make decision in May\n\nThe delay around BlackRock is not expected to affect broader Ethereum ETF proceedings. Bloomberg ETF analyst James Seyffart said today:\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. [The] next date that matters is May 23rd.”\n\nMay 23 is relevant as the SEC must approve or deny VanEck’s spot Ethereum ETF by that date without any possibility of further delays. The securities regulator will likely decide on other similar applications with different deadlines, including BlackRock’s, alongside VanEck’s application at that time.\n\nThe SEC similarly delayed proceedings around Fidelity’s spot Ethereum ETF this month. Once again, this will not impact the May decision deadline.\n\nThough it is required to make a decision by May 23, it is unclear whether the SEC will opt to approve the funds. FOX Business’ Eleanor Terrett has reported internal resistance at the SEC while suggesting that some ETF issuers are optimistic.\n\nPolymarket odds currently suggest a 54% chance of approval by May 31. Bloomberg ETF analyst Eric Balchunas predicts a 70% chance of approval."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1zb2xhbmEtaW1wcmVzc2l2ZS1wZXJmb3JtYW5jZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum and Solana's Impressive Recent Performance Revealed Across Multiple Metrics - CCN.com",
        "content": "Key Takeaways\n\nEthereum has notably eclipsed Bitcoin in terms of market dynamics.\n\nSolana has outperformed Ethereum and the broader altcoin market.\n\nThe altcoin market is in full swing, with the top 50 altcoins outperforming Bitcoin.\n\nAfter a tumultuous 2022, Solana emerged as a crypto powerhouse in 2023, eclipsing even Ethereum’s performance. But despite its recent correction, signs are pointing towards a potential surge in SOL’s price.\n\nGlassnode, a company specializing in on-chain analytics, has released an in-depth report exploring these distinct trends and their implications in the broader context of the cryptocurrency market.\n\nSolana Topping Ethereum in Daily Active Addresses\n\nSolana’s user base is expanding at an impressive rate, surpassing even Ethereum in terms of daily active addresses.\n\nAccording to Step Data Insight s, Solana is averaging over 400,000 daily active addresses, while Ethereum struggles to maintain even half of that number. This surge in user activity is a testament to Solana’s growing popularity and its potential to become a major force in the cryptocurrency landscape.\n\nSolana Daily Active Addresses continue to hover at ~400K, slightly above Ethereum. pic.twitter.com/82tnfPI1uD — Step Data Insights (@StepDataInsight) December 6, 2023\n\nIndicative of Solana’s robust network health are its NFT metrics. Step Data Insights revealed in subsequent tweets that the network’s weekly NFT trading volume has experienced an impressive 77% surge, reaching $45 million.\n\nSolana Weekly NFT Volume skyrockets 77% to $45M. pic.twitter.com/4hgDAydZHr — Step Data Insights (@StepDataInsight) December 6, 2023\n\nETH Surges 20% vs. BTC: Glassnode Report Highlights ETF Boom\n\nThe latest report from Glassnode’s “The Week Onchain,” authored by Alice Kohn, casts a spotlight on the remarkable performances of Ethereum (ETH) and Solana (SOL) in the cryptocurrency market, particularly following the approval of Bitcoin exchange-traded funds (ETFs).\n\nEthereum has notably eclipsed Bitcoin in terms of market dynamics, achieving its strongest showing since late 2022. Kohn’s research points to a significant increase of over 20% in Ethereum’s value compared to Bitcoin, a trend that aligns with a renewed surge in the Ethereum derivatives market.\n\nETH Resurgence Fuels ETF Speculation, SOL Defies Odds\n\nThe recent resurgence in Ethereum’s market performance, as highlighted in Glassnode’s report, suggests a potential shift in capital flows within the crypto market, sparking increased speculation about the possible introduction of a spot-based Ethereum ETF.\n\nDespite these positive developments, Ethereum still lags behind the broader altcoin market, underperforming by 17%. In contrast, Solana (SOL) has followed a distinct trajectory. According to the same Glassnode report , Solana experienced remarkable price growth last year, overcoming challenges related to its association with the troubled FTX. This divergence in the paths of Ethereum and Solana illustrates the varied dynamics at play in the altcoin market.\n\n@Solana 's December month-over-month NFT volume growth outpaced other ecosystems significantly: pic.twitter.com/wBr2n3itNU — Syndica ⛅️ (@Syndica_io) January 22, 2024\n\nIn striking contrast to Ethereum, Solana (SOL) has shown remarkable performance, with the SOL/BTC ratio soaring by 290% since October 2023. This divergence is particularly noteworthy as Solana’s price did not undergo a significant revaluation following the Bitcoin ETF approvals, unlike Ethereum, according to Kohn.\n\nOverall, the altcoin market has experienced substantial growth, witnessing a nearly 69% increase in market capitalization since the Blackrock Bitcoin ETF filing, highlighting a general uptrend in the altcoin sector, with Solana leading the way.\n\nAltcoin Season in Full Swing as Top 50 Coins Outperform BTC\n\nRecently, Altcoin Season Index signaled the start of an ‘altseason’. This trend continues with the top 50 altcoins surpassing Bitcoin’s performance over the last 90 days, as per the index.\n\nKohn pointed out that this uptrend is largely fueled by tokens associated with Ethereum scaling solutions like Optimism, Arbitrum, and Polygon. Additionally, the early part of 2023 saw tokens in staking and GameFi sectors also exceeding Bitcoin’s performance, highlighting a diverse risk preference among investors in various altcoin categories.\n\nKohn’s latest research underscored the significant impact of recent market events:\n\n“The approval of new Bitcoin ETFs has morphed into a classic ‘sell-the-news’ occurrence, stirring a volatile period in the crypto market.”\n\nGlassnode’s analysis reveals that Ethereum has come out on top in the short term, with investors achieving a multi-year peak in net realized profits. This trend indicates an increasing propensity among investors to participate in speculative activities, especially related to the potential launch of an ETH ETF and the rotation of capital.\n\nSolana’s Explosive Price Growth: A Sign of Ethereum’s Challenger?\n\nIn addition to a significant increase in its total value locked (TVL), Solana has also witnessed a staggering 800% surge in its price on a year-to-date basis. When compared to Ethereum, Solana has shown superior price growth; Ethereum’s year-to-date growth stands at just 94% . This contrast is also mirrored in the TVL charts, where Solana’s growth, although substantial, still falls behind Ethereum’s, which remains the world’s premier altcoin in terms of TVL. However, it’s important to note that relying solely on TVL as a metric can be misleading, as it may offer a false sense of accuracy and can be easily manipulated.\n\nIn the ring of blockchain, it's #Ethereum vs #Solana ! 🥊 🍒 #ETH : King of #DeFi & #NFTs 🏰\n\n🍒 #SOL : Speed demon with lower fees 🚀 Which blockchain has your vote for the future of crypto? Weigh in and explore our detailed comparison! 📖https://t.co/hxuJFG8JgK pic.twitter.com/f3295B1KMh — tastycrypto (@tastycrypto) January 23, 2024\n\nWhat truly sets Solana apart is its dynamic ecosystem, which is bustling with development activity on the blockchain and the creation of decentralized applications (dApps). It is often viewed as a faster, more cost-effective alternative to Ethereum, with an added advantage of superior user interface and experience. The extent of actual development and building on the blockchain is a key factor in increasing TVL, potentially propelling Solana to greater prominence in the crypto world."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1mb3JlY2FzdHMvaXMtZXRoZXJldW0tcmVhbGx5LWJlYXJpc2gtaW4tMjAyNC_SAVNodHRwczovL2ludmVzdGluZ2hhdmVuLmNvbS9jcnlwdG8tZm9yZWNhc3RzL2lzLWV0aGVyZXVtLXJlYWxseS1iZWFyaXNoLWluLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Is Ethereum Really Bearish In 2024? - Investing Haven",
        "content": "Crypto markets may have been volatile this week, triggered by a breakdown on Bitcoin’s chart and a retracement in Ethereum (not the start of an Ethereum’s crash is what we said). Consequently, the ‘Ethereum bearish‘ message is suddenly found everywhere which is in contrast to the sentiment and messaging two weeks ago.\n\nWhile some ‘pundits’ may come out to call for the end of Bitcoin’s bull market, similarly the end of Ethereum’s bull market, we have a different view.\n\nPreviously, we outlined why Ethereum could still reach $10,000 by 2025, though will probably reach the $3,000 – $4,000 region in 2024. We stand by this view.\n\nSome commentators have a different opinion, indicating that Ethereum could be a bearish asset in 2024, though such claims are largely unsubstantiated.\n\nThe problems with poor quality chart analysis\n\nThe issue with low-quality chart analysis is mainly with the timeframe. In the chart below, there are no structured price patterns and the content is short-term orientated. It’s basically impossible to make a reasoned analysis by looking at a single chart – especially an intraday one!\n\nYet the fallacies contained within the analysis are not apparent to viewers when reading the content. It’s also possible to take a different view on the same chart and draw an entirely different conclusion. Ideally, a lot of factors will converge to create a powerful signal (bullish or bearish).\n\nPractically all of the content regarding Ethereum on this Trading View blog is erroneous, indicating a drop to $700 for Ethereum. We find that highly unlikely and the charts simply don’t back it up, even amidst a declining overall market.\n\nDespite the majority of false claims, there is some sound analysis. This Ethereum technical prediction outlines that despite a bearish outlook in the near term, Ethereum has a strong potential for a bullish reversal in 2024.\n\nEthereum is not bearish in 2024\n\nThe fact of the matter is that Ethereum is not bearish at all in 2024, and that’s in spite of the Bitcoin retracement which we predicted in this altcoin season article. Our exact words were:\n\nArguably, before alt season 2024 will kick off, it might come with a drop in BTC. In a way, it makes sense that an explosive run starts with a drop. The market loves to mislead bulls, particularly at the start and end of bull markets\n\nWe predict an ETH price rise to $10,000 by 2025, and that’s based on sound chart analysis. Take a look at the daily chart.\n\nThe price to hit for this to occur is $3,525. After this, it would be a 3x to $10k. The weekly price chart indicates a similar price rise for ETH, with a rounded reversal bullish pattern.\n\nDon’t believe the headlines! Ethereum is unlikely to go to $700. And it’s likely to end 2024 at a high, possibly even an all-time high. After all, as we keep repeating, 2024 is a hidden crypto bull market in disguise, with a fake drop to fool investors.\n\nTo truly understand what the market is doing, we have a unique crypto investment newsletter dedicated to finding the best coins at the most optimal entry points. It was the first crypto-focused newsletter of its kind, created back in 2016, and has an impeccable track record for finding winners in any market.\n\nDisclaimer: This is not financial advice. Please consult with a licensed financial advisor prior to making any investments.\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JsYWNrcm9jay1kZWxheS1ldGhlci1ldGbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "BlackRock spot ether ETF decision delayed by SEC - Blockworks",
        "content": "\n\nThe Securities and Exchange Commission delayed a decision on BlackRock’s proposed spot ether ETF.\n\nThe delay pushes any decision on the proposed fund to March 10, according to an official release by the agency.\n\nThe delay was largely expected, with the SEC also delaying decisions on Fidelity’s proposed fund on Jan. 18.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,” Bloomberg Intelligence analyst James Seyffart said.\n\nLoading Tweet..\n\nThe decision comes just weeks after the SEC approved nearly a dozen spot bitcoin ETFs. Three commissioners — Hester Peirce, Mark Uyeda and Chair Gary Gensler — voted in favor of the ETFs.\n\nFollowing Grayscale’s legal victory in August, the SEC was compelled to reevaluate its application for a spot bitcoin ETF conversion. Despite this progress, the status of ether ETFs continues to be unclear.\n\nIn an interview on Tuesday, Peirce said that the SEC would “apply precedent” to any decisions on spot ether ETFs. She further noted that the agency doesn’t plan to repeat history and face another court case in order to approve such funds.\n\n“I’m not holding my breath,” Lara Crigger, editor-in-chief at VettaFi previously told Blockworks about ether ETF approval.\n\nHowever, Seyffart previously said that he was more bullish about the future of ether ETFs.\n\n“If [Gensler] goes after ETH, it’s not just going to be a lot of these industry players; it will also be the CFTC that he has to contend with, and it’s just not worth it,” he told On the Margin podcast.The delay was largely expected after the SEC also delayed Fidelity’s proposal\n\nIn his press release following bitcoin ETF approvals, Gensler noted that the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nZXRoLWV0aGVyZXVtLW5ldHdvcmstc2hhcmUtZmFsbHMtYWZ0ZXItY2VudHJhbGl6YXRpb24tZmVhcnMtcmFpc2Vk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Geth Ethereum network share falls 5% after fears raised of 'black swan event' - Cointelegraph",
        "content": "Ethereum execution client Geth has seen its market share fall after community members raised concerns over the network’s diversity, fearing Geth’s concentration could lead to a “black swan event.”\n\nOn Jan. 23, Geth’s market share of the Ethereum network execution clients fell 5.2% to 78.8% after reaching 84% the day prior.\n\nGeth is critical in handling transactions and executing smart contracts on Ethereum, but its preference among Ethereum validators has led to an imbalance in execution client diversity on Ethereum, sparking centralization concerns.\n\nPercentage share of Ethereum network execution clients. Source: Clientdiversity.org\n\nEthereum decentralization advocates, including the founding member of the ETHStaker community, known as “Superphiz,” stressed in a Jan. 24 post on X (formerly Twitter) that a bug in Geth could lead to a more than 80% wipeout of Ether (ETH) staked on the network.\n\n“I’m not trying to convince you that every execution client is as robust or as mature as Geth. I’m just telling you that it’s a good idea to use less robust clients to prevent a black swan event,” he explained in another post.\n\nLachlan Feeney, founder and CEO of Ethereum infrastructure firm Labrys, suggested in a Jan. 23 blog post that Ethereum validators could risk losing everything.\n\n“Staked ETH is not risk-free yield. Would you invest a minimum of $75,000 USD into an instrument where the maximum potential gain is 3.5% p.a. but the potential for loss is 100%?”\n\n“Probably not, but this is what 84% of the Ethereum stakers are doing today,” Feeney added.\n\nAs Geth’s current share exceeds 2/3rds (or 66%), Feeney said a critical bug would “instantly stop the chain from finalizing.”\n\nIn that scenario, Geth validators that go offline would be subject to an “inactivity leak,” which results in the burning of their staked Ether until the execution recalibrates to a 1/3rd (or 33.3%) share of the network.\n\nFeeney said 90% of a validator’s staked Ether could be wiped within roughly 40 days.\n\n“Comparatively, a validator taken offline due to a minority client bug that does not stop the chain from finalizing would lose just 0.4% of its stake in 40 days.”\n\nHowever, Feeney told Cointelegraph there would be a “very small window” for validators to exit and limit their losses, as there is a rate-limited queue for how many validators can exit per epoch.\n\nRelated: Ethereum devs expect 10x lower rollup costs as Dencun upgrade hits testnets\n\nNethermind, the second-largest execution client, increased its share from around 8% to 14% on Jan. 23.\n\nNethermind’s increased uptake came despite it identifying and fixing a critical bug in several versions of its execution client that caused users to fail to process blocks on Ethereum two days earlier.\n\nCoinbase, one of the largest Ethereum validators running on Geth, announced its plan to transition to a multi-client infrastructure in the coming months.\n\nThe exchange explained Geth was the only Ethereum execution client that met its technical requirements since it started Ethereum staking in 2020.\n\n“However, the tide is turning,” said Coinbase.\n\nMagazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1ldGYtbGV0LWFtZXJpY2Fucy1kZWNpZGUtc2VjLWNvbW1pc3Npb25lci11cmdlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF: \"Let Americans Decide\" SEC Commissioner Urges - DailyCoin",
        "content": "SEC Commission Hester Peirce expects an improved consideration process for Ethereum ETFs.\n\nHester Peirce expressed frustration with the “Circus-like” Bitcoin ETFs approval process.\n\nIndustry experts have shared differing opinions on the likely timeline of approval.\n\nEthereum ETFs have recently become a hot topic following the historic approval of Bitcoin ETFs by the U.S. Securities and Exchange Commission (SEC). Despite SEC Chair Gensler’s assertion that the Bitcoin ETF approval does not signify the embrace of crypto assets, investors are optimistic about the approval setting a precedent substantial enough to impact its consideration of spot Ethereum ETFs.\n\nAs the industry anticipates the potential outcome, “crypto mom” Hester Peirce, renowned for her liberty-focused approach to the industry, has offered insights into the commission’s decision-making process.\n\nEthereum ETF Won’t Get ‘Circus-Like’ Approach\n\nSEC Commissioner Hester Peirce has expressed optimism about a balanced decision-making process for Ethereum ETF, asserting that the regulatory commission is unlikely to adhere strictly to its traditional stringent approach.\n\nPeirce emphasized that the “circus-like” consideration process witnessed for Bitcoin ETFs, characterized by legal battles, extensive delays, and security breaches, will not reoccur in the case of Ethereum ETFs.\n\n“We shouldn’t need a court to tell us that our approach is arbitrary and capricious in order for us to get it right,” she stated in an interview with Zack Guzman.\n\nReflecting on her past frustrations with the delays in approving Bitcoin ETFs, Peirce underscored the importance of providing choices to investors in the spirit of liberty and asserted the need for clear thinking and consideration in enforcing regulations on the industry.\n\n“There are lots of things that we can draw on, and I hope that we draw in more than just our general skepticism of anything that touches on crypto, which seems to be how we've approached a lot of these problems in the past,” she emphasized.\n\nHester Peirce’s sentiments align with industry predictions on the likelihood of an approval.\n\nEthereum ETF: Approval or Not?\n\nBusiness journalist Eleanor Terrett has shared varying perspectives on whether the SEC will approve Ethereum ETFs and when the regulatory decision is expected.\n\nTerret stated that there is prevailing optimism among issuers and analysts, forecasting the approval and launch of Bitcoin ETFs to influence the SEC’s decision-making process regarding Ethereum ETFs positively.\n\nReporting on the timeline for a potential $ETH ETF approval has turned up a plethora of different takes from ETF issuers, investment management firms and sources close to the @SECGov.\n\n\n\n✨One $BTC Spot ETF issuer with an ETH Spot ETF application says they’re confident the… — Eleanor Terrett (@EleanorTerrett) January 23, 2024\n\nContrasting opinions, however, challenge the optimism. Other predictions suggest a “hard no” within the regulatory commission, indicating internal resistance to endorsing the ETFs.\n\nETF analyst James Seyffart anticipates a 5-month consideration process for the SEC and has predicted May as a plausible timeframe for the commission’s verdict.\n\nOn the Flipside\n\nWhile Hester Peirce’s comments express optimism for Ethereum ETFs, they do not guarantee the SEC’s approval.\n\nThe SEC recently extended its decision deadline for Fidelity’s Ethereum ETF application by 45 days.\n\nBlackRock CEO Larry Fink is bullish on the potential of Ethereum, further fueling expectations for an imminent ETF approval.\n\nWhy This Matters\n\nDespite varying forecasts on the fate of Ethereum ETFs, the final decision lies with the SEC. Given the unpredictability of the outcome, it is important to maintain balanced expectations to avoid overestimation or disappointment.\n\nFind out more about the SEC hack prior to Bitcoin ETF approval:\n\nSEC Claims ‘SIM Swap’ Attack Behind X Account Breach\n\n\n\nDiscover how to stay safe from SIM swap attacks:\n\nHow to Prevent a SIM Swap Attack as SEC Falls Prey"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWV0aGVyZXVtLWV0Zi1hcHByb3ZhbC1sYXdzdWl0LXNlYy1oZXN0ZXItcGVpcmNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETFs won't need a lawsuit to be approved — Crypto Mom - Cointelegraph",
        "content": "A lawsuit won’t be necessary to convince the United States Securities and Exchange Commission to approve spot Ether (ETH) exchange-traded fund (ETF) applications, says SEC Commissioner Hester “Crypto Mom” Peirce.\n\n“We shouldn’t need a court to tell us that our approach is ‘arbitrary and capricious’ in order for us to get it right,” said Peirce in a Jan. 24 interview with Coinage Media, harking back to the Grayscale court ruling that preceded the approval of spot Bitcoin ETFs in the United States.\n\n“That’s not how we’re going to do our approvals,” Peirce added.\n\nPeirce — known as “Crypto Mom” for her comparatively sympathetic stance toward crypto — said the SEC would presumably apply the same precedent from Grayscale; however, she acknowledged that the facts and circumstances vary immensely with each ETF application.\n\n“There’s a lot of work that goes into getting an exchange-traded product ready for market, including making sure that the disclosures are lining up with how the product actually works,” Peirce said.\n\n“Having heard from a court that the approach we were taking was wrong [...] I think that kind of a lesson will certainly stick with us.”\n\nBlackRock, VanEck, ARK 21Shares, Fidelity, Invesco Galaxy, Grayscale and Hashdex are among the spot Ether ETF applicants vying for SEC approval.\n\nRelated: Impact of Bitcoin ETFs: ‘Revolutionary change’ or colossal ‘dud’?\n\nSenior Bloomberg ETF analyst Eric Balchunas pegged the chances of a spot Ether ETF approval at 70% by May.\n\nThe SEC must decide on VanEck’s application by May 23, ARK 21Shares by May 24, Hashdex by May 30, Grayscale by June 18 and Invesco by July 5.\n\nFidelity and BlackRock’s applications must be decided by Aug. 3 and Aug. 7.\n\nBalchunas recently told Cointelegraph that it seems likely that Ether ETFs now have a straight shot at approval, adding that it was difficult to imagine a scenario where spot Bitcoin ETFs are approved while spot Ether ETFs are not.\n\n“The Ether spot is tied to the hip of Bitcoin spot for sure. It’s gonna go wherever it goes. It’s basically like on a 15-foot rope following it.”\n\nHowever, other industry pundits are less optimistic.\n\nMorgan Creek Capital’s CEO Mark Yusko predicts a less than 50% chance of an approved spot Ether ETF, arguing that the SEC remains broadly hostile toward the crypto industry.\n\nSEC Chair Gary Gensler also stressed in a Jan. 11 letter that approving a spot Bitcoin ETF wouldn’t lead to a mass approval of other cryptocurrency ETF applications.\n\n“[The spot Bitcoin ETF approval] should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities,” Gensler wrote, adding:\n\n“As I’ve said in the past, and without prejudging any one crypto asset, the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws.”\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLWV0aC0xNC1wcmljZS1kcm9wLW92ZXJzaGFkb3dzLWltcHJvdmVtZW50cy1pbi1pbnZlc3Rvci1pbnRlcmVzdC1yZXBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's (ETH) 14% price drop overshadows improvements in investor interest: Report - Cointelegraph",
        "content": "The price of Ether (ETH) rallied 77% in the lead-up to the approval of spot Bitcoin exchange-traded funds (ETFs) in the United States, setting a year-to-date high at $2,715. But in the weeks since, ETH price has turned soft alongside the rest of the market.\n\nThe latest data from on-chain analytics firm Glassnode shows that despite the current downturn, Ether has outperformed Bitcoin (BTC) in multiple areas.\n\nETH eclipses BTC\n\nGlassnode’s latest “The Week Onchain” report highlights ETH’s outperformance of Bitcoin “on a quarterly, monthly, and weekly basis.”\n\nAnalyst Alice Kohn points to a significant surge of over 20% in Ether’s value against Bitcoin, a trend that aligns with similar activity in the ETH derivatives market.\n\nETH/BTC ratio price performance. Source: Glassnode\n\nGlassnode notes that this performance coincides with a rebound in ETH’s market dominance. According to the chart below, ETH has gained 2.9% in market cap dominance compared with Bitcoin since the spot BTC ETF approval.\n\nETH vs. BTC market cap dominance. Source: Glassnode\n\nPositive market sentiment reflected in ETH’s net unrealized profit/loss metric\n\nEther may be trading 14% lower over the last week, but market sentiment around the cryptocurrency remains positive. This is evidenced by the volume of net profits locked in by ETH investors, which has reached a new multiyear high, signaling significant changes in investor profitability.\n\nKohn said:\n\n“While profits taking has increased since mid-October, the peak on 13-Jan reached over $900M/day, aligned with investors capitalising on the ‘sell-the-news’ momentum.”\n\nPerhaps the most significant indicator supporting Ether’s positive sentiment is the net unrealized profit/loss (NUPL) metric for short-term tokenholders.\n\nNUPL gauges the potential profit or loss of investors holding an asset based on the price at which they acquired their coins.\n\nThis metric has crossed above 0.25 for the first time since the November 2021 all-time high, indicating increasing optimism among holders.\n\nEthereum short-term holder NUPL. Source: Glassnode\n\nAccording to Kohn, this could mean either a level of positive market sentiment is “creeping in for ETH” or that “markets tend to take a pause and digest profit taking distribution pressure.”\n\nRelated: Socket protocol recovers two-thirds of stolen ETH from hack\n\nExpressing this optimism, trader Ken spotted a “manual stop,” saying that the ETH/BTC confluence was nearing a breakout with Ether’s price above $2,240.\n\n$ETH\n\n\n\nlong from 2240 retest, aiming for the liquidity at 2500\n\n\n\nETH/BTC confluence as it's nearing breakout retest\n\n\n\nmanual stop for now, same as BTC pic.twitter.com/DxWt4aYxZa — Ken (@KenCharts) January 24, 2024\n\nETH displays dominance in the derivatives market\n\nThe recent resurgence in Ether’s market performance, as highlighted in Glassnode’s report, suggests a potential shift in capital flows within the crypto market. A closer look at derivatives data reveals that Bitcoin’s perpetual swaps accounted for 55% of open interest in January 2022, which has since risen to 66.2%.\n\nIn comparison, “ETH open interest dominance decreased from 45% to 33.8% between 2022 and 2024,” according to Glassnode.\n\nBTC vs. ETH perpetual open interest dominance. Source: Glassnode\n\nHowever, ETH regained some market share, with its dominance rebounding to approximately 40% by this metric following the ETF approval.\n\nEther’s recent market performance has sparked increased speculation among investors about the possible introduction of a spot Ether ETF.\n\nAccording to Yield App chief investment officer Lucas Kiely, now that there is clarity after the Bitcoin ETFs — along with seven deadlines between May and August — Ether ETFs may come sooner than expected.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1hdHRlbXB0cy10by1yZWNvdmVyLTE0MDQ1NTnSAVhodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tYXR0ZW1wdHMtdG8tcmVjb3Zlci8xNDA0NTU5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Attempts to Recover - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zcG90LWV0aGVyZXVtLWV0ZnMtd29udC1uZWVkLWxhd3N1aXQtaGVzdGVyLXBlaXJjZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETFs Won't Need a Lawsuit, Says Hester Peirce, But What Will They Need? - CCN.com",
        "content": "Key Takeaways\n\nHester Peirce believes that spot Ether ETFs will not require legal action to be approved.\n\nSeveral major players are vying for SEC approval for their spot Ether ETF applications.\n\nThere are mixed expectations for spot Ether ETF approval, with some experts optimistic and others cautious.\n\nAccording to SEC Commissioner Hester “Crypto Mom” Peirce, legal action won’t be necessary to persuade the United States Securities and Exchange Commission (SEC) to greenlight applications for spot Ether ETFs.\n\nShe emphasized that the regulator has taken lessons from its past errors, suggesting that the introduction of these products might proceed more seamlessly.\n\nPeirce Notes Nuances In Judging Each Ether ETF Application\n\nPeirce referenced the Grayscale court ruling, which set a precedent for the approval of spot Bitcoin ETFs in the U.S., stating:\n\n“We shouldn’t need a court to tell us that our approach is ‘arbitrary and capricious’ in order for us to get it right.”\n\nHester Peirce, often referred to as “Crypto Mom” due to her relatively favorable view towards cryptocurrencies, mentioned that the SEC is likely to use the same precedent set by the Grayscale case in future considerations.\n\nHowever, she recognized that the specifics and context can differ greatly with each ETF application, indicating a nuanced approach to each case.\n\nShe commented :\n\n“There’s a lot of work that goes into getting an exchange-traded product ready for market, including making sure that the disclosures are lining up with how the product actually works. Having heard from a court that the approach we were taking was wrong […] I think that kind of a lesson will certainly stick with us.”\n\nBlackRock, VanEck, ARK 21Shares, Fidelity, Invesco Galaxy, Grayscale, and Hashdex are among the key players seeking SEC approval for their spot Ether ETF applications. Eric Balchunas, a Senior ETF analyst at Bloomberg, recently estimated a 70% chance of approval for a spot Ether ETF by May.\n\nEthereum ETFs: Anticipation Builds As Deadlines Approach\n\nThe SEC has specific deadlines for deciding on these applications. VanEck’s application is due by May 23, followed by ARK 21Shares on May 24, Hashdex by May 30, Grayscale by June 18, and Invesco’s decision is due by July 5. Meanwhile, the applications from Fidelity and BlackRock are slated for decisions by August 3 and August 7, respectively.\n\nNew deadline to obsess over just dropped May 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nBalchunas expressed a strong likelihood of Ether ETFs receiving approval, especially in the wake of spot Bitcoin ETFs being approved. He finds it hard to envision a scenario where Ether ETFs wouldn’t be approved given the precedent set by Bitcoin ETFs.\n\nHe stated :\n\n“The Ether spot is tied to the hip of Bitcoin spot for sure. It’s gonna go wherever it goes. It’s basically like on a 15-foot rope following it.”\n\nExperts Divided on SEC’s Spot Ether ETF Outlook\n\nDespite the optimistic outlook from some, not all industry experts share the same sentiment regarding the approval of spot Ether ETFs. Mark Yusko, the CEO of Morgan Creek Capital, is less hopeful , estimating the chances of approval at below 50%. He commented that the SEC maintains a generally adversarial stance towards the crypto industry, which could impact the approval process.\n\nAnd how likely is the approval of a Spot Ethereum ETF by year's end? 🤔 Find out in our latest interview with Mark Yusko, Founder, CEO & CIO of Morgan Creek Capital. 💬\n\nClick the link below and dive into the game-changing world of Spot Bitcoin ETF approval – from market dynamics… pic.twitter.com/yjPnrVLKl9 — Cindy (@Natasha1s2K4) January 17, 2024\n\nThis perspective is somewhat echoed by SEC Chair Gary Gensler, who emphasized in a letter dated January 11 that the approval of a spot Bitcoin ETF should not be interpreted as a blanket endorsement for other cryptocurrency ETF applications.\n\nGensler specifically stated :\n\n“[The spot Bitcoin ETF approval] should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nThis comment suggests a cautious and case-by-case approach to the approval of cryptocurrency-related products by the SEC.\n\nHe commented :\n\n“As I’ve said in the past, and without prejudging any one crypto asset, the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws.”\n\nBitcoin ETF Approval Opens Doors for Ethereum’s Spot ETF Bid\n\nThe fact is, while BTC is primarily seen as a store of value, ETH serves as a functional currency, facilitating transactions on its highly composable chain. Despite their operational differences, ETH’s spot ETF approval remains a possibility. The growing liquidity crunch in global markets is being addressed by institutional demand for cryptocurrencies like Bitcoin, which is moving into wallets.\n\nThe debate over ETH’s security status becomes irrelevant once it transforms into an ETF, similar to many existing commodity ETFs. With BTC’s ETF approval, cryptocurrency has entered TradFi and is poised for institutional integration, paving the way for broader acceptance and potential approval of a spot ETH ETF."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8yMTQxMzMvZG9uYWxkLXRydW1wLWV0aGVyZXVtLXdhbGxldC1taWxsaW9uLW1hZ2EtbWVtZS1jb2lu0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzIxNDEzMy9kb25hbGQtdHJ1bXAtZXRoZXJldW0td2FsbGV0LW1pbGxpb24tbWFnYS1tZW1lLWNvaW4_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump’s Ethereum Wallet Holds $1.1M in MAGA Meme Coin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYou never know when a huge pile of meme coins can turn into serious cash. Early Dogecoin (DOGE) investors know this well, as do Solana developers who received an airdrop of BONK. And the latest beneficiary of a meme coin glow-up is… former U.S. president Donald Trump?\n\nAn Ethereum wallet that blockchain analytics firm Arkham Intelligence previously tied to Trump, which holds a share of royalties from sales of the official Trump NFT collections, also holds over 579,000 MAGA (TRUMP) tokens. And a recent surge in price for the meme coins means that Trump’s holdings are valued at about $1.1 million as of this writing, as first reported by CoinDesk.\n\nThe TRUMP token has jumped 222% this week alone, per data from CoinGecko, and 689% over the past 14 days. Meme coins are famously volatile and can be driven by social media sentiment and real-world events, and Trump has racked up a pair of 2024 presidential primary wins in recent days as he attempts to win a second term in office.\n\nAD\n\nAD\n\nTrump’s wallet isn’t associated with the creation of the TRUMP token, and in many cases, meme coins inspired by celebrities and public figures aren’t created by the person in question. Instead, they’re often created anonymously in an effort to ride the wave of hype and FOMO.\n\nIn this case, Trump’s wallet was sent the sizable allotment of TRUMP tokens across multiple transactions in August and October 2023, per public blockchain data tracked by Etherscan. At the time of the largest transfer, on August 19, the 469,901 tokens received on that date were collectively worth approximately $5,670, per data from DexScreener.\n\nNow his stash of TRUMP tokens is valued at $1.1 million, making up the largest single holding in the Trump-affiliated wallet. Overall, it holds nearly $2.6 million worth of cryptocurrency as of this writing, including about $755,000 worth of Ethereum (ETH) and $731,000 worth of Wrapped Ethereum (WETH).\n\nIn December, the wallet dumped $2.4 million worth of ETH across a period of three weeks, following the launch of his third collection of NFTs minted on Ethereum scaling network Polygon. Only about half of the latest NFT collection has been minted so far, after the two previous collections both sold out.\n\nThe wallet was tied to Trump by Arkham last year following a financial disclosure notice from the former president, as the wallet receives royalties from the sale of his officially licensed NFTs.\n\nAD\n\nAD"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNC9hbmFseXN0LXNheXMtZXRoZXJldW0tbWFzc2l2ZS1idWxsaXNoLXJldmVyc2FsLXNpZ25hbC1mbGFzaGluZy11cGRhdGVzLWZvcmVjYXN0LW9uLWJpdGNvaW4tYW5kLW9uZS1sb3ctY2FwLWFsdGNvaW4v0gGYAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzI0L2FuYWx5c3Qtc2F5cy1ldGhlcmV1bS1tYXNzaXZlLWJ1bGxpc2gtcmV2ZXJzYWwtc2lnbmFsLWZsYXNoaW5nLXVwZGF0ZXMtZm9yZWNhc3Qtb24tYml0Y29pbi1hbmQtb25lLWxvdy1jYXAtYWx0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin - The Daily Hodl",
        "content": "A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC).\n\nTrader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks.\n\nAccording to the analyst, ETH/BTC is flashing a bullish divergence on the weekly chart, indicating that the pair may be gearing up for a move to the upside.\n\n“I personally believe that Ethereum is going to outperform Bitcoin in the upcoming period and it has started since the ETF (exchange-traded fund) approval.\n\nMassive weekly bullish divergence created, but facing crucial resistance at 0.06 BTC ($2,385).\n\nSome more consolidation and then we’re likely going up.”\n\nLooking at the trader’s chart, he seems to think that ETH/BTC will rally to as high as 0.13 BTC ($5,168) sometime this year.\n\nAt time of writing, ETH/BTC is worth 0.05596 BTC ($2,224).\n\nAs for Bitcoin itself, Van de Poppe thinks BTC may fall to around $38,000 before finding support.\n\n“Bitcoin is at the range low and is actually in the area to be accumulated.\n\nAdditionally, this also means that altcoins are in stages to be bought as those 20-40% dips are a great opportunity.”\n\nAt time of writing, Bitcoin is trading for $39,800.\n\nVan de Poppe is also keeping a close watch on the price action of blockchain data-aggregator Covalent (CQT). According to Van de Poppe, CQT is likely headed to its next support level at around $0.15 before igniting a strong surge.\n\n“One of the latest runners has been TIA (Celestia), but competitors are likely to pace up momentum too.\n\nCQT is one of them. Market capitalization is relatively low and correcting, just like the entire market.\n\nThis provides opportunities and I think CQT is one before it reaches $0.42.”\n\nAt time of writing, CQT is trading for $0.214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/PeachShutterStock/Spyro the Dragon"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yNC8wMS8zNjc1OTUyOS9leGNsdXNpdmUtc3BvdC1ldGhlcmV1bS1ldGYtY291bGQtdW5sb2NrLWZ1bGwtc2NhbGUtZ2xvYmFsLWFkb3B0aW9uLWV4cGVydHMtdGVsbC1iZW56aW5nYdIBLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zNjc1OTUyOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "EXCLUSIVE: Spot Ethereum ETF Could Unlock 'Full-Scale, Global Adoption,' Experts Tell Benzinga - Benzinga",
        "content": "Investors were initially curious about Spot Ethereum ETH/USD Exchange Traded Funds (ETFs). However, after the approval of Bitcoin BTC/USD ETFs, these have now captured their full attention.\n\nBenzinga gathered exclusive commentary from several experts to gauge the prospects for a spot Ethereum ETF approval this summer.\n\nWhat Is The Current Status Of Spot Ethereum ETFs?\n\nTom Staudt, president and COO of ARK Invest, recently expressed confidence in the progression of Ethereum ETFs.\n\nHe cited the maturing dialogue with regulators and the sophistication of conversations surrounding the ETF, saying, \"This is not the same place where we were on the timeline with Bitcoin at this stage.\"\n\nStaudt notes that potential issuers now possess greater legal, operational, and philosophical expertise, partly due to the successful approval of spot Bitcoin ETFs.\n\nBut skeptics warn of regulatory roadblocks and lingering doubts about Ethereum's classification as a security. At the heart of the debate lies, once again, the Securities and Exchange Commission.\n\nWill The SEC Play Ball?\n\nAnndy Lian, an intergovernmental blockchain advisor, tells Benzinga that the SEC should act in the \"best interest of the public and the crypto industry\" by making a \"timely and positive decision\" on Spot ETH ETFs.\n\nHis comments highlight the widespread anticipation surrounding the potential ETF's arrival, with both retail investors and institutional giants eager to gain exposure to the world's second-largest cryptocurrency.\n\nBut the SEC had to be \"dragged kicking and screaming\" to approve one spot cryptocurrency ETF, he adds, and there is no guarantee a second one would be any easier.\n\nRead Also: Russia, India Collaborate On Building Joint Digital Economy: BRICS Currency Soon?\n\nEthereum ETFs Could Spur \"Full-Scale, Global Adoption\"\n\nThe case for Ethereum is simple, according to Stijn Paumen, the founder of Helio.\n\nHe paints a vivid picture of a future transformed by Ethereum's mainstream adoption. The ETF approval would be a catalyst for \"full-scale, global adoption of cryptocurrency.\"\n\nEveryday purchases, from your morning coffee to online shopping sprees, could be made with a simple tap of your crypto wallet.\n\nHis infectious enthusiasm captures the transformative potential of blockchain technology and its ability to disrupt traditional financial systems.\n\nEven Bitcoiners Think It's Coming\n\nTerrence Yang, managing director at Swan Bitcoin, acknowledges the inevitability of an ETH ETF, albeit somewhat grudgingly.\n\nHe concedes that legal precedents and the SEC's recent Bitcoin approvals have tilted the scales in favor of Ethereum.\n\nIndeed, as Decrypt reported, analysts agree that Bitcoin's approval has set a precedent: Grayscale argued in court - and won - that the SEC could not approve a futures ETF and reject a spot ETF. Since futures Ethereum ETFs have already been approved, logic holds that a spot ETF would have to follow - as it did for Bitcoin.\n\nSo...When Ethereum ETF?\n\nChris Martin, head of research at Amberdata, a crypto data analytics firm, says an Ethereum ETF should come sooner rather than later.\n\nIssuers will face two major challenges at the SEC:\n\nThe SEC doesn't have the public pressure it did for the Bitcoin ETF which means, they can take their time and don't have to worry about passing all of the issuers at once The SEC is still pushing the security vs commodity stance without any clarity.\n\n\"Approving an Ethereum ETF may impact their current cases against Coinbase Inc COIN and Binance BNB/USD, and may push them closer to defining their stance on cryptocurrencies,\" he says.\n\nPrediction markets agree, with Polymarket rating the probability of an approval by May 31 only at 54%.\n\nShould the SEC grant its blessing, the implications for the financial landscape could be profound. Mass adoption may come a step closer after all.\n\nRead Next: Crypto Trader Loses $250,000 In January, Swears Off Leverage: I'm A 'Changed Man Now'\n\nPhoto: Shutterstock"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNC94cnAtbGVkZ2VyLW5vdy1jbG9zZXItdGhhbi1ldmVyLXRvLWV0aGVyZXVtLWNvbXBhdGliaWxpdHktYXMtc2Vjb25kLWF1ZGl0LW5lYXJzLWNvbXBsZXRpb24tZGV2ZWxvcGVycy_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMjQveHJwLWxlZGdlci1ub3ctY2xvc2VyLXRoYW4tZXZlci10by1ldGhlcmV1bS1jb21wYXRpYmlsaXR5LWFzLXNlY29uZC1hdWRpdC1uZWFycy1jb21wbGV0aW9uLWRldmVsb3BlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2RhbmtzaGFyZGluZy1hbmQtcHJvdG8tZGFua3NoYXJkaW5nLWV4cGxhaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Danksharding and proto-danksharding, explained - Cointelegraph",
        "content": "Danksharding vs. proto-danksharding Danksharding and proto-danksharding are critical components in upgrading the Ethereum consensus layer. These technologies aim to enhance Ethereum’s scalability and efficiency, particularly in the context of layer-2 rollup solutions. Danksharding is a layer-2 scaling solution designed to empower the world’s second most popular blockchain, Ethereum, to achieve its full potential. Proto-danksharding is an intermediate step in the danksharding roadmap. Proto-danksharding, approved as part of EIP-4844, has been officially incorporated into Ethereum improvement proposals within the Ethereum Cancun-Deneb upgrade. The upgrade was activated on the Goerli testnet on Jan. 17. As per Dencun’s testing schedule, the next significant phase is scheduled for Jan. 30, with the implementation on the Sepolia testnet. The Holesky testnet is set to follow on Feb 7. However, the Ethereum development team has not yet disclosed the mainnet implementation date for the upgrade. Danksharding Ethereum aims to make Ethereum layer-2 solutions, particularly rollups, as cost-effective and as fast as possible as the blockchain becomes more congested with users. Danksharding and proto-danksharding are core to the future of Ethereum scaling. Danksharding is one of Danksharding is one of the final stages of various long-term Ethereum network upgrades to maximize the network’s capacity. So far, core elements of this process have included major network shifts, including the staggered transition from proof-of-work consensus to proof-of-stake\n\nHow layer-2 solutions enhance blockchain efficiency and scalability Layer 2s boost and enhance the capabilities of base layer blockchains like Ethereum. For Ethereum, rollups have emerged as a viable and effective layer-2 solution. Layer-2 solutions refer to any secondary framework or protocol built on top of an existing blockchain that adds features that improve the scaling capabilities of the base chain. Layer 2 operates as separate off-chain networks from layer 1 base chains, where transactions are processed and then verified periodically on-chain. While base Ethereum can only process about 15 transactions per second, layer 2s can process thousands of transactions at low costs because of design choices within the periphery network that optimize the transaction processing capabilities of layer-2 solutions. Security and decentralization are still maintained because there is a process where the larger, decentralized base chain still validates transactions from the off-chain layer 2. Blockchain users can interact with a layer-2 front-end like Arbitrum, which processes transactions much more quickly and cheaply than Ethereum. Rollups are a form of layer-2 solution alongside channels, plasma, sidechains and validium. Rollup-based layer 2s like Arbitrum and Optimism dominate transactions among Ethereum layer 2s. Rollups execute transactions on a layer 2 before batching (rolling up) together the information they contain and sending this to the mainchain periodically for verification. This method enables the spread of fixed costs across multiple transactions, reducing costs arising from gas price volatility.\n\nEthereum scalability and the evolution of rollups In the pursuit of enhancing Ethereum’s scalability, a primary solution has emerged: Rollups. Rollups powered with technology like danksharding represent a robust effort to enhance Ethereum’s scalability, reduce transaction costs and maintain the network’s foundational principles of decentralization and security. Optimistic rollups and zero-knowledge rollups (ZK-rollups) are the two primary forms of rollups available. Optimistic rollups are currently the most popular form of Ethereum scalability solutions. They operate alongside the Ethereum blockchain and are composable, which is a critical advantage. Optimistic rollups are called “optimistic” because they assume the transactions they shift off-chain are valid. There is no on-chain proof of validity, and the ability to challenge transactions is built into optimistic rollups to maintain security. The challenge period of an optimistic rollup is the window when users may dispute a transaction they view as invalid. Within the window, they can challenge the validity of a transaction by submitting a fraud proof, which is a mechanism for demonstrating the invalidity of a particular transaction or batch of transactions. Both the sequencer — similar to a validator in layer 1s, which submits and orders a block of translation — and the disputer are required to post a bond. If a transaction is found to be invalid, the sequencer’s bond is slashed. If the fraud proof is found to be invalid and the transaction is valid, then the disputer’s bond will be forfeited. The other primary form of rollup is the ZK-rollup. Zero-knowledge rollups publish cryptographic proofs-of-validity for off-chain transactions. Operators of ZK-rollup chains submit validity proofs to the main chain that demonstrate with cryptographic certainty that the proposed changes to Ethereum’s state are due to a batch of valid transactions that were processed off-chain. Optimistic rollups are more popular than ZK-rollups because they can execute smart contracts. ZK-rollups, however, are mostly limited to simple transactions. Rollups execute transactions outside of Ethereum but, currently, inefficiently post transaction data to the mainnet as calldata. This process is set to be optimized by proto-danksharding and danksharding. Rollups execute transactions outside of Ethereum but, currently, inefficiently post transaction data to the mainnet as calldata. This process is set to be optimized by proto-danksharding and danksharding.\n\nDanksharding and proto-danksharding introduce data blobs to Ethereum The optimization of Ethereum’s rollup solutions relies on specific components of danksharding and proto-danksharding, such as data blobs and the KZG polynomial commitment scheme. These technological elements serve as the foundation for enhancing Ethereum’s rollup capabilities. Core to the layer-2 scaling danksharding implementation is the introduction of blobs. Blobs refer to large units of data that are designed to be part of Ethereum’s transactional structure. Rollups currently use calldata to store transaction data. Calldata is imperfect for rollups because data stored in it needs to be processed by all Ethereum nodes, and it is left on the blockchain permanently. This permanence is not always necessary for rollups since they typically only require the data for a limited time to validate and execute transactions. Proto-danksharding will introduce data blobs that can be attached to transaction blocks and will automatically delete in one to three months. Blobs are transactions carrying a 125-kilobyte “blob” payload stored on the Ethereum consensus layer, not the Ethereum Virtual Machine (EVM) like calldata. This method helps reduce the storage overhead and allows the data in rollup transactions to be sent more cheaply, enabling savings for end users (i.e., less gas fees). Proto-danksharding utilizes the KZG polynomial commitment scheme, which is named after the scheme’s three original authors (Kate, Zaverucha and Goldberg). KZG compresses data blobs into small cryptographic commitments. KZG uses a cryptographic technique that allows data stored within blobs to be validated without needing to process the entire blob directly and without revealing the full contents of the blob. This is compatible with the zero-knowledge design used by some layer-2 protocols, which will be used across Ethereum scaling at some stage. That said, danksharding is the full realization of rollups. While proto-danksharding allows rollup transactions to attach one blob to a block, danksharding will expand this to 64 blobs. Danksharding is set to create a huge amount of space for optimistic rollups to dump their compressed transaction data. Danksharding hopes to support an expanding rollup ecosystem and allow thousands of transactions per second.\n\nDanksharding and proto-danksharding challenge the blockchain trilemma For a blockchain, achieving a balance between scalability, decentralization and security is almost impossible. Optimized layer 2s help overcome this trilemma. The blockchain trilemma concept posits that it is extremely challenging for a blockchain network to achieve scalability, decentralization and security simultaneously. The term was coined by Ethereum’s co-founder, Vitalik Buterin, and in his view, blockchain platforms can only achieve two of these three goals effectively. Blockchains often need to find out-of-the-box ways to scale effectively and maintain blockchain transaction throughput without sacrificing security and decentralization. Unlike traditional financial networks, blockchains do not rely on third parties like banks to maintain a record and verify transaction ledgers. In a blockchain, this process is conducted by a decentralized network of independent computers called nodes. A more decentralized network with a larger group of nodes also contributes to security. The more nodes a blockchain has, the more theoretically secure it becomes. A potential attacker would need to invest more computational power to take over a larger network and conduct a 51% attack or network takeover. Security powered by higher decentralization directly affects the scalability of a network, as every transaction needs to be validated across a large number of nodes. This means that as the network becomes larger, more information needs to be processed by more participants. These issues have often emerged with larger blockchains like Bitcoin and Ethereum, where transactions for end users become expensive and slow during periods of network congestion because blockchain security models mandate a process that cannot be overridden. Ethereum protocol development has prioritized scaling to address these issues, especially given the substantial growth of the network.\n\nOptimized layer-2 solutions empower blockchains against centralized payment giants While blockchain systems may inherently struggle to match the transaction processing efficiency of centralized giants like Visa, layer-2 solutions, such as rollups, optimized by technology like danksharding, level the playing field. Centralized payment systems like Visa can process transactions at scale much more quickly because these networks are closed and don’t require shared consensus. Solutions like danksharding and proto-danksharding are designed to challenge the blockchain trilemma by sharding the blockchain. Layer-2-based off-chain transaction processing is built to enable an increase in Ethereum network capacity, and danksharding helps to optimize one of Ethereum’s core layer-2 solutions: rollups. While both danksharding and proto-danksharding contain the word sharding, neither follows the traditional blockchain sharding technology model, which aims to split up a blockchain into multiple parts. Ethereum shard chains are no longer part of the blockchain’s roadmap. Instead, danksharding uses distributed data sampling across blobs to scale Ethereum. This is much simpler to implement than the more advanced blockchain sharding techniques. This model has sometimes been referred to as “data-sharding.” Instead, danksharding uses distributed data sampling across blobs to scale Ethereum. This is much simpler to implement than the more advanced blockchain sharding techniques. This model has sometimes been referred to as “data-sharding.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tc2V0LWZvci1mdXJ0aGVyLWRlY2xpbmUtYXMtbXZydi1zaWduYWxzLWJlYXJpc2gtbW9tZW50dW0taGVyZXMtdGhlLWV4cGVjdGVkLWV0aC1wcmljZS1kaXAv0gGMAWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1zZXQtZm9yLWZ1cnRoZXItZGVjbGluZS1hcy1tdnJ2LXNpZ25hbHMtYmVhcmlzaC1tb21lbnR1bS1oZXJlcy10aGUtZXhwZWN0ZWQtZXRoLXByaWNlLWRpcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Set For Further Decline As MVRV Signals Bearish Momentum! Here’s The Expected ETH Price Dip - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nEthereum has seen a considerable decline in recent hours, following Bitcoin’s struggle to keep its momentum within the $38K-$40K mark. This situation has plunged Ethereum’s market dominance, as it finds difficulty in attracting buyers around its support levels. Currently, the market behavior hints at a further decline as a crucial on-chain metric shows selling opportunities. As a result, there’s a bearish threat for ETH price as it could record another dip in the coming hours.\n\nProfitable Addresses Look For Selling Opportunities\n\nRecently, Ethereum (ETH) witnessed a notable price fall from its peak of $2,400, now targeting the $2,100 level. This shift resulted in a wave of long position closures. According to Coinglass, Ethereum faced total liquidations over $77 million, with bullish traders contributing to approximately $70 million in liquidations, contrasted with about $7 million from bearish traders. This trend has established a stronger resistance near the $2,400 level due to continuous bearish pressure.\n\nYet, the potential for an even greater decline in ETH’s price looms, as a key on-chain metric suggests a correction. Data from IntoTheBlock shows that the Market Value to Realized Value (MVRV) ratio, an important indicator, points to a significant sell-off opportunity for Ethereum, particularly with its recent drop toward $2,100.\n\nCurrently, the MVRV ratio is at 1.49, suggesting that Ethereum’s market value significantly surpasses its realized value, or the value at the last transaction. This gap may lure traders to realize profits by selling their Ethereum holdings.\n\nAlso Read: Will Bitcoin Price Crash Again? Grayscale’s $335M Coinbase Transfer Sparks Concern\n\nThe ETH price tends to stabilize around a MVRV of 1.1, which could indicate a potential further decrease in its value. Meanwhile, the long/short ratio is showing signs of activity, trading at 1.1993, with 54.5% of positions anticipating a price increase and 45.5% predicting a drop.\n\nWhat’s Next For ETH Price?\n\nEfforts by bulls to push Ethereum past the $2,400 resistance were met with resistance, evident from a significant decline in the price chart. This led to a sharp crash in Ethereum’s price, falling below its moving averages and is now aiming to drop below $2,100. Currently, ETH is trading at $2,209, a 6.7% decrease from yesterday’s rate.\n\nEthereum’s price faces a significant test at $2,100 as it recently dropped below the ascending support line. However, buyers continue to defend the price and have quickly triggered a rebound above $2,200. Holding below this could strengthen bearish control, potentially bringing ETH down to the $2,000-$2,100 support area. However, a notable accumulation might be expected near that level.\n\nThe recent price behavior suggests ETH might fluctuate between $2,100 and $2,400 for quite some time. However, a break below $2,100 might send the price below the psychological level of $2K. On the other hand, a rebound and close above the EMA20 trend line might send the price toward $2,400 and then to $2,700."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1oYXMtYS1oYXJkLW5vLXN0YW5jZS1vbi1zcG90LWV0aGVyZXVtLWV0ZnMtYnV0LWlzc3VlcnMtYXJlLW9wdGltaXN0aWMtZm94LXJlcG9ydGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC has a 'hard no' stance on spot Ethereum ETFs, but issuers are optimistic: FOX reporter - CryptoSlate",
        "content": "FOX Business reporter Eleanor Terrett reported a wide range of expectations regarding spot Ethereum ETF approvals on Jan. 23.\n\nNotably, Terrett suggested that the U.S. Securities and Exchange Commission (SEC) is opposed to approving a spot Ethereum ETF. She said:\n\n“Another source tells me the line at the SEC at this very moment is a ‘hard no’ and there’s currently ‘some internal resistance’ to the idea.”\n\nTerrett did not state whether that source is a member of the SEC itself or a member of an asset manager seeking approval from the SEC.\n\nTerrett also noted that SEC commissioner Hester Peirce, known for her pro-cryptocurrency stances, has advocated for a more straightforward decision process. The SEC in part approved spot Bitcoin ETFs because one applicant, Grayscale, obtained a legal victory, as SEC chair Gary Gensler explained in a statement. Peirce criticized that approach in an interview with crypto news platform Coinage today, as she said that ETF approvals should involve “regular way consideration” rather than court cases compelling action.\n\nTerrett concluded that further indications of the SEC’s stance will emerge in the coming months as it becomes clear whether it engages with S-1 registration statements. The SEC typically posts notices of meetings with asset managers and exchanges on each ETF’s page as they occur.\n\nAsset managers appear to be optimistic\n\nDespite resistance within the SEC, Terrett suggested that the asset managers responsible for issuing each fund are optimistic about approval.\n\nAccording to Terrett:\n\n“[One] issuer with an ETH Spot ETF application says they’re confident the approval and smooth launch of the Bitcoin spots will compel the [SEC] to approve ETH spot ETFs.”\n\nAnother unnamed issuer said that they expect a spot Ethereum ETF to launch by the end of the summer because of the SEC’s earlier approval of Ethereum futures ETFs, and because of BlackRock’s strong ETF approval record.\n\nThat source also cited the CFTC comments suggesting Ethereum is a commodity, as well as Ripple’s partial legal victory against the SEC, as factors that could more broadly prevent the SEC from labeling crypto assets as securities. However, it is not clear that those developments will directly impact spot Ethereum ETF approvals in the coming months.\n\nPublic expectations around approval vary. Bloomberg ETF analyst Eric Balchunas posits a 70% chance that an spot Ethereum ETF will be approved in May, while JP Morgan executive Nikolaos Panigirtzoglou has predicted a 50% chance of approval. Polymarket odds suggest a 53% chance of approval."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9jb2luYmFzZS1jZW8tcmVhY3RzLXRvLWV0aGVyZXVtLXN0YWtpbmctbWFqb3ItaXNzdWUtZGV0YWlsc9IBT2h0dHBzOi8vdS50b2RheS9jb2luYmFzZS1jZW8tcmVhY3RzLXRvLWV0aGVyZXVtLXN0YWtpbmctbWFqb3ItaXNzdWUtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Coinbase CEO Reacts to Ethereum Staking Major Issue: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA staking client is software that interacts with the network to validate transactions and propose new blocks. When staking cryptocurrency, users' funds are effectively locked in a smart contract and used to perform these network functions in return for rewards. The architecture of these clients is crucial for security and network stability.\n\nAdvertisement\n\nSingle-client setups, mentioned in the post criticizing Coinbase's staking methods, can be more vulnerable to network-wide outages or consensus bugs. If most network participants are using the same client and a bug is discovered in that client, it could lead to a large portion of the network going offline or agreeing to incorrect state transitions.\n\ndear @coinbase\n\n\n\ntoday, i unstaked all of the ETH i had staked with you since the first day you offered it as a service. i kept it there to earn passive yield, but also to support your work for the crypto industry (which i greatly value)\n\n\n\nbut i can't ignore the risks of what… — DCinvestor (@iamDCinvestor) January 22, 2024\n\nThis happened in November 2020 with Ethereum's Geth client, where a bug led to a chain split. A multi-client approach, where the network is supported by different software clients, is considered a best practice as it helps to prevent any single point of failure.\n\nImportance of multi-client staking environments\n\nIn a staking environment, nodes run clients to participate in blockchain consensus. A single-client staking setup refers to a situation where all, or the majority of, nodes run the same client software. This poses a systemic risk to the network:\n\nConsensus bugs: If a consensus bug appears in the single client, it could lead to a significant portion of the network failing or splitting into different forks, as all nodes would be affected simultaneously.\n\nCentralization risk: A single-client setup can lead to centralization, where the development and maintenance of the network are dependent on a single team or company.\n\nSecurity weaknesses: Homogeneity in clients can lead to uniform security vulnerabilities that could be exploited network-wide.\n\nTransitioning to a multi-client environment diversifies these risks by ensuring that no single bug or exploit can affect the entire network, improving the resilience and stability of the network."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMjQvdGhlLXByb3RvY29sLWV0aGVyZXVtLWRldmVsb3BlcnMtd2Fybi1vbi1kaXZlcnNpdHktcHJvYmxlbS_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDI0LzAxLzI0L3RoZS1wcm90b2NvbC1ldGhlcmV1bS1kZXZlbG9wZXJzLXdhcm4tb24tZGl2ZXJzaXR5LXByb2JsZW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Ethereum Developers Warn on 'Diversity Problem' - CoinDesk",
        "content": "ETHEREUM'S DIVERSITY PROBLEM. In the blockchain tech context, \"client diversity\" refers to the goal of having multiple software programs – known as \"clients\" – available for node operators and validators to access networks; as the thinking goes, if one of these clients goes down, due to a bug or some other mishap, there are plenty of other clients that would remain largely unaffected, preserving the blockchain's uptime. Ethereum's problem , based on a debate that erupted on the social-media platform X over the past few days, is that it's heavily reliant on the client software Geth, which powers around 85% of the blockchain's validators . As our Sam Kessler reported this week , a bug on the \"minority\" client software Nethermind, which powers around 8% of the validators that operate Ethereum, knocked out a chunk of those operators on Sunday. Since the share was relatively small, the blockchain kept running as designed. But some experts took the opportunity to point out how bad things could have gotten if Geth had gone out. Cygaar, a crypto educator, noted in an X post that \"Ethereum has terrible client diversity,\" adding that, \"A critical issue in Geth can lead to potentially millions of ETH being destroyed from validators running Geth.\" DCinvestor, a pseudonymous crypto investor with a large social media following, claimed in an X post that they were pulling their staked funds from Coinbase until the company switches its validator operations to a system that relies less on the Geth client: \"I can't ignore the risks.\" Per the website, ClientDiversity.org , which billboards the mantra, \"Diversify Now,\" the goal is for no individual client software to have more than a 33% market share."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZGFpbHljb2luLmNvbS9wcmVzcy1yZWxlYXNlcy9wb2x5Z29uLW1heS1zdHJ1Z2dsZS10by1tYXRjaC10aGUtc3VyZ2Utb2YtcmV0aWstZmluYW5jZS1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Polygon May Struggle To Match the Surge of Retik Finance and Ethereum - DailyCoin",
        "content": "Retik Finance and Ethereum as these platforms make significant strides in the decentralized finance (DeFi) space. While Retik Finance showcases rapid fundraising success and innovative features, Ethereum remains a stalwart with its imminent 2.0 upgrade. Amidst these surges, Polygon, known for its commitment to scalability and interoperability, faces challenges in keeping pace. Lets explore the unique strengths of Retik Finance and Ethereum, analyzing the potential obstacles that Polygon might encounter in the fast-evolving world of cryptocurrencies.\n\nRetik Finance (RETIK)\n\nRetik Finance has swiftly carved its niche in the DeFi sector, introducing a range of innovative features that redefine global transactions. With Futuristic DeFi Debit Cards, Smart Crypto Payment Gateways, AI-Powered Peer-to-Peer (P2P) Lending, and a Multi-Chain Non-Custodial Highly Secured DeFi Wallet, Retik Finance offers a comprehensive approach to financial solutions. The project’s ability to raise $1 million in just nine days and nearly $6 million in less than a month underscores its rapid momentum and robust community support. Retik Finance has raised over $8.34 million in total.\n\nEthereum (ETH)\n\nEthereum, a pioneer in smart contracts and decentralized applications (DApps), remains a cornerstone of the cryptocurrency industry. With its imminent Ethereum 2.0 upgrade, designed to address scalability concerns and enhance sustainability through a proof-of-stake consensus mechanism, Ethereum continues to set the standard. The platform’s thriving ecosystem, diverse range of DApps, and widespread adoption contribute to its enduring influence.\n\nChallenges for Polygon in the Face of Retik Finance and Ethereum’s Momentum\n\nCompetition in DeFi Innovation: Retik Finance’s introduction of novel DeFi features, including privacy-centric solutions and rapid fundraising success, intensifies the competition in the DeFi space. Polygon may find it challenging to match the uniqueness and momentum Retik Finance brings to the table.\n\nEthereum’s Dominance: Ethereum’s established reputation and ongoing upgrades, particularly the imminent Ethereum 2.0, pose challenges for Polygon. As Ethereum addresses scalability concerns, Polygon may need to strategically position itself to stand out in a market where Ethereum remains a dominant force.\n\nRapid Fundraising Success of Retik Finance: Retik Finance’s ability to swiftly raise substantial funds reflects community trust and interest. Polygon may face challenges in capturing the same level of attention, especially as Retik Finance introduces innovative features that resonate with the evolving demands of the crypto community.\n\nPrivacy-Centric Approach of Retik Finance: Retik Finance’s emphasis on user privacy, offering anonymous transactions without the need for Know Your Customer (KYC) procedures, adds a unique dimension. Polygon may need to explore avenues to differentiate itself in terms of user privacy and security.\n\nForming strategic partnerships within the crypto space can enhance Polygon’s visibility and credibility. Collaborating with projects that align with Polygon’s values and goals can contribute to its growth. As Retik Finance and Ethereum lead the charge in the cryptocurrency landscape, Polygon faces challenges in maintaining a comparable level of momentum. The competition in DeFi innovation, Ethereum’s enduring dominance, and the rapid success of Retik Finance present hurdles for Polygon to navigate.However, by strategically positioning itself, emphasizing unique features, fostering community engagement, and exploring strategic partnerships, Polygon can navigate these challenges and contribute to the diverse and dynamic ecosystem of blockchain solutions. The coming months will be pivotal for Polygon as it adapts to the evolving dynamics of the cryptocurrency market.\n\nAbout Retik Finance\n\nRetik Finance (RETIK) is a cutting-edge decentralized finance (DeFi) project revolutionizing global transactions with its innovative suite of financial solutions. Introducing futuristic DeFi Debit Cards, a Smart Crypto Payment Gateway, AI-powered Peer-to-Peer (P2P) lending, and a Multi-Chain Non-Custodial Highly Secured DeFi Wallet.\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1wcmljZS1mYWxscy1hbm90aGVyLTQtYnV0LWJpdGNvaW4tbWluZXRyaXgtaWNvLW5lYXJzLTEwLW1pbGxpb24tbWlsZXN0b25lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Falls Another 4% But Bitcoin Minetrix ICO Nears $10 Million Milestone - CryptoPotato",
        "content": "Ethereum (ETH) has seen another leg down over the past 24 hours, shedding 4% of its value as the bears maintain control of the market.\n\nETH now trades around $2,230 – 17% below its local high of $2,710 set on January 12.\n\nHowever, while Ethereum struggles, the Bitcoin Minetrix (BTCMTX) presale continues gaining momentum and has now raised a staggering $9.1 million in funding.\n\nEthereum Extends Losses as Selling Pressure Mounts\n\nETH has closed in the red for four straight days, dropping below the 50-day exponential moving average (EMA) in that time frame.\n\nThe token is now trading at the same level it was during the first week of January, right before its 25% surge.\n\nWhile ETH’s price has been dropping, trading volumes have increased by 26%, hitting $16.6 million in the past day.\n\nThis suggests that crypto traders are actively selling ETH at current levels, prompting additional downside momentum.\n\nThe next potential support for ETH is located around $2,150, which held firm throughout most of December.\n\nHowever, if ETH were to break this level, it could result in a further 10% drop to the next support region at $1,900.\n\nWith the Crypto Fear & Greed Index dropping to a value of 48, there’s a growing belief among traders that a decline like this could be on the cards – especially given the bearish pressure seen throughout the rest of the crypto market.\n\nSpot Ethereum ETF Hopes Face Regulatory Resistance from the SEC\n\nWhile Ethereum’s price woes have dampened sentiment recently, there is a potential catalyst on the horizon that could give ETH a significant boost.\n\nNumerous companies have filed applications with the SEC for a spot ETH ETF in the US, and approval would allow mainstream investors easy access to Ethereum exposure for the first time.\n\nHowever, the prospects of such an ETF being launched remain uncertain, with SEC Chair Gary Gensler remaining tight-lipped.\n\nMoreover, while spot Bitcoin ETFs were approved earlier this year, Gensler stated this does not indicate a willingness to green-light other crypto funds.\n\nThe first decision deadlines fall in May 2024, with additional rulings on other applications expected over the summer.\n\nIf a spot ETH ETF was approved, analysts predict it could have a massive impact on the token’s value.\n\nNevertheless, with clarity on the matter still months away, Ethereum holders may have to brace for further downside in the interim.\n\nRevolutionary Bitcoin Minetrix Defies Bear Trend with Stake-to-Mine Innovation\n\nWhile the markets wait to see if Ethereum can bounce back or gain momentum from a potential ETF approval, some crypto projects are powering forward despite the bearish sentiment.\n\nOne example is Bitcoin Minetrix (BTCMTX), an innovative platform offering a “Stake-to-Mine” mechanism for earning Bitcoin.\n\nBitcoin Minetrix allows users to stake its native token to earn mining credits.\n\nThese credits provide access to the project’s cloud mining operation, enabling stakers to generate BTC payouts without purchasing or maintaining hardware.\n\nIn addition, BTCMTX offers staking rewards of 72% per year for simply holding the token.\n\nThis provides compounding passive income, allowing users to accumulate more BTCMTX to boost their mining earnings.\n\nUnsurprisingly, this dual-reward mechanism has driven significant interest in the ongoing BTCMTX presale event and helped the project’s Twitter account reach 18,800 followers.\n\nBTCMTX has even been referenced by high-profile YouTubers like Austin Hilton, who endorsed the token to his 244,000 followers.\n\nWhile macro conditions weigh on major cryptos like Ethereum, Bitcoin Minetrix demonstrates projects with innovative use cases can still thrive.\n\nEarly investors can buy BTCMTX tokens through the presale for just $0.013 – although this price is only available for two more days before increasing.\n\nVisit Bitcoin Minetrix Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9jZWxzaXVzLXVubG9hZHMtNDAtbWlsbGlvbi13b3J0aC1vZi1ldGhlcmV1bS1vbi1jb2luYmFzZS1ob3ctd2lsbC1wcmljZS1yZWFjdNIBYWh0dHBzOi8vdS50b2RheS9jZWxzaXVzLXVubG9hZHMtNDAtbWlsbGlvbi13b3J0aC1vZi1ldGhlcmV1bS1vbi1jb2luYmFzZS1ob3ctd2lsbC1wcmljZS1yZWFjdD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Celsius Unloads $40 Million Worth of Ethereum on Coinbase - How Will Price React? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a move that is sending shockwaves through the cryptocurrency community, Celsius Network, currently navigating through bankruptcy proceedings, has executed substantial Ethereum (ETH) transactions worth $40 million on Coinbase. This latest development comes as part of Celsius' ongoing efforts to meet its financial obligations and settle with creditors, even as it holds a considerable Ethereum reserve.\n\nAdvertisement\n\nAccording to a recent tweet from Lookonchain, a prominent blockchain analytics firm, the Celsius wallet deposited 18,000 ETH ($40 million) to Coinbase just 12 hours ago. This follows a pattern of consistent Ethereum deposits by Celsius, totaling a staggering $280,760 ETH ($621 million) to various platforms including Coinbase, FalconX and OKX since Nov. 13.\n\nThe accumulated Ethereum holding for Celsius currently stands at an impressive 540,029 ETH, equivalent to a valuation of around $1.2 billion. Arkham Intelligence, another blockchain analytics provider, revealed that Celsius engaged in Ethereum sales amounting to more than $125 million between Jan. 8 and Jan. 12. These sales are part of a strategic plan to satisfy outstanding debts and fulfill the requirements of the ongoing bankruptcy proceedings.\n\nEthereum price movements\n\nThe current market price of Ethereum stands at $2,259, reflecting a 1.42% increase over the last 24 hours. However, the coin has experienced an 11.33% decrease in the past seven days. The trading volume for ETH is also down by 1.81% in the last 24 hours, with a total value of $14,257,423,116.\n\nMarket analysts and enthusiasts are closely monitoring how these substantial Ethereum transactions by Celsius will impact overall market sentiment. With the cryptocurrency community already grappling with volatility, this move by Celsius adds another layer of uncertainty."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtZGVsYXktZGVjaXNpb24tYmxhY2tyb2NrLXNwb3QtZXRoZXJldW0tZXRmLXRvLW1hcmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC pushes decision on BlackRock's spot Ethereum ETF to March - Cointelegraph",
        "content": "The United States securities regulator has pushed back its decision on BlackRock’s proposed spot Ether (ETH) exchange-traded fund (ETF) a day ahead of the deadline, citing the need for more time to review the proposed rule change.\n\n“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change,” the Securities and Exchange Commission’s assistant secretary, Sherry Haywood, explained in a Jan. 24 filing.\n\nThe SEC made the delay one day ahead of the Jan. 25 deadline. It is the first of several delays the SEC can exercise across a 240-day period. This first deadline comes nearly 45 days after Nasdaq filed for an iShares Ethereum Trust (on BlackRock’s behalf) on Dec. 11.\n\nWhile the SEC must make a final decision on BlackRock’s spot Ether ETF decision by Aug. 7, Bloomberg ETF analyst Eric Balchunas has predicted a final decision will be made on all pending spot Ether ETFs in May — similar to the way the SEC decided on 10 pending spot Bitcoin ETFs on Jan. 10.\n\nVanEck and Ark 21Shares’ Ether ETF applications have a final decision deadline of May 23 and May 24, respectively, while the other three applicants — Grayscale Investments, Invesco Galaxy and Fidelity — Investments have final deadlines on June 18, July 5 and Aug. 3, respectively.\n\n“Next date that matters is May 23rd,” said fellow Bloomberg ETF analyst James Seyffart on Jan. 24, adding that he expects to see more spot Ether ETF delays “sporadically” over the next few months.\n\nSpot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd https://t.co/2zBBvHkrVk — James Seyffart (@JSeyff) January 24, 2024\n\nEarlier this month, Balchunas pegged the chances of a spot Ether ETF approval at 70% by May.\n\nRelated: SEC solicits comments on Fidelity’s spot Ether ETF application\n\nOne of the SEC’s commissioners, Hester “Crypto Mom” Peirce, recently assured applicants that a court battle won’t be necessary to convince the SEC to approve the spot Ether ETFs.\n\n“We shouldn’t need a court to tell us that our approach is ‘arbitrary and capricious’ in order for us to get it right.”\n\nHowever, other industry pundits are less optimistic.\n\nMorgan Creek Capital CEO Mark Yusko predicts a less than 50% chance of an approved spot Ether ETF, making the case that the SEC remains hostile toward the cryptocurrency industry.\n\nMagazine: Magazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8yMTQxMzcvc2VjLWRlbGF5cy1kZWNpc2lvbi1ibGFja3JvY2stZXRoZXJldW0tc3BvdC1ldGYtYXBwbGljYXRpb27SAVtodHRwczovL2RlY3J5cHQuY28vMjE0MTM3L3NlYy1kZWxheXMtZGVjaXNpb24tYmxhY2tyb2NrLWV0aGVyZXVtLXNwb3QtZXRmLWFwcGxpY2F0aW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays Decision on BlackRock's Spot Ethereum ETF Application - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission has delayed a decision on BlackRock's spot Ethereum exchange-traded fund application.\n\nA Wednesday filing shows that Wall Street's top regulator \"finds it appropriate to designate a longer period within which to take action.\"\n\nBlackRock, the world's biggest fund manager, applied in November for a spot Ethereum (ETH) exchange-traded fund (ETF).\n\nAD\n\nAD\n\nThe idea, if approved, is that the investment vehicle would give people exposure to the second-biggest cryptocurrency by market cap, ETH.\n\nBlackRock CEO Larry Fink said in a CNBC interview last week that he sees \"value in having an Ethereum ETF,\" adding that the approval of such funds \"are just stepping stones towards tokenization.\"\n\nBlackRock's spot Bitcoin (BTC) ETF was approved on January 10 and started trading on the next day.\n\nThe iShares Bitcoin Trust has been the most successful of all 10 ETFs now trading and has $1.7 billion in assets under management.\n\nCrypto ETFs allow investors to gain exposure to digital assets without the need to buy and store the crypto themselves.\n\nAD\n\nAD\n\nOther high-profile firms such Ark Invest, Fidelity, and Grayscale want to introduce their own ETH ETF.\n\nETH ETF hype comes after the SEC's approval of spot BTC ETFs after a decade of denying the products.\n\nSenior Bloomberg Intelligence analyst Eric Balchunas has said he is 70% confident that a spot ETH ETF will be approved by May.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbmdhcGUuY29tL2RpdmVyZ2VudC12aWV3cy1vbi1ldGhlcmV1bS1ldGYtYXBwcm92YWwtZXRoLXByaWNlL9IBTGh0dHBzOi8vY29pbmdhcGUuY29tL2RpdmVyZ2VudC12aWV3cy1vbi1ldGhlcmV1bS1ldGYtYXBwcm92YWwtZXRoLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "ETH Price: Divergent Views on Spot Ethereum ETF Approval, ETH Price Drops 5%? - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) continues to face strong selling pressure. In the last 24 hours, the ETH price has tanked another 5% and is currently trading at $2,213 with a market cap of $265 billion. It seems that the ETH price can correct an additional 10% to take support at $2,000.\n\nThe Spot Ethereum ETF Approval\n\nEleanor Terrett from Fox Business sheds light on the varied opinions and perspectives surrounding the potential approval timeline for an Ethereum ($ETH) Exchange-Traded Fund (ETF). Discussions involve insights from ETF issuers, investment management firms, and sources close to the U.S. Securities and Exchange Commission.\n\nadvertisement\n\nOne issuer of a Bitcoin ($BTC) Spot ETF, concurrently awaiting approval for an ETH Spot ETF, expresses confidence that the successful approval and seamless launch of Bitcoin spots may influence the SEC to greenlight ETH spot ETFs.\n\nConversely, another source presents a contrasting viewpoint, stating that the current sentiment at the SEC is a “hard no,” with some internal resistance to the idea.\n\nAnother source believes that the approval path for ETH spot ETFs could be smoother, pointing to the listing of ETH futures ETFs and BlackRock’s track record in obtaining ETF approvals. They anticipate a potential launch by the end of the summer. Addressing SEC Chair Gary Gensler’s ambiguous stance on Ethereum’s status as a potential security, the source notes the CFTC’s classification of ETH as a commodity and Ripple’s partial victory with $XRP not being deemed a security during secondary market transactions. This leads them to believe Gensler may find it challenging to assert that most digital assets are securities.\n\nSEC Commissioner Hester Peirce emphasizes the need to avoid repeating past delays with ETH ETFs, emphasizing the importance of applying ‘regular way’ consideration to these products, similar to other comparable offerings.\n\nTerrett concludes that the SEC holds the key to the fate of Ethereum ETFs, with upcoming months expected to provide clues on the depth of SEC staff engagement with S-1 filings, akin to their scrutiny of Bitcoin spot ETFs.\n\nThe ETH Price Action\n\nEthereum experienced a significant decline in the recent trading session, particularly falling below the 50-day Exponential Moving Average (EMA). The analysis suggests that Ethereum might target the $2,100 level. A crucial factor to watch is whether the price breaks below $2,100 and then swiftly rebounds above it, potentially indicating a bullish move.\n\nThe 200-day EMA is positioned around the $1,950 level, and its upward trajectory aligns with this zone. The interaction between Ethereum’s price and the rising 200-day EMA presents an intriguing scenario, warranting close observation to discern the potential market dynamics."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvLm5ld3MvaW1tdXRhYmxlLWNob29zZXMtYXhlbGFyLWZvci1jYW5vbmljYWwtYnJpZGdlLXRvLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Immutable chooses Axelar for canonical bridge to Ethereum - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nSydney, Australia, Jan. 24, 2024, Chainwire\n\nAxelar and Immutable have officially announced their integration, marking a significant advancement in web3 gaming interoperability.\n\nThis strategic collaboration enhances game studios’ ability to onboard players across more than 50 blockchains and increases liquidity through new user funding channels. It marks a level-up in scalability and reach for developers building the future of gaming.\n\nYou might also like: Do Kwon’s Serbian enterprise outlasts Terraform Lab’s collapse\n\nIn the inaugural phase, Axelar will facilitate direct access between Ethereum and Immutable’s new zkEVM chain, Immutable zkEVM – a Polygon-based ZK-rollup blockchain within Immutable’s web3 gaming platform. This chain provides EVM compatibility, low-cost transactions, scalability, and Ethereum-level security for gaming applications.\n\nKey benefits of the Axelar network integration include:\n\nFaster user onboarding: Games gain direct access to Ethereum users.\n\nGames gain direct access to Ethereum users. Asset bridging: Players can seamlessly move assets to and from Ethereum using Immutable Passport and Immutable Checkout, simplifying deposits and withdrawals.\n\nPlayers can seamlessly move assets to and from Ethereum using Immutable Passport and Immutable Checkout, simplifying deposits and withdrawals. Cross-chain scalability: Games now have the capability to scale across multiple blockchains.\n\nMichael Powell, head of product marketing at Immutable, said:\n\n“Web3 games deploying on Immutable zkEVM, coupled with Immutable Checkout, can now connect to player wallets across the largest network of blockchains. Players will be able to seamlessly interact in-game with digital assets stored on any connected blockchain through Immutable Passport.”\n\nAdditionally, the native utility token of the Immutable ecosystem, IMX, will be securely bridged to the new Immutable zkEVM environment.\n\nIMX is utilized for transaction fees and to incentivize users and developers to meaningfully contribute to the Immutable ecosystem.\n\nSergey Gorbunov, CEO of Interop Labs, the initial developer of Axelar network, said:\n\n“The integration of Immutable serves as an expansion pack for the Axelar ecosystem, complementing a platform that already supports interoperability for Web3 game platform leaders like Decentraland and XPLA. This represents a significant step towards achieving interoperability in game development and metaverse environments, a concept discussed since the advent of web3.”\n\nJean-Yves Martineau, CTO at SimWin Sports, said:\n\n“With Axelar interoperability integrated into Immutable Checkout, games on Immutable zkEVM are able to onboard transaction-ready players from the entire Ethereum ecosystem. The fragmentation of user funds has traditionally been a user acquisition hurdle for the web3 gaming industry, but Immutable and Axelar are breaking down those barriers and ultimately fueling fan engagement for SimWin Sports’ AI driven sports simulations. Furthermore, the ability for players to withdraw assets back to Ethereum L1 only reinforces the fact that players truly own their in-game items.”\n\nWith the integration into the Axelar network, games built on Immutable zkEVM can now extend across an ever-increasing number of connected blockchains, currently at 56, featuring built-in programmability, security, and scalability at the cross-chain network layer.\n\nYou might also like: BlackRock and Fidelity lead billion-dollar spot Bitcoin ETF race\n\nAbout Axelar\n\nAxelar is the full-stack interoperability layer for web3.\n\nThe network enables blockchain as a new kind of development platform, integrating diverse networks into a seamless “Internet of blockchains.”\n\nAxelar is programmable and decentralized, secured by a proof-of-stake token, AXL. Application users access any digital asset or application, with one click.\n\nDevelopers work with a simple API and access an ecosystem of tools and service providers.\n\nAbout Immutable\n\nImmutable is on a mission to bring digital ownership to every player by making it safe and easy to build web3 games.\n\nCo-founded by James Ferguson, Robbie Ferguson and Alex Connolly in 2018, Immutable is headquartered in Sydney with a team of over 250. It is also backed by top transformational tech investors like Temasek, Tencent, Coinbase, BITKRAFT Ventures, King River Capital, Galaxy Interactive and more.\n\nThe Immutable gaming platform makes it easy for game studios and independent developers to safely and confidently build and launch successful games on Ethereum.\n\nThe product suite includes prebuilt solutions, optimized for usability, that help developers get to market faster without sacrificing security or player experience. Builders get personalized Web3 guidance, live support for their communities, and access to the largest ecosystem in gaming.\n\nImmutable was the first gaming platform to deliver a zero-knowledge (zk) scaling solution to the Ethereum community and provides developers with multiple zk-based scaling options, including Immutable X, a rollup based on StarkWare technology, and Immutable zkEVM, powered by Polygon.\n\nThe studio pioneered the NFT trading-card game Gods Unchained and is currently building a mobile RPG Guild of Guardians. Alongside its own titles, Immutable Games partners with third-party game developers to provide them with strategy and execution expertise aimed at ensuring the success of every Web3 game deployed within the Immutable ecosystem.\n\nUsers can join the Immutable community on Discord, Reddit, Twitter, Instagram, Telegram and Youtube\n\nContact\n\nPR Director\n\nKarla Vilhelem\n\nMarket Waves\n\n[email protected]\n\nRead more: Video game Doom from 1993 game goes live on Dogecoin blockchain\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1idGMtdHJhZGVycy10YXJnZXQtMzAwMDAtbGV2ZWwtYW5kLWV0aC1ib3VuY2VzLWZyb20tc3VwcG9ydC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as BTC Traders Target $30,000 Level and ETH Bounces From Support - Cryptonews",
        "content": "Bitcoin and Ethereum Price Prediction as BTC Traders Target $30,000 Level and ETH Bounces From Support\n\nIn the ever-dynamic world of cryptocurrency, Bitcoin (BTC) and Ethereum (ETH) continue to navigate through turbulent waters. As of recent developments, Bitcoin, the pioneer and most valued cryptocurrency, experienced a significant downturn, breaching the $40,000 mark and stirring market uncertainty.\n\nThis decline in Bitcoin’s value, partly attributed to the sales associated with the Grayscale GBTC Bitcoin ETF, has sparked concerns among traders about a possible further drop to the $38,000 level.\n\nConcurrently, the global crypto market cap witnessed a 2.32% fall within 24 hours, settling at $1.54 trillion, underscoring the broader impact of Bitcoin’s fluctuation.\n\nBitcoin $BTC is back under $39K and now officially 20% off its recent high 👀 pic.twitter.com/Aqtlj7QzbT — Evan (@StockMKTNewz) January 23, 2024\n\nIn a similar vein, Ethereum, renowned as the second-largest cryptocurrency, wasn’t spared from the bearish trend. It saw a nearly 3% decline, dropping to $2,347, a movement seemingly influenced by Bitcoin’s 20% fall following the launch of ETFs by major financial players like BlackRock and Fidelity.\n\nAmidst these market dynamics, Google Bard’s AI projections suggest a potential further decrease in Bitcoin’s value to $35,000, considering various economic factors such as inflation, interest rates, and regulatory changes.\n\nNavigating the Uncertainties: Key Factors Influencing Bitcoin and Ethereum in the Current Market Landscape\n\n\n\nThe current state of the cryptocurrency market, particularly concerning Bitcoin and Ethereum, is influenced by a complex web of factors, leading to considerable uncertainty. Analysts at QCP Capital have their eyes set on the potential for Ethereum to climb, especially with the prospects of spot ETF approvals.\n\nThe uncertainty surrounding Ethereum ETF approvals in 2024 has become a focal point, with analysts speculating that patterns in SEC approval may provide valuable insights.\n\nWhen Will the SEC Approve Ethereum ETFs, What Are the Possible Dates? When Will the Expected Rise Start? QCP Capital Analysts Answered!https://t.co/dLYMppdZW5 — Bitcoin Sistemi EN (@btcsistemiEN) January 24, 2024\n\nThe recent dip in Bitcoin’s value is attributed partly to outflows from Grayscale and the unfolding Mt. Gox news, which have sparked a flurry of questions in the market.\n\nWith Grayscale managing an impressive $21 billion in assets under management (AUM), its movements could significantly impact Bitcoin’s supply dynamics.\n\nAnalysts are closely monitoring the upcoming Federal Open Market Committee (FOMC) meeting and the U.S. Treasury’s Quarterly Refunding Announcement (QRA).\n\nThey anticipate that a strategy leaning towards short-term debt issuance could lead to market rallies. However, an increase in long-term debt could result in higher bond yields and potentially trigger sell-offs in the stock market.\n\nUnder these circumstances, a scenario favoring short-term debt would be more conducive to gains in Bitcoin and other cryptocurrencies.\n\nIn light of these developments, there remains a cloud of uncertainty over Ethereum (ETH), albeit with a silver lining that spot ETH approvals could have a positive impact.\n\nThe trajectory of ETH will likely hinge on a range of factors, including the outcome of ETF approvals, the influence of Grayscale’s market maneuvers, and broader macroeconomic events. This complex interplay of variables contributes to a cautious sentiment prevailing in the market.\n\nArthur Hayes’ Market Insights\n\n\n\nArthur Hayes, co-founder, and former CEO of BitMEX, recently shared thoughts on Bitcoin. He predicts a 30% drop from the recent high, expecting Bitcoin to go down to $30,000-$35,000. Hayes mentions buying “Put Options” at $35,000, expecting a 10-15% decline.\n\nBitMex Founder Arthur Hayes Predicts Bitcoin to Find Support Between $30,000 to $35,000 Before Hitting New All-Time High — Coinvestors 🌐 (@CoinvestorsNews) January 24, 2024\n\nDespite challenges, he believes the Federal Reserve could provide relief, highlighting cryptocurrencies as important for inflation protection. He sold Solana (SOL) and BONK but trusts Dogwifhat (WIF) if Bitcoin goes below $35,000, sticking to his recovery outlook for the market.\n\nBitcoin Price Prediction"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9yaXBwbGUtc2hhcmVzLWJpZy11cGRhdGUtb24teHJwLWV0aGVyZXVtLXNpZGVjaGFpbi1sYXVuY2jSAU1odHRwczovL3UudG9kYXkvcmlwcGxlLXNoYXJlcy1iaWctdXBkYXRlLW9uLXhycC1ldGhlcmV1bS1zaWRlY2hhaW4tbGF1bmNoP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ripple Shares Big Update on XRP Ethereum Sidechain Launch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a tweet, RippleX shared the latest update on the XRP Ledger EVM sidechain, developed by blockchain technology firm Peersyst in collaboration with Ripple.\n\nAdvertisement\n\nIn line with this, RippleX delivers an update from Peersyst, which discusses the progress and upcoming news. Peersyst highlighted that 2024 has started, being closer than ever to the launch of the long-awaited EVM sidechain for XRP Ledger.\n\n🧬The #EVMSidechain for #XRPLedger (🧵3/6)\n\n\n\nThe sidechain is more advanced than ever. After the audit with @bishopfox, a second one has been carried out with a recognized supplier that we will soon publish.\n\n\n\nThe latest changes are being applied and a blockchain update has been… pic.twitter.com/QA7pESWQ6x — Peersyst Technology (@Peersyst) January 23, 2024\n\nThe RippleX team has already published the XChainBridge public amendment, which is now open for voting. This is a necessary prerequisite for the launch of the EVM sidechain, and validators have currently cast 7 of the 28 votes required.\n\nRegarding the work done thus far, Peersyst stated that the sidechain is more advanced than ever before; after the audit with Bishop Fox, a second one has been carried out, whose details will be published soon.\n\nThe latest upgrades are being deployed, and the Cosmos SDK has gotten a blockchain update. Validators will soon be able to vote on the upgrade, which will incorporate Cosmos version 0.47 and Ethereum's EIP3855.\n\nIn addition, a new version of the bridge is on its way, allowing users to automatically and dynamically bridge any existing token on the EVM sidechain to the XRP Ledger. This would enable the EVM sidechain to serve as a gateway and connection to the rest of the EVMs, facilitating transactions and the use of all XRP Ledger Mainnet functionalities for all of these assets.\n\nA new UI has also been implemented to improve usability and allow for dynamic bridging between any sidechain, wallet and token. Meanwhile, a bridge SDK has been implemented to help developers create applications that leverage the bridge to access both networks.\n\nAlso, the latest version of the Blockscout Explorer is being developed. In addition to an improved UX/UI and other additional functions for verifying and executing smart contracts, the explorer would also provide a new dynamic display of dApps.\n\nEarlier in January, XRP Ledger developers announced the release of rippled 2.0, which includes two major feature enhancements: XLS-38 Cross-Chain Bridge and XLS-40 Decentralized Identity.\n\nThe Cross-Chain Bridge would allow XRP and fungible tokens issued on the XRPL to move seamlessly between the XRPL Mainnet and XRPL sidechains, as well as between the XRPL Mainnet and the upcoming EVM sidechain."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3RlY2hjYWJhbC5jb20vMjAyNC8wMS8yNC9ldGhlcmV1bS0yLTAtaXMtaGVyZS1iaXRjb2luLW1pbmV0cml4LWFuZC1jaGFpbmxpbmstYXJlLXRoZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2lucy1vbi1lYXJseS1pbnZlc3RvcnMtd2F0Y2gtbGlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum 2.0 is Here: Bitcoin Minetrix and Chainlink are the Ethereum-Based Altcoins on Early Investors Watch List - TechCabal",
        "content": "Ethereum is now paving the way for sustainable altcoins after its recent upgrade. Ethereum’s blockchain has proven to be one of the most reliable platforms for building decentralised applications and smart contracts. This reputation has prompted numerous developers to leverage the Ethereum platform, crafting their own distinctive cryptocurrencies.\n\n\n\nIn Ethereum’s thriving altcoin ecosystem, two projects stand out: Chainlink, with its decentralised oracle network and Bitcoin Minetrix (BTCMTX), with its novel mining protocol. Both leverage Ethereum’s strengths, but which boasts stronger investor appeal for the future?\n\nEthereum Leading the Way for Environmentally Friendly Altcoins\n\nEthereum has become a go-to platform for various blockchain applications and smart contracts. Offering developers a robust toolkit, it serves as a versatile space for creating and launching diverse blockchain-based projects.\n\nThe Shanghai upgrade to version 2.0 on March 12, 2023, was the next phase for Ethereum. This upgrade not only made the network eco-friendly but also set it apart from other widely used cryptocurrencies that consume substantial energy for mining.\n\nThe latest iteration, Ethereum 2.0, is geared towards making the platform even more scalable, faster and environmentally sustainable.\n\nChainlink: A New-and-Improved Ethereum Platform?\n\nChainlink functions as a decentralised oracle network embedded within the Ethereum blockchain. Its main purpose is to facilitate connections between smart contracts and real-world data, bridging the gap to external APIs.\n\nWith a market capitalisation surpassing $8 billion, Chainlink has gained recognition in the cryptocurrency community, currently holding the 12th position on CoinMarketCap.\n\nKnown for its technological advancements, Chainlink plays a crucial role in supporting decentralised finance (DeFi) applications. By providing secure and reliable data feeds, the platform empowers developers to create DeFi applications without constraints from on-chain data sources. Additionally, Chainlink boasts an active community of developers dedicated to ongoing improvements and innovations on the platform.\n\nBitcoin Minetrix: A Community-centric Crypto with the Technical Power of Ethereum?\n\nBitcoin Minetrix is quickly gaining attention for its innovative “Stake-to-Mine” approach to Bitcoin (BTC) mining. Developed on the Ethereum blockchain, this project presents a user-friendly method for individuals to earn Bitcoin passively, eliminating the need for technical expertise.\n\nThe platform is tailored to make Bitcoin mining more accessible to a broader audience, removing the requirements for expensive hardware and specialised skills. By staking their BTCMTX tokens, users gain access to cloud computing resources, simplifying the entire mining process.\n\nThe project has built a solid reputation rooted in security and transparency. Through Ethereum-compatible wallets like MetaMask, users can easily acquire and stake BTCMTX tokens within the ecosystem.\n\nThe onboarding process involves buying tokens, opting for “buy-and-stake,” and collecting rewards in Bitcoin.\n\nBitcoin Minetrix’s native token, $BTCMTX, is based on the ERC-20 standard, within the Ethereum blockchain. With a total supply limit of 4 billion tokens, the project demonstrates a thoughtful distribution strategy, allocating portions to the presale, marketing activities, staking and community-related projects.\n\nA major benefit of Bitcoin Minetrix is its ability to address typical challenges associated with Bitcoin mining, such as complexity and high entry costs. The token-based system offers a higher level of decentralisation and security compared to standard cloud mining services, reducing barriers for regular crypto enthusiasts.\n\nWhen users stake their tokens, they not only receive “mining credits” for cloud mining power but also enjoy two streams of income: potential staking rewards of up to 87% annually and a share of the mining profits. This dual-revenue model is a significant draw for those interested in both mining and staking in the cryptocurrency space.\n\nWhat Future Users of Web 3.0 Want for DeFi Currency\n\nAs the crypto market continues evolving, users seek sustainable and reliable DeFi currencies. Ethereum’s blockchain platform has proven to be one of the most reliable and eco-friendly platforms for building decentralised applications and smart contracts. Chainlink and Bitcoin Minetrix are two cryptocurrencies that have used Ethereum’s platform to create unique and reliable DeFi currencies.\n\nChainlink’s decentralised oracle network has proven to be a valuable asset for the DeFi ecosystem. Its secure and reliable data feeds allow developers to create DeFi applications not limited by on-chain data sources. Bitcoin Minetrix, on the other hand, offers a unique community-led approach that has proven to be popular among users.\n\nIn conclusion, Chainlink and Bitcoin Minetrix are two of the most promising Ethereum-based cryptocurrencies currently on the market. While Chainlink has an advantage in its focus on decentralisation, Bitcoin Minetrix’s unique features, such as its stake-to-mine feature and strong community governance, make it an attractive investment opportunity for those looking for the next big project.\n\nFor investors seeking dramatic growth, turning attention to presale tokens like Bitcoin Minetrix is a strategic move. The $BTCMTX token holds the promise of potentially soaring 50x – 100x, and with its final presale stage underway, early investors have a prime opportunity to get involved and potentially see significant profits in the coming weeks.\n\nShare this article"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNC9jZWxzaXVzLXdhbGxldC1kZXBvc2l0cy1uZWFybHktMzYwMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoLWludG8tY3J5cHRvLWV4Y2hhbmdlcy1vbi1jaGFpbi1kYXRhL9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNC9jZWxzaXVzLXdhbGxldC1kZXBvc2l0cy1uZWFybHktMzYwMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoLWludG8tY3J5cHRvLWV4Y2hhbmdlcy1vbi1jaGFpbi1kYXRhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Celsius Wallet Deposits Nearly $36,000,000 Worth of Ethereum (ETH) Into Crypto Exchanges: On-Chain Data - The Daily Hodl",
        "content": "A wallet associated with the defunct crypto lending platform Celsius deposited $30.34 million worth of Ethereum (ETH) to Coinbase on Monday, according to the crypto tracker Lookonchain.\n\nLookonchain also notes that Celsius deposited $5.13 million worth of ETH to the crypto exchange FalconX.\n\nCelsius’ two staking wallets still hold a total of 557,081 Ethereum worth around $1.3 billion.\n\nCelsius filed for bankruptcy in July 2022 after its native token, CEL, plummeted by 99% and it was unable to fulfill withdrawals.\n\nIn July, the project’s founder, Alex Machinsky, was arrested and charged with multiple counts of fraud in the US. Mashinksy is also being sued by the U.S. Securities and Exchange Commission (SEC) for similar reasons. The regulatory agency alleges Mashinksy raised billions of dollars by lying to customers and offering unregistered securities.\n\nLate last year, a judge approved a new plan from Celsius that aims to generate funds for a new mining and staking corporate spinoff designed to repay creditors.\n\nThe company, dubbed “NewCo,” will have a $1.25 billion balance sheet, $450 million of which will be liquid crypto.\n\nIn a statement earlier this month, Celsius said it has begun the unstaking process for its Ethereum holdings, which it has been using to generate income for its estate over the last year and a half.\n\n“In preparation of any asset distributions, Celsius has started the process of recalling and rebalancing assets to ensure ample liquidity\n\nCelsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process.\n\nThe significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors.\n\nAs a reminder, eligible creditors will receive in-kind distributions of BTC and ETH as outlined in the approved Plan.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/ex_artist"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWV0ZnMtaGVzdGVyLXBpZXJjZS1jbGFpbXMtc2VjLXdvbnQtcmVwZWF0LXNhbWUtbWlzdGFrZXMv0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tZXRmcy1oZXN0ZXItcGllcmNlLWNsYWltcy1zZWMtd29udC1yZXBlYXQtc2FtZS1taXN0YWtlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETFs: Peirce Claims SEC Won't 'Repeat Same Mistakes' - CoinGape",
        "content": "For Ethereum ETFs, SEC commissioner Hester Peirce strongly believes that the securities regulator would not repeat the same mistakes it made in the run-up to spot Bitcoin ETF approval.\n\nEthereum ETF Approval Might Come Without Hassle\n\nAward-winning Web3.0 host Zac Guzmán interviewed Peirce to discuss the regulation of cryptocurrency. During their discussion, he asked the commissioner if Ethereum ETF filers would need to go to court before receiving approval from the SEC just as Grayscale had done. Peirce responded that the SEC would not need to “repeat same mistake” as it did before.\n\nadvertisement\n\nPopularly known as the ‘Crypto mom’, the commissioner went on to state that the agency would not need a court to explain that its approach is arbitrary and capricious before it gets things right this time around. In her opinion, the SEC has learned its lessons and they will stick to it as applications for Ethereum ETF kept coming in.\n\nBefore approving spot Bitcoin ETFs earlier this month, the SEC had constantly rejected applications from several interested parties including Grayscale. Notably, Grayscale took the rejection of its GBTC conversion application a step further by going to court. After several months of legal tussle, a US Court of Appeals for the District of Columbia Circuit handed Grayscale a win against the SEC.\n\nThis was pivotal for the crypto industry, especially as the court further mandated the regulator to reconsider its decision over Grayscale’s application. There had been several postponement of a spot Bitcoin ETF decision from the United States SEC but in less than six months of receiving this mandate from the court, the SEC greenlighted eleven spot Bitcoin ETF applications.\n\nEthereum Spot ETF Impact\n\nNow the race is for Ethereum ETFs and the SEC seems to be taking its time to reach a decision. Based on a 45-day extension granted earlier, the regulator’s decision on Grayscale Ethereum Trust’s ETF is expected within the next two days. Hashdex Nasdaq Ethereum ETF, which aims to incorporate spot Ethereum and futures contracts into its portfolio has had its decision postponed earlier.\n\nSimilarly, the SEC has announced a 45-day extension for Fidelity Spot Ethereum ETF, pushing the decision on the product to March 5, 2024. As the broad market awaits the decision of the regulator, there are certain forecasts that ETH will reach as high as $4,800 when an approval is eventually given.\n\nConsidering how Bitcoin has reacted to the launch of spot Bitcoin ETFs, there is no guarantee that it would be any different for Ethereum but the prospects remains high for approval for now."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9zZWMtY2hhaXItZ2Vuc2xlci10ZW1wZXJzLWVudGh1c2lhc20tb3Zlci1ldGhlcmV1bS1ldGYtYXBwbGljYXRpb25zLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Chair Gensler Tempers Enthusiasm Over Ethereum ETF Applications - Cryptonews",
        "content": "SEC Chair Gensler Tempers Enthusiasm Over Ethereum ETF Applications\n\nSecurities and Exchange Commission Chair Gary Gensler has downplayed the possibility of Ethereum ETF applications being approved in the near future.\n\nIn a media briefing on January 24th, Gensler clarified that the recent approval Bitcoin ETFs by the agency was exclusive to Bitcoin.\n\n\n\nThis clarification comes amid expectations from some quarters that spot Ethereum ETFs might be the next in line for approval.\n\n“As I said two weeks ago, that which we did with regard to bitcoin exchange traded products is cabined to this one commodity non-security and shouldn’t be read to be anything other than that,” Gensler said during the briefing when asked about ether ETFs.\n\nGensler noted that there is now “better disclosure” for investors who plan to buy Bitcoin ETFs.\n\n\n\n“In that light, there’s also better disclosure,” Gensler said. “They’re listed on stock exchanges now rather than trading in over the counter markets. There were 10 or 11 that went live at the same time that brought a certain amount of competition. You’ve seen some competition that investors benefited from lower fees.”\n\nThere are varying levels of confidence among crypto experts regarding the approval of spot ether ETFs, with some speculating that an approval could come sometime in May. Shortly after Gensler’s comments, the SEC revealed that it had delayed its decision on BlackRock’s spot Ethereum exchange-traded fund (ETF) application to March.\n\nSeveral prominent firms, including Fidelity and BlackRock, have already submitted applications for a spot Ethereum ETF.\n\n\n\nOn January 10, the agency greenlit the approval of 11 spot Bitcoin ETFs, a move that followed a D.C. court’s decision by three judges. However, the court ruled that the SEC needed to re-examine a bid related to Grayscale’s spot Bitcoin ETF application.\n\nThe SEC’s Legal Disputes\n\n\n\nThe SEC is currently entangled in legal battles with crypto exchanges Binance and Coinbase.\n\n\n\nGensler, when asked about his thoughts on the current cases, reiterated that noncompliant crypto companies were not “necessarily” providing appropriate disclosures.\n\n“But stepping back from any one case, I just think that the investing public, if they’re interested in investing in crypto securities, they should be aware and careful that these crypto security tokens are not necessarily giving them the appropriate disclosures and they’re not getting those disclosures from these non compliant token operators,” Gensler said."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9mb3gtbmV3cy1yZXBvcnRlci1yZXZlYWxzLWRpZmZlcmluZy12aWV3cy1vbi1zZWNzLWFwcHJvdmFsLW9mLXNwb3QtZXRoZXJldW0tZXRmcy_SAW5odHRwczovL2NyeXB0b3BvdGF0by5jb20vZm94LW5ld3MtcmVwb3J0ZXItcmV2ZWFscy1kaWZmZXJpbmctdmlld3Mtb24tc2Vjcy1hcHByb3ZhbC1vZi1zcG90LWV0aGVyZXVtLWV0ZnMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Fox News Reporter Reveals Differing Views on SEC’s Approval of Spot Ethereum ETFs - CryptoPotato",
        "content": "Fox News reporter Eleanor Terrett has revealed differing opinions among stakeholders regarding the potential approval of a spot Ethereum Exchange-Traded Fund (ETF).\n\nWhile certain issuers are optimistic, suggesting that the approval of spot Bitcoin ETFs might compel the SEC to greenlight Ethereum-based products, possibly in the late summer, others argue that the agency’s stance on ETH is leaning towards rejection due to substantial internal resistance within the SEC.\n\nConflicting Views on SEC’s Approval\n\nAccording to Terrett, one issuer who has already obtained approval for a spot Bitcoin ETF expresses confidence that the successful launch will influence the SEC to greenlight Ethereum ETFs.\n\nHowever, another source paints a more pessimistic picture, stating that there is a “hard no” at the SEC, with internal resistance to the idea.\n\nReporting on the timeline for a potential $ETH ETF approval has turned up a plethora of different takes from ETF issuers, investment management firms and sources close to the @SECGov. ✨One $BTC Spot ETF issuer with an ETH Spot ETF application says they’re confident the… — Eleanor Terrett (@EleanorTerrett) January 23, 2024\n\nA third source speculates that the approval of Ethereum futures ETFs and BlackRock’s track record in getting ETFs approved could pave the way for spot ETH ETFs to launch by the end of the summer.\n\nWhen questioned about SEC Chair Gary Gensler’s stance on Ethereum as a potential security, the source suggests that given the Commodity Futures Trading Commission’s (CFTC) classification of Ethereum as a commodity and recent legal developments with Ripple’s XRP, it may be challenging for Gensler to assert that most digital assets are securities.\n\nSEC Commissioner Hester Peirce emphasized the importance of avoiding delays in the approval process for spot Ethereum ETFs.\n\nShe stated, “We need to be applying ‘regular way’ consideration to these products, the same kind of consideration we apply to similar products.”\n\nJP Morgan Analysts Skeptical\n\nMeanwhile, JP Morgan analysts led by Managing Director Nikolaos Panigirtzoglou expressed reservations through a note to clients sent on Jan.18 about the likelihood of SEC approval for spot Ethereum ETFs.\n\nCiting regulatory and judicial concerns, the analysts predicted a less than 50% chance of approval. They also noted skepticism about the SEC classifying Ethereum as a commodity as early as May.\n\nAs the SEC continues to deliberate on spot Ethereum ETFs, market participants eagerly await clues from the regulatory body in the coming months.\n\nAccording to Terrett, the SEC’s handling of S-1 filings will likely provide insights into the agency’s stance. The ball remains firmly in the SEC’s court, and the crypto community keenly watches how things unfold."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2VjLWRlbGF5cy1ibGFja3JvY2stc3BvdC1ldGhlcmV1bS1ldGbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays BlackRock Spot Ethereum ETF - Watcher Guru",
        "content": "In the latest development for the next wave of cryptocurrency ETFs, the SEC has delayed a decision on BlackRock’s Spot Ethereum ETF. Following landmark approval of Spot Bitcoin ETFs in early January, BlackRock hoped its pending spot ETH ETF application would be approved swiftly, but the SEC has yet to budge.\n\nJUST IN: 🇺🇸 SEC delays BlackRock's Spot Ethereum ETF. — Watcher.Guru (@WatcherGuru) January 24, 2024\n\nAlso Read: Solana to Surpass Ethereum by 500% – But When?\n\n“The commission finds it appropriate to delegate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,” a new SEC filing says. The commission designates March 10, 2024, as the new deadline to approve or deny BlackRock’s Ethereum ETF.\n\nThe SEC also delayed decisions on every Spot Bitcoin ETF application before approval, including BlackRock’s. Just days ago, the commission delayed Fidelity’s Spot Ethereum ETF application.\n\nIt’s no secret that the SEC is not a fan of cryptocurrency. In fact, chair Gary Gensler implied shortly after approval that it was seemingly pushed to approve the Spot Bitcoin ETFs. Immediately, cryptocurrency enthusiasts went to social media to blast the commission, signaling a feeling of déjà vu. Following the initial filing, the SEC had 45 days to decide on the ETFs or delay it, and the commission’s deadline was Jan 25, a day after the decision to delay.\n\nAlso Read: Bitcoin: Cramer’s Doubts vs. Hayes’ Bottom Fishing – What Lies Ahead?\n\nHence, it is likely that the SEC is looking to prolong the potential approval of Ethereum ETFs, including BlackRock’s. Other asset management firms have filed ETF applications for Ethereum in hopes of adding it to their services. However, those applications may likely be delayed eventually as well."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWRlZmllcy1yZXNwZWN0YWJsZS1jb3JyZWN0aW9uLXJlc3RvcmVzLWFib3ZlLTQwLTAwMC0yMDI0MDEyNDE5MDDSAaYBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1idGMtZGVmaWVzLXJlc3BlY3RhYmxlLWNvcnJlY3Rpb24tcmVzdG9yZXMtYWJvdmUtNDAtMDAwLTIwMjQwMTI0MTkwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC defies respectable correction, restores above $40,000 - FXStreet",
        "content": "Share:\n\nBitcoin price could make a move north if it closes above the $40,726 support on the three-day timeframe.\n\nEthereum price likely to fall 5% before inflection with uncollected liquidity residing below $2,135.\n\nRipple price looks poised for recovery after a double chance on the FVG.\n\nBitcoin (BTC) price is attempting a recovery barely 24 hours after speculation of a “respectable correction” that was expected to send BTC to the $35,000 range. Ethereum (ETH) price is yet to heed BTC’s cue, while Ripple (XRP) appears to have bottomed out.\n\nAlso Read: Bitcoin price could face short squeeze, analyst says, as FTX sells nearly $1 Billion of Grayscale spot BTC ETF\n\nBitcoin price fights to find a hinge\n\nBitcoin (BTC) price is pulling back after a strong rejection from the $48,000 psychological level. Despite a slippery slope, BTC has managed to reclaim the $40,000 psychological level after a range low of $38,555. BTC holders remain in murky waters until such a time when the price breaks and closes above the $40,726 support on the three-day timeframe.\n\nThe Moving Average Convergence Divergence (MACD) and Awesome Oscillator (AO) indicators remain in positive territory above their respective mean lines, inspiring hope for a possible move north.\n\nIf the bulls have their way, a decisive move above $40,726 would set the pace for Bitcoin price to breach $43,750, or in highly bullish cases, reclaim the $48,000 level. Overly ambitious outcomes could send BTC past the $50,000 psychological level, last tested in December 2021.\n\nBTC/USDT 3-day chart\n\nConversely, with the Relative Strength Index (RSI) below 50 and still southbound, Bitcoin price could extend the fall, potentially slipping past the $37,800 support. Losing this buyer congestion level could send BTC to the $30,000 psychological level.\n\nAlso Read: Bitcoin Price Outlook: Analyst anticipates $35,000 retest for BTC as part of ‘respectable’ correction\n\nEthereum price could extend the fall 5%\n\nEthereum (ETH) price may have an additional 5% in losses coming to test the $2,135 level, amid uncollected sell-side liquidity residing below this critical level. This level is critical for Ether market value, as it continues to hold Ether afloat after a prolonged consolidation since December 3.\n\nIt therefore marks a possible inflection point or another measure of quicksand to invalidate the prevailing bullish outlook.\n\nThe odds support the bearish thesis, suggesting the drop could come as the RSI is showing falling momentum as the MACD is subdued and moving in tandem with the signal line (orange band). The AO histogram bar is flashing red but still in positive territory, reinforcing the assumption that $2,135 will be critical in determining the next directional bias.\n\n\n\nETH/USDT 3-day chart\n\nIf the $2,135 support holds, the Ethereum price could bounce, with the potential to overcome resistance due to the midline of the channel as it targets the $2,800 level, 25% above current levels.\n\nAlso Read: Ethereum ETFs likely to get better deal than their Bitcoin counterparts\n\nRipple price likely to bounce from here\n\nRipple (XRP) price looks ready for recovery after a second retest of the Fair Value Gap (FVG) between $0.4927 and $0.5111. The RSI has tagged 30, suggesting XRP is oversold and a bullish correction may be due. A reentry by the bulls could see the Ripple price reclaim the support offered above $0.5442. In a highly ambitious case, XRP could extend the gains to the $0.5784 level. Beyond this, the next logical target for the XRP price could be the $0.6000 psychological level, standing around 16% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the XRP price extends the fall below the midline of the FVG at $0.5029, the load-shedding exercise could extend with Ripple price likely to revisit the $0.4746 support, around 8% below current levels.\n\nAlso Read: XRP price could gain nearly 12% as on-chain metrics signal recovery"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9jbGF5c3RhY2stZXRoZXJldW0tcmVzdGFraW5nLWNsYXkv0gFCaHR0cHM6Ly93d3cuY29pbnNwZWFrZXIuY29tL2NsYXlzdGFjay1ldGhlcmV1bS1yZXN0YWtpbmctY2xheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "ClayStack to Launch Ethereum Restaking and Offer Reward Points Redeemable for Clay Tokens - Coinspeaker",
        "content": "Users restaking Ethereum will get points that they can exchange for Clay tokens when the native tokens officially launch.\n\nCrypto staking platform ClayStack has announced it will support Ethereum (ETH) restaking via ETH native protocol EigenLayer. The platform has also announced it will give users rewards comprising Clay points and EigenLayer points.\n\nClayStack Restaking Ethereum\n\nAs part of the new offering, ClayStack will change its ETH liquid staking token known as csETH, to a liquid restaking asset. At the moment, users can only use ETH for direct restaking on EigenLayer. However, ClayStack CEO and founder Mohak Agarwal said the plan is to provide support for Rocket Pool Ether (rETH) and Lido staked Ether (stETH) very soon.\n\nEigenLayer launched in June 2023 and has significantly driven Ethereum staking since then. By November, the protocol had processed 170,000 ETH in staking. As of Tuesday, the total value locked (TVL) on EigenLayer is $1.7 billion.\n\nRestaking is a process that uses liquid staking tokens and staked Ether to improve earnings across multiple platforms. It combines traditional staking, which locks tokens to generate rewards, and liquid staking, which also creates rewards but by using liquid tokens as representations of locked assets.\n\nClayStack started liquid staking for the MATIC token in 2022. It then launched ETH liquid staking in September 2023, and is now focusing on ETH staking. On moving on from Polygon, CEO Agarwal said:\n\n“Due to shrinking yield and the limited DeFi ecosystem on Polygon outside major ones like Compound and Aave (which delisted the majority of the less traded or volatile assets), it became very difficult to build more utility on Polygon liquid staking.”\n\nReward Points\n\nClayStack has plans to launch its network token and is offering early users of its ETH staking service the opportunity to earn. According to the platform, restakers who earn clay points can redeem them 1:1 for clay tokens. Agarwal pointed out that “there is no other points system currently that offers 1:1 redemption. You can own 1 million points in other programs and you could end up getting 100 tokens.”\n\nThe plan is to allocate 20 clay points per ETH each week. While the rate may change weekly, users have no minimum or maximum points to maintain. Nonetheless, ClayStack will maintain a cap on points that all users can get. This cap will refresh weekly.\n\nIn addition to Clay points, users will also get EigenLayer restaked points. Agarwal said:\n\n“When ClayStack natively restakes the ETH on ÉigenLayer, ClayStack’s smart contract ends up accruing those points. We don’t know what they will be redeemable to; we will just pass along those points to csETH holders, considering so much excitement amongst users for EigenLayer points.”\n\nLast November, non-custodial staking services provider Stakin announced a partnership with ClayStack. The collaboration between both providers offers users a new staking experience without compromising security and resilience. Users will also enjoy more control over their staked assets.\n\nIn 2021, ClayStack received $5.2 million in seed funds from several investors, including Solana Foundation and Coinbase Ventures. ParaFi Capital and CoinFund led the seed round."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL2Fyay1pbnZlc3QtY29vLWhpbnRzLWF0LWRldmVsb3BtZW50cy1pbi1zcG90LWV0aGVyZXVtLWV0Zi1maWxpbmcv0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vYXJrLWludmVzdC1jb28taGludHMtYXQtZGV2ZWxvcG1lbnRzLWluLXNwb3QtZXRoZXJldW0tZXRmLWZpbGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ark Invest COO Hint At Developments In Spot Ethereum ETF Filing - CoinGape",
        "content": "While the U.S. Securities and Exchange Commission’s (SEC) approval of the spot Bitcoin ETFs gave traders and investors an unexpected outcome in terms of the Bitcoin (BTC) Price curve, a section of applicants of the spot Ethereum ETF and market participants are hopeful of approval in the near future. The Ethereum (ETH) Price dropped by 12% in the last 7 days, which is double the BTC Price fell in the same period.\n\nAlso Read: Important Updates of Ripple (XRP) Lawsuit: When It Will End?\n\nadvertisement\n\nARK Invest COO Says ETH ETF Approval Soon\n\nWhen asked whether the spot ETH ETF was on the cards, ARK Invest President and chief operating officer Tom Staudt said the approval was coming “soon.” Staudt recalled that ARK Invest was the first applicant to file for an Ethereum ETF with the US SEC and hence expressed confidence of an approval in near future. On September 7, 2023, Ark Invest became the first to file for a spot Ether ETF in the United States. The fund was initially aimed at expanding its portfolio of crypto products, at a time when the market was increasingly becoming confident of a Bitcoin ETF approval.\n\nSpeaking to Fox Business journalist Eleanor Terrett, the ARK Invest COO said the discussions with the SEC gives confidence of the possibility of an ETH ETF approval, both from legal principle and implementation standpoint. Compared to the timeline in the lead up to the spot Bitcoin ETF approval, the case for Ethereum ETF approval has changed philosophically, operationally and also legally, he explained.\n\nAccumulation Continues\n\nMeanwhile, ARK Invest chief executive officer Cathie Wood said a majority of the investment community are underestimating Bitcoin, in the context of the top cryptocurrency dropping below the $40,000 mark. Showing confidence in a potential turnaround in the prospects of crypto market, the Cathie Wood firm increased its holdings in Ark 21Shares spot Bitcoin ETF, offloading ProShares Bitcoin Strategy ETF (BITO).\n\nAlso Read: Terra Classic L1TF Core Security Upgrade Proposal Up For Vote, LUNC Price Soars 8%"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1ldGgtaW1taW5lbnQtdHJlbmQtY2hhbmdlLWNyeXB0by1hbmFseXNpcy1vZi1qYW51YXJ5LTI0LTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) imminent trend change? Crypto Analysis of January 24, 2024 - Cointribune EN",
        "content": "Wed 24 Jan 2024 ▪ 6 min of reading ▪ by Family Trading ▪\n\nThe price of Ethereum has entered a correction phase since reaching $2,700. Let’s examine the future outlook for ETH together.\n\nSituation of Ethereum (ETH)\n\nAs noted in the analysis of January 11, Ethereum marked a new high. It reached $2,700 before starting a downward movement. Ethereum plunged below the 38.2 % Fibonacci retracement level (taken from the ATH) before dropping just above its daily support at $2,150. Ethereum’s medium and long-term trend remains bullish. However, the breach of this support could jeopardize the short-term trend of the token. At the time of writing, one Ether is trading around $2,200. These recent bearish movements have brought its price below the 50-day moving average. This development suggests the possibility of a trend reversal, thereby calling for increased vigilance from investors.\n\nRegarding the oscillators, they are currently below the midline, which could suggest that Ethereum is currently in an oversold state. From an optimistic angle, this could indicate that it is undervalued. However, adopting a more pessimistic view, it could be interpreted as a sign that the cryptocurrency’s momentum is turning bearish. Note that the existence of a divergence between the price of Ethereum and its oscillators could reinforce this assumption.\n\nDaily ETH/USD Chart\n\nThe current technical analysis was carried out in collaboration with Elie FT, an investor and trader passionate about the cryptocurrency market. Now a trainer at Family Trading, a community of thousands of proprietary traders active since 2017. Here you will find Live sessions, educational content, and peer assistance around financial markets in a professional and warm atmosphere.\n\nFocus on Derivatives (ETHUSDT)\n\nThe open interest for Ethereum has experienced a notable decline of nearly 15% since Monday, January 22. This decrease represents a withdrawal of over $700 million in ETH/USDT perpetual contracts. Out of these withdrawals, more than $60 million were executed forcibly. Although these amounts may seem significant, their impact on the market requires a more nuanced analysis. When compared to the price evolution of ETH relative to its open interest, it becomes apparent that the latter maintains relative stability compared to the ETH price itself. This observation could indicate that entry and exit of traders in the market are not particularly high, or that new traders are entering the market at the same rate as others leave. Thus, this situation opens the door to various interpretations, such as a period of indecision in the market, possible accumulation of orders, etc.\n\nETHUSD Open Interest\n\nThe Ethereum liquidations heat map shows that the cryptocurrency has recently reached an important liquidation zone, situated between $2,200 and $2,150. At present, the price appears to be stabilizing in this area, indicating a period of uncertainty among investors. If the price cannot maintain itself above this last level, the next significant liquidation zone below its price is around $2,000. Above the current price, the $2,500 zone is also worth monitoring. The approach of the price towards these levels could lead to a massive triggering of orders, thus increasing the possibility of a period of heightened volatility on Ethereum. These zones are therefore crucial points of interest for investors.\n\nETH/USDT Liquidation Heatmap (3 months)\n\nHypotheses for Ethereum’s Price (ETH)\n\nIf the price of Ethereum maintains above the $2,200 – $2,100 levels, we could anticipate a bullish continuation up to the $2,400 level. The next resistance to consider, should the bullish movement continue, would be the last peak, namely $2,700 and higher if this level is breached. At this stage, that would represent an increase of over +25%.\n\nIf the price of Ethereum fails to maintain itself above the $2,200 – $2,100 levels, we might expect a return to $2,000. The next support to consider, should the bearish movement continue, would be around the levels of $1,900. At this stage, that would represent a drop of nearly -13%.\n\nConclusion\n\nAfter marking a new high, Ethereum has initiated a correctional phase, leading it towards its former daily resistance. Could this decline be due to the delay in the decision on the Ethereum spot ETFs? What is certain is that it will be crucial to closely observe the price’s reaction to the various key levels to confirm or refute the current hypotheses. It is also important to remain vigilant of potential “fake outs” and market “squeezes” in each scenario. Finally, remember that these analyses are based solely on technical criteria and that the price of cryptocurrencies can also quickly evolve based on other, more fundamental factors.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjQvMDEvMjQvc3BvdC1ldGhlcmV1bS1ldGYtaGVzdGVyLXBlaXJjZS1zYXlzLXNlYy13aWxsLW5vdC1tYWtlLXNhbWUtbWlzdGFrZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETF: Hester Peirce Says SEC Will Not Make Same Mistakes - The Crypto Basic",
        "content": "In anticipation of the potential approval of a spot Ethereum ETF, Hester Peirce, a Commissioner with the US SEC, reiterated that the regulator has learned from its past mistakes, signaling the products’ emergence may be smoother.\n\nEarlier this month, the SEC approved 11 spot Bitcoin ETFs to trade in the US. Behind this celebrated milestone was more than ten years of pursuit of the investment product, with the regulator notably rejecting several applications from many asset managers.\n\nRiding on this history, many in the industry are now speculating on whether Ethereum spot ETF might suffer the same fate as Bitcoin.\n\n- Advertisement -\n\nPer Hester Peirce’s position, the delays recorded in the approval process for crypto ETFs are long gone, and the commission will approach Ethereum ETFs with a different strategy.\n\nSEC Has Learned from Its Mistake\n\nOne of the major turning points for the market regulator in granting approvals for the spot Bitcoin ETF product was the defeat in the Court case against Grayscale Investments.\n\nThe asset manager sued the regulator when it initially denied its request to convert its Grayscale Bitcoin Trust (GBTC) product into a full-fledged spot ETF.\n\nThe court ruled in favor of Grayscale and ordered the commission to review the applications. When asked by Coinage media’s Zac Guzman whether a court case might be required before the commission approves a spot Ethereum ETF, Hester Peirce responded:\n\n- Advertisement -\n\n“That’s not how we’re going to do our approvals … We shouldn’t need a court to tell us that our approach is ‘arbitrary and capricious’ in order for us to get it right.”\n\nWith Bitcoin ETF approval setting a precedent, it might only be a matter of time before Ethereum and even XRP ETF start trading in US markets.\n\nDissenting Views on Potential Ethereum ETF\n\nDespite the filings for several spot Ethereum ETF products, with the US SEC in the queue for decision, there is a diverse opinion on whether the product will be approved or not.\n\nFox Business Journalist Eleanor Terrett highlighted these discrepancies, clearly pointing out how a spot Bitcoin ETF issuer expressed confidence that spot Ethereum ETF will see the light of day.\n\nShe also noted that sources at the SEC confirmed that based on the current disposition of the regulator, Ethereum ETFs are a “hard no” based on internal resistance to the idea for now.\n\nHowever, with the presence of BlackRock in the race once again and the firm’s track record of securing approvals, Ethereum ETFs might also be close to being approved."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3NlYy1zYXlzLW5vLXRvLWV0aGVyZXVtLWV0ZnMtYnV0LWlzc3VlcnMta2VlcC10aGUtZmFpdGgv0gFXaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3Mvc2VjLXNheXMtbm8tdG8tZXRoZXJldW0tZXRmcy1idXQtaXNzdWVycy1rZWVwLXRoZS1mYWl0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Says ‘No’ to Ethereum ETFs, but Issuers Keep the Faith - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nThe approval of spot Ethereum Exchange-Traded Funds faces uncertainty as the U.S. Securities and Exchange Commission exhibits resistance. Fox Business reporter Eleanor Terrett sheds light on diverse expectations surrounding the SEC’s stance, revealing potential challenges and conflicting opinions.\n\nSEC’s Current Position\n\nTerrett reports a “hard no” from sources within the SEC, signaling “some internal resistance” to approving spot Ethereum ETF.\n\nIn her tweet, Terrett also mentions SEC commissioner Hester Peirce, known for her pro-cryptocurrency stance, who has been advocating for a more straightforward decision process. Pierce criticized the reliance on legal victories to guide ETF approvals.\n\nDespite SEC resistance, Terrett highlights optimism among asset managers like BlackRock, whose track record of getting ETFs approved has raised hopes of getting Ethereum ETFs approved by summer this year. Blackrock expresses confidence, citing the smooth launch of Bitcoin spots as a potential catalyst for Ethereum spot ETF approval.\n\nTerrett anticipates further insights into the SEC’s stance in the coming months, mainly through engagements with S-1 registration forms.\n\nVarying Expectations\n\nExpectations on spot Ethereum ETF are varying. Bloomberg ETF analyst Eric Balchunas suggests a 70% chance of approval in May, while JP Morgan’s Nikolaos Panigirtzoglou is less optimistic, predicting a 50% chance.\n\nJP Morgan Analysts’ Cautious Stance\n\nJP Morgan analysts, led by Nikolaos Panigirtzoglou, remain cautious, estimating the likelihood of approval to be no higher than 50%. Regulatory and judicial considerations and uncertainty surrounding Ethereum’s classification as a commodity or security contribute to their skepticism.\n\nUpcoming Developments\n\nThe SEC’s recent delay in deciding on Fidelity’s Ethereum Spot ETF until March 5, 2024, extends the evaluation period. The final decision on Spot Ethereum ETFs is expected between late January and August 2024.\n\nThe approval of spot Ethereum ETFs remains clouded in uncertainty, with conflicting signals from the SEC, varying expectations from expert figures, and ongoing regulatory uncertainties."
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3NlYy1kZWxheXMtYmxhY2tyb2NrLWV0aGVyZXVtLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC delays BlackRock's Ethereum spot ETF to March - Crypto Briefing",
        "content": "Share this article URL Copied\n\nThe US Securities and Exchange Commission (SEC) has extended its review period for considering a proposed rule change to list the iShares Ethereum Trust spot ETF, designating March 10, 2024 as the new deadline for taking action, according to today’s filing.\n\nOriginally filed by The Nasdaq Stock Market on November 21, 2023, the proposal aims to provide direct exposure to Ethereum’s price movements under Nasdaq Rule 5711(d) for Commodity-Based Trust Shares.\n\nThe SEC extended the original 45-day review period, which would have ended on January 25, 2024, stating it required more time to thoroughly consider the proposal and related issues around a spot Ethereum ETF product.\n\nOriginally published for comment on December 11, 2023, the proposed rule change has received no public comments so far. Under the Securities Exchange Act of 1934, the longer review period indicates a cautious approach by the SEC towards crypto-based ETFs amid an evolving regulatory landscape.\n\nBlackRock, the world’s largest asset manager, has been at the forefront of integrating digital assets into traditional investment vehicles. However, the SEC’s hesitancy reflects ongoing concerns over the volatility, security, and regulatory compliance of crypto products.\n\nInvestors and industry experts are closely watching the SEC’s moves, as approval of such an ETF would mark a significant milestone in the mainstream acceptance of cryptocurrencies. The extended review period suggests that the SEC is taking a thorough approach to ensure that any potential risks associated with the iShares Ethereum Trust are mitigated."
    }
]