[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVycy0yMzAwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVycy0yMzAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Recovers Ground But Upsides Might Be Limited Above $2,300 - NewsBTC",
        "content": "Ethereum price tumbled and spiked below $2,000 on Kraken. ETH is now recovering above the $2,200 level, but the bears might be active near $2,300.\n\nEthereum started a major decline and dived below the $2,200 support.\n\nThe price is trading below $2,300 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance near $2,300 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise if there is a clear move above $2,290 and $2,300.\n\nEthereum Price Nosedives\n\nEthereum price struggled to settle above the $2,400 resistance zone. ETH also started a major decline like Bitcoin and broke the $2,200 support zone.\n\nThere was a sharp decline and the price even spiked below the $2,000 support zone. A new yearly low was formed near $1,860 and the price is now recovering losses. There was a decent increase above the $2,000 and $2,080 resistance levels.\n\nThe price climbed above the 50% Fib retracement level of the downward move from the $2,430 swing high to the $1,860 low. However, Ethereum is still below $2,300 and the 100-hourly Simple Moving Average.\n\nOn the upside, the price is facing resistance near the $2,290 level. The first major resistance is now near $2,300. There is also a connecting bearish trend line forming with resistance near $2,300 on the hourly chart of ETH/USD. The trend line is close to the 76.4% Fib retracement level of the downward move from the $2,430 swing high to the $1,860 low.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $2,300 resistance could send the price toward $2,400. The next key resistance is near $2,440. If there is a clear move above $2,400, there could be a drift toward $2,500. The next resistance sits at $2,500, above which Ethereum might rally and test the $2,620 zone.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $2,300 resistance, it could start a fresh decline. Initial support on the downside is near the $2,200 level.\n\nThe first key support could be the $2,080 zone. A downside break and a close below $2,080 might start another steady decline. In the stated case, Ether could test the $2,000 support. Any more losses might send the price toward the $1,860 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is regaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,180\n\nMajor Resistance Level – $2,300\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1kZXZlbG9wZXJzLWNvbmZpcm0tZGVuY3VuLXRlc3RuZXQtZGF0ZXMtbG9vay10by1mb2xsb3dpbmctcGVjdHJhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Developers Confirm Dencun Testnet Dates, Look To Following ‘Pectra’ Upgrade - The Defiant - DeFi News",
        "content": "Pectra is set to bolster decentralization by introducing statelessness through Verkle Trees\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nOn Jan. 4, Ethereum developers wrapped up the first All Core Devs Execution (ACDE) call for 2024.\n\nDates for Dencun’s testnet deployments were locked in during the meeting, starting with a Goerli deployment on Jan. 17. Follow-up deployments are set to go live on Sepolia and Holesky on Jan. 30 and Feb. 7 respectively.\n\nDissenters argued that 13 days may not provide sufficient time for any requisite changes to be made based on observations from the Goerli launch. However, the next ACDE call is slated for Jan. 18, meaning the scheduling could be adjusted should developers encounter any issues during the 24 hours proceeding the Goerli fork.\n\n“Most other clients felt the timeline, albeit somewhat aggressive, was acceptable,” tweeted Go Ethereum, an Ethereum client provider. “Assuming all goes well, expect client releases for Goerli next week and for Sepolia/Holesky the week of Jan. 22.”\n\nDencun will usher a significant reduction in transaction fees for Layer 2 rollups by replacing calldata with less gas-intensive blobs via EIP-4844, also known as proto-danksharding, improving data availability on Layer 2.\n\nThe Verge\n\nThe meeting then discussed what measures should be prioritized in Ethereum’s following upgrade, Pectra. Go Ethereum noted that all client teams are in favor of focusing on introducing Verkle Trees — a data structure enabling the network to become stateless, meaning clients will not need to store Ethereum’s entire state history in order to validate blocks.\n\nSpeaking at the Ethereum Community Conference in July 2022, Vitalik Buterin said instituting Verkle Trees, also called “The Verge”, will bolster the network’s decentralization by reducing the hardware requirements associated with becoming a validator.\n\n“You will be able to verify Ethereum blocks and even be a validator without having hundreds of gigabytes on your disc, which is great for decentralization,” Buterin said.\n\nGo Ethereum tweeted that the introduction of Verkle Trees will likely require more than 12 months for development at minimum, meaning Pectra is unlikely to go live in 2024. Lightclient estimated Verkle Trees could take between 18 and 24 months to realize.\n\nOther Ethereum Improvement Proposals may also be included in Pectra."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzA0L2V0aGVyZXVtLWJsb2NrY2hhaW4tZGF0YS1wbGF0Zm9ybS1ldGhlcnNjYW4tYWNxdWlyZXMtc29sYW5hLWVjb3N5c3RlbXMtYmxvY2stZXhwbG9yZXItc29sc2Nhbi_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMDQvZXRoZXJldW0tYmxvY2tjaGFpbi1kYXRhLXBsYXRmb3JtLWV0aGVyc2Nhbi1hY3F1aXJlcy1zb2xhbmEtZWNvc3lzdGVtcy1ibG9jay1leHBsb3Jlci1zb2xzY2FuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Blockchain Data Platform Etherscan Acquires Solana Ecosystem’s Block Explorer Solscan - The Daily Hodl",
        "content": "Etherscan, Ethereum’s (ETH) blockchain data explorer, has acquired its counterpart in the Solana (SOL) ecosystem, Solscan.\n\nSolscan launched in 2021 and has served more than 3 million monthly users since then, according to a press release announcing the acquisition.\n\nBoth websites offer address information, token and transaction data, application programming interfaces (APIs), dashboards and non-fungible token (NFT) metadata.\n\nMatthew Tan, chief executive and founder of Etherscan, says the Solscan team has proven their expertise and offered detailed insights and analytics.\n\n“Their expertise in making blockchain data accessible and user-friendly also aligns perfectly with our mission at Etherscan.”\n\nIn the acquisition announcement, the Etherscan team pledges to continue providing “credibly neutral and equitable access to blockchain data.” They also plan to integrate additional features across both explorers.\n\nThe Solscan purchase comes amid a particularly ascendant period for Solana. The Ethereum rival’s native token, SOL, is trading at $98.86 and is up more than 313% in the past three months. The 5th-ranked crypto asset by market is down more than 8% in the past 24 hours, however.\n\nETH, by contrast, is up around 27% since the beginning of October. The second-ranked crypto asset by market cap is trading at $2,208 at time of writing and is down more than 6.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1tYXJrZXRzLXF1aWV0LW9uLXRodXJzZGF5LTE0MDAxMzDSAV5odHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tbWFya2V0cy1xdWlldC1vbi10aHVyc2RheS8xNDAwMTMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Markets Quiet on Thursday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWphbnVhcnktNC0w0gE_aHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy1mb3ItamFudWFyeS00LTA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for January 4 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSome coins have returned to the green zone, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has increased by 0.24% since yesterday.\n\nImage by TradingView\n\nOn the hourly chart, the price of ETH is looking bullish as it is on the way to test the resistance of $2,246. If the daily bar closes near it or even above, the accumulated energy might be enough for a breakout followed by a move to the $2,280-$2,300 zone.\n\nImage by TradingView\n\nA less positive situation is on the bigger time frame. The rate is in the middle of the wide channel, which means that neither buyers nor sellers are dominating.\n\nIn this case, sideways trading between $2,200 and $2,300 is the more likely scenario.\n\nImage by TradingView\n\nOn the weekly chart, the picture is similar. If the candle closes around the current prices, traders are likely to expect a consolidation around the $2,200 zone next week.\n\nEthereum is trading at $2,238 at press time."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8wNC90cmFkZXItc2F5cy1ldGhlcmV1bS1iYXNlZC1ibHVlLWNoaXAtYWx0Y29pbi1jb3VsZC1leHBsb2RlLW92ZXItMTAwLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1jaGFpbmxpbmsv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzA0L3RyYWRlci1zYXlzLWV0aGVyZXVtLWJhc2VkLWJsdWUtY2hpcC1hbHRjb2luLWNvdWxkLWV4cGxvZGUtb3Zlci0xMDAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLWNoYWlubGluay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Trader Says Ethereum-Based Blue Chip Altcoin Could Explode Over 100%, Updates Outlook on Bitcoin and Chainlink - The Daily Hodl",
        "content": "Crypto trader and analyst Ali Martinez is expressing a bullish outlook on a top-20 Ethereum (ETH) altcoin.\n\nMartinez tells his 39,200 followers on the X social media platform that the Ethereum layer-2 network Polygon (MATIC) could appreciate by up to 115% from the current level.\n\nAccording to Martinez, Polygon is forming a symmetrical triangle pattern on the three-day chart and is on the cusp of breaking out of the pattern’s upper trend line.\n\nA symmetrical triangle pattern can be bullish or bearish – bullish if the price breaks out above the upper trend line and bearish if the price breaks below the lower trend line.\n\n“Be patient! Let the pattern fully develop, as the initial target for MATIC is set at $1.25, followed by a potential move towards $1.82!”\n\nPolygon is trading at $0.847 at time of writing.\n\nNext up is Bitcoin (BTC). Citing data from analytics platform Glassnode, Martinez says that the flagship crypto asset’s market value to realized value (MVRV) metric shows that the “next key price targets for BTC are $52,680 and $70,250!”.\n\nMVRV is the ratio of the current market cap of Bitcoin relative to the crypto asset’s realized capitalization (BTC’s market cap when the coins were last moved or acquired).\n\nTurning to Chainlink (LINK), Martinez says while the blockchain oracle could potentially appreciate to $34, a drop below the $14.20 price, which it has, invalidates the bullish outlook on the four-hour chart.\n\nChainlink is trading at $13.85 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXNldHMtYW1iaXRpb3VzLXRhcmdldC1mb3ItbDJzLWRldGFpbHPSAVNodHRwczovL3UudG9kYXkvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1zZXRzLWFtYml0aW91cy10YXJnZXQtZm9yLWwycy1kZXRhaWxzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Sets Ambitious Target for L2s: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum co-founder Vitalik Buterin is supporting a new technological shift for Layer-2 solutions based on the pioneering smart contract protocol.\n\nENS domain push for L2s\n\nLayer-2 protocols are gradually attaining maturity as each of the top chains like Optimism (OP), Arbitrum (ARB) and Polygon (MATIC) hit big numbers as it relates to ecosystem adoption, product innovation and differentiation.\n\nIn a bid to cater to the growing ecosystem of these high-performant blockchains, Vitalik Buterin is suggesting that these L2s need to keep working on (trustless, merkle-proof-based) CCIP resolvers. This developmental push will help usher in ENS subdomains that are registerable, updateable and readable directly on L2s.\n\nAll L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s.\n\n\n\nENS is super-important, it needs to be affordable!https://t.co/Ice1lTttFE — vitalik.eth (@VitalikButerin) January 3, 2024\n\nThe Ethereum Name Service (ENS) innovation came into the limelight in 2018 as it seeks to bring ease to wallet address identification. Rather than the long alpha-numeric codes that typically characterize private keys, ENS makes it possible to replace these with the user’s name with \".eth\" as the suffix.\n\nAmong the many visions Vitalik Buterin has for the blockchain, he believes it is high time L2s also got their name service with a rare incentive boost — to make this name service more affordable. This integration call, if perfected, will serve as a major growth push for Layer-2 protocols to function more effectively and attract new users into their ecosystems.\n\nLeveling playing ground\n\nA growing number of Ethereum Layer-2 protocols are differentiating their solutions in a bid to gain the technological advantage that can help them secure a dominant spot in the ecosystem.\n\nShould the call to integrate the Ethereum Name Service be adhered to, it will ultimately level the playing ground for these protocols concerning bolstering user experiences and engagements as a whole.\n\nThe digital currency ecosystem is evolving in no small measure, with Ethereum particularly facing competition from market rivals like Solana (SOL), Cardano (ADA) and Avalanche (AVAX). The call for ENS integration is a move to help the protocol maintain its dominance in the smart contract world."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWV0aGVyZXVtLWV0Zi1saWtlbHktZGVidXQtMjAyNC1zZWMtY29tbW9kaXR5LWFuYWx5c3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ether ETF likely coming, as SEC 'implicitly' nodded ETH as commodity: Analyst - Cointelegraph",
        "content": "The United States Securities and Exchange Commission implicitly accepted Ether (ETH) as a commodity when it approved ETH futures exchange-traded funds (ETFs) last year — meaning a spot ETF variant is likely set for this year — according to Bloomberg ETF analyst James Seyffart.\n\nSpeaking during CryptoQuant’s private webinar on Jan. 4, Seyffart alluded to the approval of Ether futures ETFs in October 2023, noting that the SEC did not challenge the coin’s classification through the ETF registration process with the Commodity Futures Trading Commission (CFTC).\n\n“The CFTC is blatantly calling Ethereum a commodity. They do not call them securities. [...] The SEC has approved Ethereum futures ETFs. So again, Gary Gensler will not explicitly say whether Ethereum is a security or a commodity, but in their action, by approving those Ethereum futures ETFs, they’re implicitly accepting those Ethereum futures as commodities futures.”\n\nSeyffart said the SEC likely had no bandwidth to dispute the classification.\n\nThe first Ether futures ETFs in the U.S. were listed for trading on Oct. 2, with several investment firms launching a total of nine funds on the Chicago Board Options Exchange, including ProShares, VanEck, Bitwise, Valkyrie, Kelly and Volshares. According to Seyffart, the SEC could find itself in court and have to unlist futures ETFs if it were to deem Ether a security.\n\nThe classification matters since securities and commodities ETFs face different legal requirements, with different taxes and regulatory burdens attached to securities.\n\nHere we go … expect more spot #ethereum ETFs filings in the coming days.\n\n\n\nNOTE: this is an S-1 and not a 19b-4. Which means it does not start a clock in any way … yet. Expect 19b-4’s soon. https://t.co/sNus2vr5qV — James Seyffart (@JSeyff) September 6, 2023\n\n“It wouldn’t just be the SEC going against the crypto industry. If they call Ethereum a security, it’ll be going against their sister regulator, CFTC. [...] That’s why I think we could see potential Ethereum ETFs approved this year as well,” the analyst noted.\n\nThe SEC recently lost a court case under a similar dispute in which it exempted the Spikes Index — a stock volatility index — from the definition of security futures under claims of promoting competition among such indexes. “There’sr precedent here to say it matters how these things are registered,” said Seyffart.\n\nThe SEC has a final decision deadline for VanEck, ARK 21Shares and Hashdex’s spot Ether ETF in May 2024, with other decision deadlines coming in the months following.\n\nBefore then, however, the regulator must disclose its verdict on spot Bitcoin (BTC) ETFs. Seyfartt predicts an approval by Jan. 10, with $10 billion flowing into Bitcoin ETFs within 12 months.\n\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi0yMC1kb3duLXJpc2stYXMtc3VwcG9ydC1mYWxscy_SAVlodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjAtZG93bi1yaXNrLWFzLXN1cHBvcnQtZmFsbHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction Signals 20% Downside Risk As 60-Day Support Falls - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH), the world’s second-largest cryptocurrency, has been experiencing a lateral trading pattern for over a month, fluctuating between two key levels at $2400 and $2137. The appearance of daily candles with rejection wicks at both ends signifies a prevailing uncertainty among investors. Recently, a sharp market downturn, partly attributed to speculated rejections of spot Bitcoin ETFs by the US SEC as reported by Matrixport, a digital asset financial services firm, resulted in a notable 6.5% drop in the ETH price. This decline led to the breach of a crucial support trendline, hinting at the risk of further corrections.\n\nIs Ethereum Headed for a Steeper Slide?\n\nA bearish breakdown below the support trendline hints at an early upcoming correction.\n\nA healthy retracement in ETH price should bolter buyers to revive exhausted bullish momentum,\n\nThe intraday trading volume in Ether is $19.3 Billion, indicating a 53% gain.\n\nOver the past eight weeks, the Ethereum price has shown signs of recovery, evident from an ascending trendline on the daily chart. This trendline has historically served as a strategic buying point for investors during market dips, indicative of a robust recovery.\n\nadvertisement\n\nHowever, during the current period of consolidation, Ether has been facing substantial resistance at the $2400 mark. The recent downturn, coinciding with the broader market sell-off, pushed the price below both the 23.6% Fibonacci retracement level and the established support trendline.\n\nIf the daily candlestick closes beneath this critical threshold, it could pave the way for sellers to exert additional downward pressure, potentially triggering a further 20% price decline, bringing the ETH price down to approximately $1750.\n\nEthereum Long-Term Holder Ratio Surpasses Bitcoin\n\nWhile current short-term trends suggest a cautious or downward trajectory for the Ethereum price, an analysis of the “Holder Ratio” chart presents a promising outlook for the cryptocurrency. In a retrospective of 2023, on-chain data from Intotheblock showcased on the X-platform, revealed that the proportion of long-term Ethereum holders exceeded that of Bitcoin for the second time. This vital statistic underscores a growing trend of Ethereum investors committing to hold their assets for extended periods, outpacing similar commitments among Bitcoin investors. This increase in long-term holding is significant as it reflects deepening confidence in Ethereum’s prospects and stability\n\nRelative Strength Index (RSI): The daily RSI slope drops below the midline reflecting the sellers are strengthening their group over\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(50, 100, and 200) hints the broader market is strongly bullish.\n\nRelated Articles:"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2luc2lnaHRzL3RoZS10aHJlZS13ZWVrLXRyZW5kLW9mLWJpdGNvaW4tc3VycGFzc2luZy1ldGhlcmV1bS1pbi10cmFuc2FjdGlvbi1mZWVzLWhhcy1jb21lLXRvLWFuLWVuZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "The three-week trend of Bitcoin surpassing Ethereum in transaction fees has come to an end - CryptoSlate",
        "content": "Quick Take\n\nA recent uptrend in Bitcoin transaction fees is a development that has proven beneficial for miners. From Dec 14 to Jan 3, Bitcoin consistently surpassed Ethereum regarding transaction fees, marking three weeks.\n\nWhile not unprecedented, this phenomenon was noteworthy given the typically lower Bitcoin transaction fees. Interestingly, a similar trend surfaced briefly in November when Bitcoin transaction fees outpaced Ethereum’s for three days.\n\nHowever, this recent streak fell short of the record set in 2017, when Bitcoin transaction fees outperformed Ethereum’s for roughly a year. While the recent trend has concluded, the fluctuation in transaction fees between the two digital assets remains a point of interest.\n\nStakeholders are urged to monitor these trends as they could have significant implications for mining profitability and the broader digital asset market dynamics."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjQvMDEvMDQvZXRoZXJldW0taW5zaWRlci1zYXlzLXhycC13aWxsLXNoaW5lLXBsYW5zLXRvLWJlY29tZS14cnAtaW52ZXN0b3Iv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Insider Says XRP Will Shine, Plans to Become XRP Investor - The Crypto Basic",
        "content": "As the crypto community anticipates the bull market’s peak, early Ethereum advisor Steven Nerayoff has made favorable predictions for XRP.\n\nNerayoff speculated that XRP will shine in the bull market. According to the crypto advisor, the current bull market started after Ripple secured a legal victory against the United States Securities and Exchange Commission (SEC).\n\nThe Ethereum advisor explained that Ripple’s legal victory helped clear concerns about uncertainty, leading to the commencement of a bull market.\n\n- Advertisement -\n\nRecall that Ripple recorded a partial victory against the SEC last year, where a federal judge declared that XRP in itself does not constitute a security as alleged by the regulator.\n\nInterestingly, Nerayoff noted that the current bull market is a catch-up time for XRP, as the coin missed out on the previous bull market due to the SEC v. Ripple legal tussle.\n\nYes, arguably Ripple’s legal victory started this bull run! It’s catch-up time for the last bull run. — Steven Nerayoff (@StevenNerayoff) January 1, 2024\n\nHow the SEC Lawsuit Affected XRP Performance in the 2021 Bull Market\n\nFor context, the SEC charged Ripple with offering XRP as an unregistered security in December 2020. The regulator introduced the lawsuit shortly before most crypto assets, including Bitcoin and Ethereum, recorded new all-time highs (ATHs).\n\n- Advertisement -\n\nWhile several crypto assets registered new ATHs in 2021, XRP traded at $1.96 on April 2021, 50% below its previous ATH of $3.4 set on January 4, 2018.\n\nWith a federal judge declaring XRP to be a non-security, Nerayoff believed that this bull run was XRP’s turn to shine. Although he did not give any price prediction for XRP, he speculated that the asset would make up for its low performance in the previous bull market.\n\nNerayoff Plans to Invest in XRP\n\nIn the meantime, Nerayoff has disclosed plans to invest an undisclosed amount in XRP. He made this known after a crypto enthusiast asked him whether he owned XRP.\n\nResponding, Nerayoff said he has not invested in XRP but hopes to do so soon. However, he did not provide any hint about when he plans on investing in the sixth-largest cryptocurrency by market capitalization.\n\nNo. I’m not invested in Ether or XRP as I didn’t want anyone to say I was biased. I would be an investor in XRP & have publicly spoken about my belief in them since 2014. (I have a tiny amount of Ether bc I need to pay the ETH Cabal for their exorbitant gas fees). — Steven Nerayoff (@StevenNerayoff) January 1, 2024\n\nCan XRP Surpass Its Previous ATH?\n\nMeanwhile, despite many analysts emphasizing that the bull market has already started, XRP was trading at $0.58, down 82.9% from its previous ATH of $3.4.\n\nThese analysts predict that the bull market will reach its peak after the upcoming Bitcoin Halving, which is expected to occur in April 2024.\n\nHistorically, the prices of various crypto assets, including BTC and XRP, usually skyrocket several months after every Bitcoin Halving. Whether the same pattern will repeat itself in the coming months remains to be seen.\n\nXRP Community Predicts XRP Price in Bull Market\n\nIn the meantime, XRP community members participated in an X survey to predict the final price of the digital asset in this bull market.\n\nOut of the 533 X accounts that participated in the survey, the majority of them, representing 38.1%, projected that XRP could surge to $12 and above in the bull market.\n\nIn addition, 23.5% of the participants forecast that XRP could surge and end the bull market at around $8 – $12. Notably, a number of participants, representing 18.4%, predict that XRP will trade below $2.\n\nWhat’s Your $XRP Peak Price Prediction in 2024? ?? Vote Below!?? — Good Morning Crypto (@3TGMCrypto) January 2, 2024"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sMnMtc3VycGFzc2VkLWFsbC1vdGhlci1ibG9ja2NoYWlucy1ieS10dmwtZGV0YWlsc9IBT2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sMnMtc3VycGFzc2VkLWFsbC1vdGhlci1ibG9ja2NoYWlucy1ieS10dmwtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum L2s Surpassed All Other Blockchains by TVL: Details - U.Today",
        "content": "Advertisement\n\nEthereum Foundation contributor Josh Stark noticed a major achievement for Ethereum-based ecosystem of second-layer networks. In 2021, 20% of his followers were sure that this \"flippening\" would never happen.\n\nEthereum (ETH) L2s accomplished historic milestone\n\nIn the first days of 2024, the aggregated sum of value locked in Ethereum-based L2 protocols exceeded that of all non-Ethereum blockchains. While Ethereum L2s are responsible for $20.7 billion in equivalent, the rest of blockchains amassed $19.6 billion, as noticed by Stark today, Jan. 4, 2024.\n\nit happened 🎉\n\n\n\n- Ethereum L2s = $20.7 billion\n\n- Other L1s = $19.67 billionhttps://t.co/o38jqwnHJC pic.twitter.com/uqWAqWkJUC — Josh Stark (@0xstark) January 4, 2024\n\nMeanwhile, he stressed that the metrics cannot be treated as exactly similar: For second-layer networks, the indicator refers to the sum of assets on L2, including native tokens. For L1s, the metrics reflect the sum of assets locked in dApps on this or that blockchain.\n\nThe analyst used L2Beat's data for tracking second-layer blockchains and DefiLlama to analyze what is happening on non-Ethereum L1s.\n\nIt is interesting that back in September 2021, he asked his audience about the date of this \"L2-over-L1\" flippening. While the majority of his followers were sure that this fact could take place in 2022, 20% answered that it would never happen.\n\nThe L2s ecosystem was 20 times smaller than the L1s one, as of the date of the first voting. During the crypto winter, this gap became even more dramatic; its peak was reached amid the Terra/Luna collapse in Q1, 2022.\n\nArbitrum (ARB) dominance inches closer to 50% again\n\nAs demonstrated by L2Beat, the ecosystem of Ethereum's L2s registered an all-time high in TVL on Jan. 2, 2024. The metric jumped above $20.78 billion in equivalent, adding over 330% in just one year.\n\nThe L2s scene remains heavily \"concentrated\": Only five networks — Arbitrum (ARB), OP Mainnet (Optimism, OP), Base, Metis Andromeda and Manta Pacific — are responsible for over 90% of its TVL.\n\nArbitrum (ARB), the largest Ethereum-based L1, is rebuilding its dominance after a small decline. As of printing time, it is one step away from the 50% barrier.\n\nFor the closest competitor, OP Mainnet, this indicator equals 28.65%, L2Beat data says."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lnh0Yi5jb20vaW50L21hcmtldC1hbmFseXNpcy9uZXdzLWFuZC1yZXNlYXJjaC9jaGFydC1vZi10aGUtZGF5LWV0aGVyZXVtLTA0LTAxLTIwMjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Chart of the day - Ethereum (04.01.2024) - XTB",
        "content": "Testing phase begins on January 17, 2024, on the Goerli network.\n\nSubsequent tests on the Sepolia and Holesky networks on January 31 and February 7, 2024, respectively.\n\nIntroduction of \"proto-danksharding\" to enhance data storage and reduce gas fees.\n\nAnticipated positive impact on Ethereum's market performance and network activities.\n\nIn 2024, Ethereum is set to undergo significant upgrades, with the Dencun update being a pivotal development. The upgrade's testing phase is scheduled to commence on January 17, 2024, on the Goerli network, followed by tests on the Sepolia and Holesky networks. The Dencun upgrade, marking a considerable progression since the Shapella hard fork, aims to enhance Ethereum's scalability and operational efficiency, particularly in data storage capacity. A key feature of this upgrade is the introduction of \"proto-danksharding,\" expected to substantially increase the network's bandwidth and optimize performance.\n\nThis upgrade is expected to address key challenges of scalability and efficiency, potentially marking a landmark achievement in Ethereum's evolution towards a more scalable and efficient blockchain ecosystem.\n\nIn 2023, Ethereum remained in the shadow of Bitcoin, recording a lower rate of return. However, many indications suggest that this trend may reverse this year. From a technical perspective, maintaining the support zone around 2130 USD will be crucial for Ethereum in the short term. This level was tested yesterday during a brief panic caused by heated emotions.\n\nSource: xStation 5"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9lbnMtZXRoZXJldW0tbmFtZS1zZXJ2aWNlcy1yaXNlcy1idXRlcmluLWVuZG9yc2VtZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "\"Super-important\" ENS Rises Following Buterin Endorsement - CCN.com",
        "content": "E Key Takeaways\n\nVitalik Buterin has called Ethereum Name Service (ENS) “super important” triggering a spike in the market price of the protocol’s governance token.\n\nIn the past 24 hours, ENS has pumped over 40%.\n\nMeanwhile, the overall crypto market is down over 5% in the same period.\n\nIn the past 24 hours, Bitcoin has led a crypto market crash after Matrixport struck a blow to traders’ confidence that the Securities and Exchange Commission will approve spot Bitcoin ETFs next week. But one token – Ethereum Name Service (ENS) – has bucked the wider market trend.\n\nAt a time when BTC and other leading cryptocurrencies fell between 5% and 10% in 24 hours, ENS surged more than 40% after Ethereum founder Vitalik Buterin endorsed it.\n\nButerin Backs More Affordable ENS\n\nIn a recent post on Twitter, Buterin discussed upgrades to the Ethereum ecosystem that could promote the use of ENS.\n\nArguing that ENS “needs to be affordable,” he endorsed the use of Chainlink’s cross-chain interoperability protocol (CCIP) to make ENS subdomains registerable, updateable and readable directly on Ethereum layer 2 scaling solutions. In line with the renewed interest in L2 scaling incorporated in Buterin’s latest Ethereum roadmap, this approach could significantly boost ENS adoption by driving down the costs associated with registering and managing Web3 domains on the blockchain.\n\nAll L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s. ENS is super-important, it needs to be affordable!https://t.co/Ice1lTttFE — vitalik.eth (@VitalikButerin) January 3, 2024\n\nThe costs associated with ENS are typically paid in ETH. However, the eponymous governance token is an important feature of the technology. It can influence the protocol’s management and future development.\n\nWhat are ENS Subdomains?\n\nEthereum Naming Service is a decentralized domain name system that can link Ethereum addresses with human-readable domains. When combined with IPFS, the ENS protocol can even support fully decentralized web hosting, with domains referencing entire websites.\n\nENS is not just for Ethereum L1. It’s cross-chain and works especially well on L2s that post their state roots to L1. It’s also a permissionless public good that all L2s should be using and can be building on without needing to ask ENS. But we’re here to help if you are! https://t.co/udHqOx3cB6 — jefflau.eth (@_jefflau) January 3, 2024\n\nMost ENS domains consist of a top-level and a second-level domain. For example, in vitalik.eth, eth is the top-level domain and vitalik is the second-level domain.\n\nBy adding a third level, however, each domain can be divided into subdomains. This could drive adoption by approximating the Web2 domain name system in which a small number of domain owners administer services for a much larger base of end users, without needing to pay gas fees for each subdomain."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWZvdW5kYXRpb24tdGFwcy1pbi1hc2lhLWZvci1kZXZjb24tNy1hcy1yZWdpb24tcmVjb3Jkcy1oaWdoLWNyeXB0by1hZG9wdGlvbi_SAW5odHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLXRhcHMtaW4tYXNpYS1mb3ItZGV2Y29uLTctYXMtcmVnaW9uLXJlY29yZHMtaGlnaC1jcnlwdG8tYWRvcHRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Foundation Taps into Asia for Devcon 7 - CoinGape",
        "content": "Ethereum Foundation, a non-profit organization backing Ethereum, announced on Wednesday that it will host Devcon 7 in the city of Bangkok, Thailand. This comes as the blockchain aims to tap the growing crypto adoption in Asian markets.\n\nEthereum Foundation turns to Asia\n\nAs the Ethereum Foundation turns to Asia for its next conferences, the event is marked to place between November 12 and 15 in Bangkok. It notes that the conference aims to increase Devcon’s impact on regional Ethereum communities.\n\nadvertisement\n\nBased on the release, the Ethereum community is rapidly growing in Southeast Asia and holds significant potential. Meanwhile, crypto adoption is on a steady rise in the part of the globe as well. Vietnam, the Philippines, Indonesia, and Thailand are leading in the Global Crypto Adoption Index, underscoring the region’s pivotal role in the global Ethereum landscape.\n\nHosting Devcons, which is a conference for developers, and researchers, aims to bring the community across the entire region on a global platform.\n\nThe Ethereum boom in Southeast Asia since 2022\n\nAccording to research company Statista, the Asia-Pacific region is emerging as a leader in the field of digital assets. Thanks to higher institutional acceptance of cryptocurrencies, it has become one of the most widely owned and used virtual currencies in Southeast Asia.\n\nAround 78% of users in the region claim to own Ethereum-based digital assets, making it the most popular blockchain technology in the Asian region.\n\nRegulatory ease in Asia\n\nRegulations in Asian countries have been easing in the past couple of years, opening them to broader adoption. Therefore, emerging as a potential market expansion for Ethereum-based chains and applications.\n\nAccording to an OECD report, Southeast Asia is highly suitable for a rise in digital asset use. This has paved the way for governments to lay out regulatory frameworks to safeguard retail users. The trend has also slowly provided for regulations around digital assets to help mitigate consumer concerns.\n\nAlso, the report highlights possible international cooperation from governments in the region to come close to formulate laws surrounding virtual currencies for a steady and smooth rise in the customer base."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvY2t0ZWxlZ3JhcGguaW8vdXBsYW5kLWFkZHMtZXRoZXJldW0tYXMtYS1wYXltZW50LW9wdGlvbi13aXRoLW1ldGFtYXNrLWludGVncmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Upland adds Ethereum as a payment option with Metamask Integration - Block Telegraph",
        "content": "Upland, the mobile gaming metaverse, adds Ethereum as a payment option with Metamask Integration\n\nUpland, one of the most popular metaverse platforms, has announced a new integration with Metamask that allows support for Ethereum payments for its digital assets within the platform.\n\nThis strategic integration represents a further commitment to adoption with enhanced investment in features and functionality that help onboard the next generation of users. Behind all that is Dirk Lueth, Co-Founder of Upland, who is also Chairperson of OMA3, the Open Metaverse Alliance. He understands the need for collaboration, seamless user onboarding and the challenges facing the metaverse as a whole.\n\nhttps://x.com/UplandMe/status/1742304764933615850?s=20\n\nGaming sector continues to drive adoption\n\nAfter a stream of interesting posts from Upland on platform X users are beginning to understand the adoption rate of the platform. In 2023, over 1.5 million NFTs were minted and there were over 227 million total transactions. Despite the bear market, Upland has capitalized on the gaming sector by launching highly engaging features, easy onboarding and being a mobile-driven application.\n\nThe Open Metaverse is on the right track\n\nLaunched in 2020, Upland has transitioned from a property trading game to become a driving force in the development of the world’s most expansive digital economy. Merging the thrill of playing with digital assets with the potential of blockchain, Upland offers a diverse metaverse experience, featuring everything from virtual cafes, car racing, self-expression via wearables and customization options for world-building to strategic partnerships with global entities like FIFA.\n\nAs a key participant in the Open Metaverse Alliance, Upland champions open standards, facilitating seamless asset portability and data transfers between different metaverses. With a commitment to innovation, the team stands at the forefront of shaping the future of the metaverse.\n\nMetamask continues expansion of payment and wallet features\n\nThis follows a series of announcements by Metamask to improve user experience of the application in the third quarter of last year. One significant release was a feature called Metamask Snaps, allowing users to choose from a wide range of dApps or add-ons for their Metamask browser extension. This adds to their commitment to permissionless technology. The fact that developers maintain ownership over the creations and their code is a significant feature of Web3. It offers more user centric control and is a departure from traditional app store processes.\n\nTowards the end of last year Metamask announced a Stripe integration to expand crypto on-ramp options. As one of the most popular Ethereum and alt-coin wallets servicing over 30 million users, this was a major feature update."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1zLWV4aXQtcXVldWUtanVtcHMtdG8tcmVjb3JkLWhpZ2gtYXMtY2Vsc2l1cy11bnN0YWtlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Exit Queue Jumps To Record High As Celsius Unstakes - The Defiant - DeFi News",
        "content": "Celsius said it is consolidating assets before distributing funds to creditors\n\nBy: Samuel Haig • Loading...\n\nCrypto News\n\nThe waitlist for Ethereum stakers seeking to exit the network has jumped to a record high as Celsius moves to unstake its ETH holdings.\n\nThe queue for stakers exiting Ethereum’s consensus layer, the Beacon Chain, surged to a record high of 16,283 validators on Jan. 4 — significantly beating out its previously high of 3,829 from Dec. 4, according to Validator Queue.\n\nThe waitlist is projected to take five and a half days to clear. A maximum of 13 validators can offboard per epoch, with each epoch lasting roughly 6.4 minutes.\n\nEthereum validator exit queue. Source: Validator Queue.\n\nAnalysts have attributed the move to Celsius, the failed CeFi lender, announcing it will unstake all of its existing Ether holdings on the same day. Celsius said it is in the process of recalling and rebalancing assets in preparation to distribute assets to creditors. In August, Celsius said it plans to distribute nearly $2B worth of BTC and possibly ETH to creditors.\n\n“The significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors,” Celsius tweeted.\n\nCelsius filed for bankruptcy in July 2022 after halting user withdrawals one month earlier. A July 2023 settlement with the U.S. Federal Trade Commission found that Celsius had misappropriated more than $4B worth of customer funds prior to suspending operations.\n\nOn Dec. 20, An Ape’s Prologue, a web3 researcher, tweeted that Celsius had sold $243M worth of Ether over 30 days. Data from Arkham Intelligence suggests Celsius still holds $227M worth of ETH.\n\nEther ETF speculation runs rampant\n\nDespite the looming possibility that Celsius may move to liquidate the remainder of its sizable Ether holdings, many onlookers believe spot ETF speculation could soon drive gains for ETH.\n\nWith prominent analysts tipping that the U.S. Securities and Exchange Commission (SEC) may greenlight the first spot Bitcoin ETF next week, an increasing number of researchers are turning their attention to Ether as the next likely candidate for spot ETF approval.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\n“Expect more spot Ethereum ETFs filings in the coming days,” tweeted James Seyffart, a Bloomberg analyst who expects the SEC to approve an initial cohort of spot Bitcoin ETFs sometime around Jan. 10.\n\nDuring a webinar hosted by CryptoQuant on Jan. 4, Eric Balchunas, a fellow Bloomberg analyst, argued that the launch of Ether futures ETFs in October implicitly treats ETH as a commodity and paves the way for a spot ETF to also receive approval.\n\n“By approving those Ethereum futures ETFs, they’re implicitly accepting those Ethereum futures as commodities futures,” Balchunas said. “If they call Ethereum a security, it’ll be going against their sister regulator, CFTC... That’s why I think we could see potential Ethereum ETFs approved this year as well.”\n\nSatoshi Flipper, a popular trader and analyst, argued that Ether’s current price does not reflect its spot ETF prospects.\n\n“Not even 1 cent of the proposed spot ETH ETF has been priced in yet,” they tweeted. In my humble opinion… if the market was rational and forward-thinking, the price of ETH would shoot to $3,000 upon the spot BTC ETF approvals this week.”\n\nDCinvestor, a prominent investor and web3 influencer, shares the sentiment.\n\n“Once the BTC ETF hits, literally everyone in the newly emergent ‘TradFi crypto sector’ will be looking at the fact that only one other asset has CME futures, a live futures ETF, has been referred to in the past as a ‘commodity’ by the CFTC and prior SEC chairs,” they tweeted. “It’s ETH.”"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vZmluYm9sZC5jb20vdW5wYWNraW5nLXRoZS1yaXNlLW9mLW51Z2dldHJ1c2gtYW5kLWV0aGVyZXVtLWNsYXNzaWMtYS1uZXctZXJhLWluLWNyeXB0by1zZW50aW1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Unpacking the Rise of NuggetRush and Ethereum Classic: A New Era in Crypto Sentiment? - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nTLDR\n\nNuggetRush (NUGX) is a pioneering gaming project blending GameFi with the Metaverse, offering thrilling experiences where players explore mines for tangible treasures. With a successful presale, NUGX has become a dominant force in crypto.\n\nis a pioneering gaming project blending GameFi with the Metaverse, offering thrilling experiences where players explore mines for tangible treasures. With a successful presale, has become a dominant force in crypto. Ethereum Classic (ETC) surged to $22.88 on December 9, 2023, during a crypto market rally but later dipped to trade sideways at $20.92 by December 24. Despite market concerns, ETC announced the completion of its Spiral Network Upgrade.\n\nIn the ever-evolving landscape of cryptocurrency, two notable projects have recently taken center stage: NuggetRush (NUGX) and Ethereum Classic (ETC). While NuggetRush revolutionizes the gaming sphere by seamlessly integrating GameFi with the Metaverse, Ethereum Classic anticipates a significant shift with its upcoming Spiral Network Upgrade. Continue reading to explore the new era in crypto sentiment.\n\n>>Buy NuggetRush Now<<\n\nNuggetRush (NUGX): Revolutionizing Gaming with GameFi and Metaverse Integration\n\nNuggetRush (NUGX) is a project that provides thrilling gameplay experiences and impact gaming. It blends GameFi with the Metaverse. By utilizing NuggetRush’s (NUGX) concept, players explore mines and seek treasures with tangible value in the physical world.\n\nNuggetRush (NUGX) has dominated the crypto space, with its presale attracting many investors as it progresses. Its underlying token, NUGX, is selling out quickly, and many investors appear to be rushing to acquire the crypto, hoping to enjoy massive ROI.\n\nDesigned with a hard cap of 215 million NUGX tokens distributed in five presale stages, the crypto is shaping up to become a dominant force in the crypto industry. The blockchain ICO has already sold over 128 million tokens and raised over $1.45 million.\n\nThis advanced NuggetRush (NUGX) game incorporates trending NFTs to act as game characters, providing gamers with distinct capabilities to win in-game rewards. NuggetRush ranks top among the cryptos expected to explode in 2024, and investors keep buying due to its many utilities that support its growth potential.\n\nNuggetRush users get many rewards, including tangible cash and physical gold sent to their designated destinations. Players who are conscious about their communities enjoy participating in this game since the gameplay helps support artisanal miners who work from underdeveloped countries.\n\nBy joining NuggetRush’s (NUGX) community, Rush Guild, token holders get unlimited VIP access to discounts, bonuses, and rewards. Many aspects and components of NuggetRush make it the best crypto investment in 2023, including its staking protocol that offers investors 20% APY for their staked assets.\n\nCurrently, in round 4 of its presale, NUGX is selling out quickly, valued at $0.015, and will rise further as the presale progresses. NUGX’s mainstream market listing price is $0.020, a 33.33% profit for the current buyers.\n\n>>Buy NuggetRush Now<<\n\nEthereum Classic (ETC): Navigating Price Volatility and Anticipating Growth with the Upcoming Spiral Network Upgrade\n\nOn December 9, 2023, Ethereum Classic (ETC) surged to a monthly high of $22.88. The token surged along with the crypto market rally. Since then, Ethereum Classic (ETC) dipped to trade sideways. As of December 24, Ethereum Classic (ETC) had dropped to trade at $20.92.\n\nAmid the sideways movement for ETC, Ethereum Classic made a notable announcement. On December 12, Ethereum Classic highlighted that its Spiral Network Upgrade will be completed by January 31, 2024. This upgrade will help bring the network up to date and introduce parity to Ethereum Classic with the Shanghai Upgrade implemented on Ethereum (ETH).\n\nAs Ethereum Classic waits for the upgrade to be completed, analysts have turned bearish on the price of ETC. They project that ETC will trade sideways and even plunge in the coming weeks before surging again after the upgrade is completed. Nonetheless, the crypto seems resilient and has remained stable amid the recent meltdown in the market.\n\nOn December 31, ETC was trading at $22.20. Analysts expect ETC to rise to $25.50 in January 2024, supported by the Spiral Network Upgrade. Hence, ETC is a good crypto to buy today.\n\nVisit NuggetRush Presale Website"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJlYXRzLWV0aGVyZXVtLWluLW5mdC1zYWxlcy1hZ2Fpbi1kZXRhaWxzLWhlcmUv0gFRaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tYmVhdHMtZXRoZXJldW0taW4tbmZ0LXNhbGVzLWFnYWluLWRldGFpbHMtaGVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum falls behind Bitcoin in NFT sales again, details here - AMBCrypto News",
        "content": "NFT sales volume on the Bitcoin network exceeded Ethereum in December.\n\nThis occurred despite Ethereum recording a higher transaction count.\n\nThe Bitcoin [BTC] Network outpaced Ethereum [ETH] as the blockchain with the highest non-fungible token (NFT) sales volume in December, marking the second such occurrence in just two months.\n\nAccording to data from CryptoSlam, in December, NFT sales on the Bitcoin network totaled $881 million compared to Ethereum’s $353 million.\n\nIn November, NFT sales on Ethereum fell behind those recorded on the Bitcoin network by almost 10%, to mark the first time in history that the latter would record a higher sales volume than the former.\n\nThe surge in NFT activity recorded on the Bitcoin network in the last two months can be attributed to the resurgence in interest in inscriptions and Ordinals on the blockchain.\n\nDue to the high activity, by 16th December, the Bitcoin network recorded a single-day high of $10 million paid as fees to mint inscriptions on the blockchain, according to data from Dune Analytics.\n\nAlso, the activity of Inscriptions and Ordinals on the Bitcoin network resulted in an uptick in demand for blockspace. As of 18th December, AMBCrypto found that activity around inscriptions accounted for 39% of the virtual blockspace on the network.\n\nInterestingly, while Ethereum witnessed a lesser sales volume than the Bitcoin network, it recorded a higher transaction count in December. AMBCrypto found that the total count of NFT transactions completed on Ethereum during the 31-day period totaled 698,201.\n\nOn the other hand, the Bitcoin network registered only 493,516 transactions.\n\nThe market so far this month\n\nWith four days into the new trading year, the Bitcoin network remains in the lead regarding NFT sales transactions. So far this year, the chain has recorded a sales volume of $61.08 million.\n\nHowever, Ethereum has seen an NFT sales volume of $27 million, according to data from CryptoSlam.\n\nDespite the high activity on the Bitcoin network, the general market has witnessed a retracement in NFT sales activity in the last week. Data from NFTGo showed a decline in NFT sales volume and market capitalization in the last seven days.\n\nInformation from the data provider showed that NFT sales volume in the general market had totaled $116 million in the last week, dropping by 10%.\n\nLikewise, the NFT market capitalization had reduced by 3% during the same period."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdS50b2RheS93aGFsZXMtYnV5aW5nLWV0aGVyZXVtLWV0aC1hbmQtYml0Y29pbi1idGMtZHVtcNIBQ2h0dHBzOi8vdS50b2RheS93aGFsZXMtYnV5aW5nLWV0aGVyZXVtLWV0aC1hbmQtYml0Y29pbi1idGMtZHVtcD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Whales Buying Ethereum (ETH) and Bitcoin (BTC) Dump - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA recent plummet in the value of Bitcoin (BTC) and Ethereum (ETH) has caught the attention of whales who were looking for good entries. Notably, two whale wallets have seized this dip as an opportunity, making substantial purchases of WBTC and ETH at what many are considering \"the bottom.\"\n\nAdvertisement\n\nThe wallet designated as 0x8B20 took a bullish stance, deploying a total of $3 million USD in stablecoins to acquire 35.18 WBTC at $42,641 each and 674.18 ETH at $2,225 each.\n\nThis strategic action by cryptocurrency whales is a significant indicator of strong market sentiment. Such movements often suggest a belief among experienced investors that any forthcoming dips in price will be short-lived, offering quick recovery and providing upward momentum. Following the whales' lead, the crypto market has recouped over 5% of its value, suggesting resilience and a possible trend reversal on the horizon.\n\nThe potential approval of a Bitcoin ETF is a critical factor that could catalyze a market turnaround. Despite the common \"sell the news\" events that often follow such announcements, the approval of a Bitcoin ETF would likely boost investor confidence, attracting institutional money.\n\nAs the market navigates through these turbulent waters, the actions of whale investors offer a glimmer of optimism. The significant investments from these large-scale holders suggest a belief in the enduring value of cryptocurrencies like Bitcoin and Ethereum. If the ETF receives the green light, we may well witness a significant rally, affirming the whales' bullish maneuvers and potentially leading to a market reversal that could reshape the investment landscape."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbnMtdG9rZW4tc3VyZ2VzLTcwLXZpdGFsaWstYnV0ZXJpbi1sYXVkcy1wbGF0Zm9ybS1zdXBlci1pbXBvcnRhbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "ENS token surges 70% as Vitalik Buterin lauds platform as 'super important' - Cointelegraph",
        "content": "The governance token of the Ethereum Name Service (ENS) surged by 72% on Jan. 3 after the domain platform received praise from Ethereum co-founder Vitalik Buterin.\n\nIn a Jan. 3 post to X (formerly Twitter), Buterin lauded the Ethereum Name Service as “super important” and reiterated that the platform should remain accessible and affordable to all users of the Ethereum network, especially those on layer-2 networks.\n\nAll L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s.\n\n\n\nENS is super-important, it needs to be affordable!https://t.co/Ice1lTttFE — vitalik.eth (@VitalikButerin) January 3, 2024\n\n“All L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s,” said Buterin.\n\nButerin believes that layer-2 networks such as Optimism, Arbitrum and Polygon — which form an essential part of the Ethereum networks’ long-term scalability — should be able to register ENS addresses to further their ease of use.\n\nThe ENS token surged 72% after an X post from Buterin. Source: CoinMarketCap\n\nShortly following Buterin’s X post, the price of the ENS token surged from a yearly low of $8.50, climbing more than 72% to reach an eight-month high of $14.70, per CoinMarketCap data. The price of ENS has since leveled out and is currently trading at $12.90 at the time of publication.\n\nENS notched an all-time high of $74.25 on Nov. 28, 2021, around the same time the broader crypto market began to tumble and rapidly descended into an enduring industry-wide bear market.\n\nRelated: ENS developers urge Unstoppable Domains to drop patents or face lawsuit\n\nThe Ethereum Name Service allows crypto users to purchase a “.eth” domain name. This can replace the complex string of letters and numbers that typically comprise a user’s wallet address, making it easier to transfer and receive funds between parties on the Ethereum network.\n\nIn September 2022, Buterin proposed introducing a 3% tax on ENS domain names, dubbed the “Harberger” tax proposal. Buterin said this would prevent the hoarding of domain names among early users looking to maximize profits, enabling wider adoption and more decentralized ownership of ENS addresses.\n\nMagazine: Which gaming guild positioned itself best for the bull market?"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItamFudWFyeS0zMS0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum price for January 31, 2024 - Finbold - Finance in Bold",
        "content": "The broader cryptocurrency market has experienced losses driven by the sudden dip in the price of Bitcoin (BTC), and the largest altcoin, Ethereum (ETH), wasn’t spared. Investors might wonder whether this is the beginning of a bear cycle or that tides might change soon.\n\nGiven the circumstances, Finbold sought the support of CoinCodex to employ its AI-powered machine-learning algorithms to assess the expected price of ETH by the end of the month.\n\nThese algorithms evaluate ever-changing market conditions and scrutinize relevant indicators to forecast the likelihood of this cryptocurrency experiencing gains by the conclusion of January.\n\nAccording to the algorithms, the projected price for ETH is expected to increase to $2,285 by January 31, reflecting a 2.60% rise from its present level of $2,227 as of the time of writing.\n\nETH price prediction for January 31. Source: CoinCodex\n\nAnalysts predictions\n\nThe MVRV comparison allows for evaluating whether the existing price is higher or lower than the perceived “fair value,” offering insights into market profitability.\n\nAs outlined in the Ethereum MVRV Pricing Bands, ETH’s forthcoming significant price targets at $3,830 and $5,100 were identified by cryptocurrency analyst Ali Martinez in an X post on January 2.\n\nThe potential price range of ETH according to MVRV. Source: Ali Martinez\n\nThe given range seems relatively bullish to other analysts, as momentum needs to be garnered for ETH to continue towards the price range of $3,000 and $3,500, as per crypto expert Michael van de Poppe’s post on January 3.\n\nThe potential price range of ETH. Source: Michael van de Poppe\n\nSpeaking of ranges, potential, and momentum, the current market sentiment registered by the fear and greed index toward this digital asset is in the greed section, standing at 65, as per the latest data retrieved on January 4.\n\nEthereum Fear and Greed Index is 65 — Greed\n\nCurrent price: $2,222 pic.twitter.com/objfj0pBLY — Ethereum Fear and Greed Index (@EthereumFear) January 3, 2024\n\nETH price analysis\n\nAt the time of press, ETH was trading at $2,227.82, reflecting a decline of -6.35% in the last 24 hours, adding to losses of -6.67% over the preceding week and contrary to a slight upside of 0.84% in the past 30 days.\n\nETH 30-day price chart. Source: Finbold\n\nAt the same time, TradingView’s technical indicators for Ethereum show a neutral sentiment. A summary of these indicators indicates a ‘neutral’ rating at 9, with moving averages signaling a ‘sell’ at 8. Oscillators are inclined towards a ‘neutral’ rating, registering at 8.\n\nETH technical analysis. Source: TradingView\n\nBroader cryptocurrency market trends, transaction fees, BTC price movement, and investors’ support are only some factors that may drive the ETH’s price in the coming days and months.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9yYW91bC1wYWwtbWlnaHQtYmUtZ2lnYW50aWMtY3J5cHRvLWJ1YmJsZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Raoul Pal: We Might Be In A Gigantic Crypto Bubble - CCN.com",
        "content": "Key Takeaways\n\nRaoul Pal warns of potential crypto bubble cycle.\n\nPal predicts a 20% year-on-year increase for NASDAQ by May 2024\n\nHe also thinks a Ethereum will be bullish in the first half of 2024.\n\nHe foresees sustained growth for Bitcoin beyond 2025 and the emergence of an altcoin season due to rising liquidity.\n\nFormer Goldman Sachs executive Raoul Pal recently suggested that the crypto markets might be approaching a colossal bubble cycle.\n\nIn a recent discussion with crypto enthusiast Scott Melker, the macroeconomics expert and CEO of Real Vision expressed that although he perceives the current market cycle as typical, there’s a 20% probability it could escalate into an enormous bubble cycle.\n\nMassive Bubble Scenario Possible\n\nRaoul Pal outlined his assessment of the probable future of crypto market cycles, attributing a 60% chance to a regular cycle akin to the last one or perhaps more reminiscent of the 2017 cycle, which witnessed some frenzy. He considers there to be a 20% likelihood that the current cycle might be compressed in time due to overwhelming retail demand, potentially leading to a shorter cycle than anticipated.\n\nPal reflected on the possibility that, similar to previous cycles, this one might also fall short of expectations in terms of duration. Additionally, he allocated another 20% probability to the scenario of a massive bubble cycle, comparable to those seen in 2012-2013 and 2015, driven by the now widespread ability for participation, potentially leading to extreme market behavior.\n\nPal expressed uncertainty about which of these three scenarios will materialize, but believes each holds a substantial chance of unfolding.\n\nPal observed that the prevailing investor sentiment leans towards a shorter market cycle. However, he noted that, while investors might be correct about the rising prices, they are likely mistaken about the actual duration of the cycle being shorter.\n\nHe said: “Everyone was a little shocked we didn’t have a final leg the last time around, so they’ve now got that imprint… so now they’re all expecting it to be a smaller cycle. And I always look for where the crowd can be wrong but still be right, which is [that] it goes up, but it goes up more [than they think].”\n\nEthereum Poised for Bullish Start\n\nCurrent projections for the NASDAQ suggest a possible increase of 20% year-on-year, potentially climbing to $175,000 by May 2024. In tandem, Ethereum’s trajectory, which aligns with the global liquidity index, shows a bullish trend for the first half of 2024. Predictions say it could reach around $5,300.\n\nPal revisits his “everything code” theory, highlighting the strategies of central banks in balancing the devaluation of currency to manage interest payments on burgeoning debts. This concept offers a lens to understand the recurring patterns in economic cycles.\n\nThrough an analysis of major trends since 1990, Pal identified Bitcoin and the NASDAQ as key influencers. He notes the consistent superior performance of the NASDAQ, which is expected to potentially reach between $25,000 to $30,000 by the end of the current cycle. His analysis provides a historical context to the evolving trajectories of these major financial assets.\n\nBitcoin’s Long-Term Growth and Altcoin Season Potential\n\nPal delved into Bitcoin’s cyclical nature and foresaw continued growth for the digital asset beyond 2025. He also explored the possibility of an altcoin season, fueled by increasing liquidity, indicating a broader uptrend in the cryptocurrency market.\n\nA few insights from .@RaoulGMI on the current crypto market: 1. “Don’t f*ck this up”. pic.twitter.com/1JJNx5w3Qo — Real Vision (@RealVision) November 30, 2023\n\nPal advocated for a focused approach, recommending Bitcoin and Solana as core holdings. He stressed the importance of adopting a structured strategy and allocating a small portion of investments for speculative bets.\n\nNavigating Correction and Identifying Key Trends\n\nDespite the current market correction in crypto, Pal maintained a long-term perspective, emphasizing the importance of capturing the overall trend. He suggested a potential shift in focus from Bitcoin to Ethereum, driven by upcoming events and reduced Ethereum supply.\n\nPal explained his decision to shift Ethereum holdings to Solana, citing breakout patterns on price charts and network activity. He expressed immense optimism towards the Exponential Age, urging viewers to appreciate its transformative potential."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8yMTE3Nzgvc29sYW5hLWxmZy1ldGhlcmV1bS11c2Vycy1zZWNvbmQtYWlyZHJvcC1ncmFudHMtcHJvZ3JhbdIBV2h0dHBzOi8vZGVjcnlwdC5jby8yMTE3Nzgvc29sYW5hLWxmZy1ldGhlcmV1bS11c2Vycy1zZWNvbmQtYWlyZHJvcC1ncmFudHMtcHJvZ3JhbT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Solana’s LFG Token Lures Ethereum Users, Plans Second Airdrop and Grants Program - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new Solana project called “Less Fn Gas” captured the attention of Crypto Twitter earlier this week when it airdropped 40% of its LFG token supply to Ethereum users.\n\nIt was a ploy to entice Ethereum maxis to give Solana a try—hop over the proverbial fence, see that the grass on the SOL DeFi field might actually be greener, and, well, spend less f’n gas. (That is, of course, spend less on transaction fees, which can be quite expensive on Ethereum.)\n\nAnd despite soaring to a $129 million fully diluted market cap, and then crashing down to around $25 million once the hype began to fade, the team behind the project isn’t stopping there. They’re now planning a second airdrop—one that will be even more inclusive than the first—and establish a grants program for Ethereum devs who make the switch to Solana, a pseudonymous core team member of LFG tells Decrypt.\n\nAD\n\nAD\n\nOver 50,000 ETH users claimed the LFG airdrop within the first 24 hours of the token launching on Monday. Wormhole, a popular bridge between Ethereum and Solana saw $35 million in volume the same day—the first time it’s seen an increase since Solana meme coins started cooling down last week. It apparently burned too hot too fast, though, and the token is now down roughly 80% from its peak on Tuesday.\n\nOne of the pseudonymous devs behind LFG, who goes by Bobby Axelrod (borrowing the name and likeness of the character from the Showtime series “Billions”), told Decrypt that he’s spoken with high-profile members of the Solana community about building a project to bring Ethereum users over to Solana.\n\n“I don't know how many of the 50,000 users that claimed are genuinely new to Solana, but judging by how many DMs I have asking how to set up a damn Phantom wallet, I’d guess there’s a lot,” he said, referring to the popular Solana wallet Phantom.\n\nThe project got the attention of some of the key thought leaders from the Solana community, including Kyle Salmani, Multicoin Capital founder, and even Solana’s co-founder Anatoly Yakovenko.\n\n🐉🐉🐲 check all links and always use a burner wallet https://t.co/BCUOZp3VOy — toly 🇺🇸 (@aeyakovenko) January 2, 2024\n\nAD\n\nAD\n\nEth people This is a good reason to try solana. Even if for no other reason than to insta sell https://t.co/3YYCzlAiwq — Integrated Kyle e/acc (@KyleSamani) January 1, 2024\n\nUnfortunately, scammers also noticed the quickly surging token and posted phishing links in the replies to tweets about the project. If you’ve spent any amount of time on Crypto Twitter, you know this happens all the time. But this one managed to fool the CEO and co-founder of Nest Wallet, Bill Lou, who fell victim to the wallet-draining scam.\n\nI'm devastated guys... I just got scammed out of $125k of stEth while trying to claim the $LFG airdrop. And I'm a fking founder of a wallet startup that's trying to improve wallet security... I can't believe this is happening, I've always been so careful. I saw article guide to… pic.twitter.com/x56HR2z8xK — Bill Lou (@BillLou95) January 2, 2024\n\nThat didn’t stop Crypto Twitter from degening.\n\ndidn't get drained what a start to the new year https://t.co/o2Ho9IuXpA pic.twitter.com/oirz8nyBC2 — DeeZe 🫡 (@DeeZe) January 1, 2024\n\nPopular pseudonymous crypto trader Deeze took to Twitter to show he had claimed his airdrop, and fellow trader 0xQuit put out a thread featuring a brief security audit where the token contract was declared safe.\n\n3/ On the SOL side, you'll see something like this: I will not pretend to be an expert on the SVM, but the transaction looks fairly straight forward. If you want to be safe, claim using a fresh Solana wallet. pic.twitter.com/CBJJzKme6E — quit (👀,🦄) (@0xQuit) January 1, 2024\n\nSo what’s next for LFG? ‘Tis the season for airdrops, so more is on the way, Axelrod says. The first one was limited to Ethereum wallets that had spent more than $4,269 in gas during the last 12 months. The next one will target a wider audience—users only will have to have spent $1,000 in gas to be eligible. Additionally, LFG will be airdropping tokens to a few additional buckets including developers on Ethereum who have deployed a smart contract, users who have interacted with major Solana protocols, and people who put up liquidity for the LFG token.\n\nAD\n\nAD\n\nAxelrod said the LFG project is now also focused on bringing Ethereum developers to Solana. “A big part of this [second] airdrop is going to be geared towards people who have deployed contracts on Ethereum,” he said.\n\nThe LFG dev added that Less Fn Gas also plans to use a portion of its treasury to start a decentralized grants program. Ethereum developers will be able to apply for grants, paid in LFG, to build on Solana.\n\nIt’s unclear if the project has legs, given how far it’s fallen from its peak already. But with so many prominent figures from the Solana ecosystem seemingly rooting for it, anything is possible.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbmV3cy8yNC8wMS8zNjQ4NzQ3Ny9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLWNyYXNoLXdpdGgtNjAwbS1sb25ncy1saXF1aWRhdGVkLXRydW1wLWJlZ2lucy1iYXR0bGUtdG8tcmV0YWluLWNvbG9yYWRvLXBy0gEtaHR0cHM6Ly93d3cuYmVuemluZ2EuY29tL2FtcC9jb250ZW50LzM2NDg3NDc3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Crash With $600M Longs Liquidated, Trump Begins Battle To Retain Colorado Pri - Benzinga",
        "content": "Bitcoin, Ethereum, Dogecoin Crash With $600M Longs Liquidated, Trump Begins Battle To Retain Colorado Primary Ballot Spot, Appeals To US Supreme Court - Top Headlines Today While US Was Sleeping"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWV0aC0xMy1mbGFzaC1jcmFzaGVzLTEzLXRvLTIxMDAtd2hhdC1pcy10aGUtc2lnbmlmaWNhbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) 13 flash crashes 13% to $2,100 – What is the significance - Analytics Insight",
        "content": "The Ethereum price is exchanging hands at $2,237 as of 1:30 a.m., down 5.78% over the last 24 hours.\n\nETH experienced a 13% drop on Jan. 3 as its price dropped from a high of $2,385 to $2,100 within two hours, levels last seen in early December 2023.\n\nThe flash downswing resulted in liquidations of more than $100,000 worth of ETH futures, which were leveraged bets on the price increase.\n\nThe downswing has left traders debating the significance of the price correction with the Decilizer crypto community acknowledging that ETH had the most losses.\n\nBIG DAY FOR $BTC 🔥\n\nGrayscale is in talks with JPMorgan & Goldman Sachs for its Bitcoin ETF. Meanwhile, #Crypto hack losses dropped 51% in 2023, but Ethereum $ETH saw the most losses.\n\nSecurity measures are improving, but the industry must stay vigilant. 🚨#Bitcoin #BitcoinETF pic.twitter.com/ZCFafTZTFG — Decilizer (@decilizer) January 4, 2024\n\nIs this the end of the bullish momentum for the largest altcoin by market capitalization? Note that Ether has tried without success to break above the $2,400 thrice over the last month alone. This is also the third time the smart contract’s token dropped toward the $2,000 zone over the same period.\n\nThe Jan. 3 marketwide sell-off appears to be triggered by an analysis report published by the digital assets platform Matrixport. The firm asserted that the SEC plans to reject the spot Bitcoin ETFs. Crypto prices crashed within an hour of the report’s release.\n\nCan ETH reclaim the $2,300 Level?\n\nThe cause of the 13% flash crash on Jan. 3 may never be definitively determined. This does not necessarily invalidate Ether’s bull run or make gains above the $2,400 resistance less likely before the ETF decision.\n\nFor now, the bulls have to focus on reclaiming the $2,300 level. The long lower wick on Wednesday’s candlestick suggests that the buyers are aggressively defending teh $2,000 support level.\n\nIncreased buying from the current level could see ETH scale higher with the first target being a return to $2,300 and later the equal highs around $2,300. If this happens, it will indicate the ability of the buyers to confront resistance from the $2,400 major resistance.\n\nETH/USD Daily Chart\n\nSupporting this bullish outlook was the upward-facing moving averages. Ether also sat on strong support on the downside. These were areas defined by the 50-day exponential moving average (EMA) at $2,182, the $2,000 psychological level, embraced by the 100-day EMA, and the 200-day EMA at $1,930.\n\nThe relative strength index (RSI) was also facing upwards, a suggestion that day traders had begun re-entering the market.\n\nOn the downside, failure to climb back above $2,300 would imply the inability of the buyers to sustain the uptrend. The bears would then pull the price toward the 50-day with the downside probably being capped around the $2,000 buyer congestion zone.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRhaWx5Zm9yZXguY29tL2ZvcmV4LXRlY2huaWNhbC1hbmFseXNpcy8yMDI0LzAxL2V0aGVyZXVtLWZvcmVjYXN0LTQtamFudWFyeS0yMDI0LzIwNTk5MdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Forecast Today- 04/01: Massive Volatility (Chart) - DailyForex.com",
        "content": "If interest rates continue to decline, it will likely boost the appeal of cryptocurrencies, given their higher risk profile compared to most other assets.\n\nEthereum encountered some turbulence earlier today, dropping below the $2,100 mark, only to swiftly rebound and exhibit renewed strength.\n\nThis suggests that some investors reacted nervously, while others seized the opportunity to make purchases.\n\nThis pattern will likely persist since easy access to funds tends to push cryptocurrency prices higher.\n\nLooking ahead, it seems only a matter of time before buyers drive this market to higher levels, possibly targeting the $2,500 range and even extending towards $2,750. However, it's important to acknowledge that the cryptocurrency market, in general, is known for its volatility. Be cautious with your position sizing because of this, but at the end of the day it looks like each of these pullbacks are going to end up being nice buying opportunities.\n\nBuying dips in this market\n\nConsidering this, it's prudent to consider buying during price dips, but exercising caution and not committing all of your capital immediately. The ongoing activities of institutional investors as they establish new positions for the upcoming year will likely contribute to market fluctuations. Additionally, monitoring the U.S. bond market and interest rates is essential, as rising interest rates can negatively impact cryptocurrencies, including Ethereum. As you go further along the risk spectrum, things get even more volatile.\n\nIf interest rates continue to decline, it will likely boost the appeal of cryptocurrencies, given their higher risk profile compared to most other assets. In light of these factors, it appears that buying opportunities during price dips are still viable, as demonstrated earlier today when the market swiftly turned around at approximately $1,950. However, it's crucial to be prepared for the inherent volatility that characterizes this situation.\n\nForex Brokers We Recommend in Your Region See full brokers list\n\nAt the end of the day, Ethereum experienced a dip below $2,100 followed by a rapid recovery, highlighting the market's resilience. The potential for easy access to funds is expected to keep driving cryptocurrency prices higher. Buyers are likely to push Ethereum towards the $2,500 and $2,750 levels in the near future. Nevertheless, it's essential to exercise caution and not rush to invest all your capital. Institutional activities for the new year and developments in U.S. interest rates should be monitored closely, as they can impact the cryptocurrency market. Overall, buying opportunities during price dips remain a viable strategy, but investors must be prepared for the accompanying volatility.\n\nReady to trade our Ethereum forecast? We’ve shortlisted the best MT4 crypto brokers in the industry for you."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jcnlwdG8tcmVwb3J0ZXIuY29tL3ByZXNzLXJlbGVhc2VzL3ByaWNlLXdhdGNoLXBvbHlnb24tbWF0aWMtYW5kLWV0aGVyZXVtLWNsYXNzaWMtZXRjLWF0dGFpbi1uZXctdGhyZXNob2xkcy1hcy1ldmVybG9kZ2UtZWxkZy1zb2Fycy01Mzk4OC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Polygon (MATIC) And Ethereum Classic (ETC) Bulls as Everlodge (ELDG) Soars - Crypto Reporter",
        "content": "The turn of the new year brings new milestones for several tokens in the crypto industry. Projects like Polygon (MATIC) and Ethereum Classic (ETC) are some of the assets that reached new milestones in the last few months, making them some of the best coins to invest in this year. Meanwhile, the Everlodge (ELDG) project is rising in reputation and popularity due to several valuable factors. Find out more.\n\nPolygon (MATIC) Looking Set Resistance Level Above the $1 Threshold\n\nThe data from Coinmarketcap shows that Polygon (MATIC) has reached the $1 price value for the first time since May 2023. Based on the Polygon price chart, the coin has gained over 28% in the last month. The coins trading volume has risen by over 23% in the last few days, which means more increased trading activity.\n\nIn the meantime, the price of the Polygon token may fluctuate back below the $1 mark. Nonetheless, there are high hopes that the coin will maintain a steady growth that will see Polygon reach $2 before the end of Q1 of 2024.\n\nPositive Price Turn for Ethereum Classic (ETC)\n\nIn the crypto market, stats show that Ethereum Classic (ETC) has gained over 17% in price value within the last month. Also, the Ethereum Classic trading volume has risen by more than 20% in the last few days, with more investors joining to benefit from the ongoing rally. Although the ETC token has crossed the $20 benchmark, there is still a higher chance of a downturn in the coming weeks if it drops under $20.\n\nEthereum Classic has wallowed below the $20 mark for eight months before eventually reaching the milestone last December. As it stands, Ethereum Classic will be looking to maintain its bullish sentiment, which may propel it towards $30 within the next few months. With the anticipated bull run, Ethereum Classic is one of the best cryptos to buy for long-term gains.\n\nEverlodge (ELDG) Soars as it Synergizes Blockchain and Real Estate Investment\n\nAs a property marketplace, Everlodge (ELDG) is attracting investors due to the cutting-edge innovation that the project has kick-started. Everlodge’s goal is to make real estate investment generally inclusive and safe for every individual regardless of one’s capital strength.\n\nWith Everlodge, individuals can invest in luxury assets by purchasing digitally fractionalized NFT tokens that are backed by real-world assets. With as low as $100, individuals can become luxury asset owners.\n\nAs a result of the high growth potential of Everlodge, the project’s native token (ELDG) has attracted a massive troop of investors as well. ELDG token which is currently at its 9th stage of presale, is going for only $0.029. The project’s presale has sold over 18 million ELDG tokens since its presale with more investors buying for the future.\n\nWe’re thrilled to announce that our website just got a makeover! 💻 Check out the fresh look and discover the NEW features we’ve added. It’s all about making your experience even better! Plus, remember that our Presale is still ON. Explore now: https://t.co/SIYWBylwQD#RWA pic.twitter.com/aTuT8x7z36 — Everlodge (@EverlodgeHQ) October 23, 2023\n\nHolders of the Everlodge token will receive exclusive rewards such as discounts, and free night stays in hotels and other luxury apartments within the Everlodge ecosystem. Moreso, the ELDG tokens come with a fixed monthly interest that acts as a source of passive income.\n\nOverall, investing in Everlodge is an opportunity to be part of the trillion-dollar real estate industry. At the current trajectory, the Everlodge token is poised to grow by 280% at presale. A further 30x growth is expected after the launch of the project, making it one of the best cryptos to buy now.\n\nVisit Everlodge\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nb2xkbWFuLWdzLWNvbmlkZXJlZC1wb3RlbnRpYWwtYXAtMTc0MjAwNjAxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Goldman (GS) Conidered as Potential AP for Spot Bitcoin ETF - Yahoo Finance",
        "content": "The Goldman Sachs Group, Inc. GS is being considered to become the authorized participant (AP) for the spot Bitcoin exchange-traded fund (ETF), which Grayscale and BlackRock Inc. BLK are planning to launch.\n\nApart from GS, JPMorgan Chase & Co. JPM is being considered as a potential AP for the ETF. This was first reported by Coindesk.\n\nBLK became the first asset manager to file for the spot Bitcoin ETF in June 2023, paving the way for a wave of filings by other asset managers like Fidelity, Invesco and WisdomTree, Inc. WT.\n\nThe U.S. Securities and Exchange Commission (SEC) is expected to announce its decision on the trading of spot bitcoin ETF’s latest by Jan 10, 2024. To date, the approved cryptocurrency ETFs in the United States are those that include future contracts on Bitcoin and Ethereum. The pending approval from SEC will provide investors direct exposure to the price of cryptocurrency without having to purchase them.\n\nBlackRock also filed for a spot Ethereum ETF named iShares Ethereum Trust in November 2023. The Ethereum ETF, if approved, will be the first of its kind in the United States.\n\nWhile BLK is expanding its cryptocurrency exposure, JPM has been undertaking measures to subdue them. In September 2023, JPM stated that its retail bank, Chase, in the U.K. had decided to restrict customers’ access to cryptocurrency-related transactions due to increased scams and fraud cases. Nonetheless, it has been exploring the concept of launching a blockchain-based deposit token for customers, provided it receives the required regulatory approval.\n\nJPMorgan and Goldman as APs for spot Bitcoin ETF would be entrusted with the responsibility of tracking the ETF share price with underlying assets of fund. The companies will be required to create and redeem the shares of ETF, thus supplying the required liquidity.\n\nBeside this, Goldman has been focusing on growth in its core strengths of investment banking and trading since it has been pulling back from its consumer lending business. Such growth moves by GS are necessary to support its top-line expansion.\n\nStory continues\n\nPer an internal memo circulated last year, GS had disclosed changes in its senior executives’ positions as it intended to expand its operations in the private credit space. It further aims to double the size of business targeting assets worth $110 billion under management over the medium term.\n\nFurther, it has been aiming to expand its offerings across the high growth countries. In December 2023, Bloomberg reported that GS was planning to enhance its credit business in India as it is one of the fastest-growing economies in the world. Per Sonjoy Chatterjee, chairman and chief executive officer of Goldman in India, the bank intends to broaden the range of its loan offerings in this country.\n\nThe firm also desires to obtain a license to boost its currency trading that would permit it to deal with counterparties like financial investors, equity customers or a corporate customer. This apart, GS believes that deal-making activity in the country is likely to receive a boost.\n\nGoldman’s shares have gained 16.9% over the past six months compared with the industry’s 11.3% growth.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nGS presently carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nWisdomTree, Inc. (WT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    }
]