[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWFjaGVzLTIzMDAv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXJlYWNoZXMtMjMwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Reaches Support, Can ETH Start A Steady Increase Again? - NewsBTC",
        "content": "Ethereum price extended losses and tested the $2,300 support. ETH is now attempting a recovery wave above the $2,340 level and might test $2,390.\n\nEthereum started a fresh decline below the $2,420 and $2,400 levels.\n\nThe price is trading below $2,400 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $2,340 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair attempt a fresh increase if it clears the $2,390 and $2,400 levels.\n\nEthereum Price Revisits $2,300\n\nEthereum price struggled to start a fresh increase above the $2,550 and $2,580 resistance levels. ETH started a fresh decline and traded below the $2,400 support like Bitcoin.\n\nThere was a move below the $2,350 level. A new weekly low was formed near $2,302 and the price is now consolidating losses. There was a minor increase above the $2,330 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $2,479 swing high to the $2,302 low.\n\nThere was also a break above a connecting bearish trend line with resistance near $2,340 on the hourly chart of ETH/USD. Ethereum is now trading below $2,400 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,365 level.\n\nThe next hurdle could be $2,390 or the 50% Fib retracement level of the downward move from the $2,479 swing high to the $2,302 low. The next major resistance is now near $2,400. A clear move above the $2,400 level might start a decent increase. In the stated case, the price could rise toward the $2,480 level.\n\nSource: ETHUSD on TradingView.com\n\nThe next key hurdle sits near the $2,500 zone. A close above the $2,500 resistance could start another steady increase. In the stated case, Ether price could rise toward the $2,650 zone.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,390 resistance, it could start another decline. Initial support on the downside is near the $2,320 level.\n\nThe next key support could be the $2,300 zone. A downside break below the $2,300 support might send the price further lower. In the stated case, Ether could test the $2,250 support. Any more losses might send the price toward the $2,200 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,300\n\nMajor Resistance Level – $2,390\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1wbHVuZ2VzLWR1cmluZy10dWVzZGF5LTE0MDQyODfSAVtodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tcGx1bmdlcy1kdXJpbmctdHVlc2RheS8xNDA0Mjg3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Plunges During Tuesday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BvbHltZXItbGFicy1yYWlzZXMtMjMtbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Polymer Labs secures $23M to bring IBC to Ethereum - Blockworks",
        "content": "Polymer Labs, a modular IBC-based networking protocol, has secured a $23 million Series A co-led by Blockchain Capital, Maven 11 and Distributed Global.\n\nOther investors, including Coinbase Ventures, Placeholder, Digital Currency Group, North Island Ventures and Figment Capital also participated in the round.\n\nPolymer can be described as a modular layer-2 network that employs Cosmos SDK’s IBC protocol, OP stack’s settlement functionality and Eigenlayer’s data availability layer. It is the brainchild of Bo Du and Peter Kim.\n\nAfter being in the blockchain industry for a few years, the Polymer founders experienced firsthand how difficult it was to build interchain products. In the summer of 2021, they made a decision to drop their side projects and focus on fixing blockchain interoperability.\n\nRead more: The Interchain Foundation puts aside $26.4M to grow Cosmos ecosystem\n\nInitially, the team wanted to design their own interoperability protocol — similar to that of many general message-passing protocols that exist today. However, during their research, they came across the Cosmos SDK’s Inter-Blockchain Communication protocol, Du told Blockworks.\n\nIBC is an inter-blockchain communication protocol, as its name suggests. It allows different blockchains in the Cosmos ecosystem to communicate with each other. The protocol is designed to ensure that information can be securely transferred between separate operating chains.\n\nRead More: DeFi users ‘don’t care’ what chain apps are on\n\n“IBC already had years put into its design and architecture, so we decided to stick with IBC and not invent a whole new standard,” Du said.\n\nKim added that at the time, IBC was the most decentralized, elegant solution to establish connections and pass messages between chains.\n\n“​​We realized this was something that could be expanded to other chains; basically export the technology to have industry penetration rather than just the Cosmos app chains,” Kim said.\n\nSo how does it work?\n\nThe team wanted to find ways to make the already established interoperability protocol on Cosmos a mainstream standard in the Ethereum ecosystem.\n\n“It’s not easy to integrate IBC natively into all these different chains, which is why we designed the virtual IBC protocol, which essentially allows chains that don’t natively implement IBC to access IBC execution through Polymer and have Polymer execute IBC on its behalf,” Du said.\n\nMany blockchain interoperability protocols today are focused on the state component of interoperability, which involves aligning the status of the data stored within separate systems, but Du believes this is just one part of the interoperability problem.\n\nRead more: Interoperability isn’t just a buzzword\n\nBeyond the state layer, two other layers need to be considered. This includes the application layer — that is, the layer responsible for encoding and decoding sent data and the transportation layer (TAO) — which manages the routing of raw data.\n\n“All of IBC’s core logic will live on the transportation layer; this becomes decoupled from the application layer, and Polymer will hold the IBC state on behalf of the connected chain,” Du said.\n\nThis means that at the end of the day, the application — which lives on Ethereum — will be able to interact with the IBC network through Polymer smart contracts.\n\n“Polymer will then take the apps intended actions and execute the associated IBC logic and produce a commitment to the IBC state of that chain on Polymer — so essentially, Polymer is maintaining this merkle-ized IBC state on behalf of the connected chain,” he said.\n\nRead more: 2023’s top 5 DeFi protocols by revenue\n\nSimilar work to decouple state, application and transport layers is being explored by the interoperability protocol LayerZero.\n\nIBC has been around for a long period of time. Du notes that its specs cover various considerations ranging from authentication, timeouts and acknowledgment, somethings its competitors may not have.\n\nThis means that applications will not have to individually implement these different changes when there are protocol upgrades.\n\n“If you want to design a protocol that is going to last for generations of builders, you need to be able to handle these different edge cases properly,” Du said. “This is a foundational level protocol.”\n\nInvestors in Polymer Labs, Yuan Han Li and Joshua Rivera from Blockchain Capital, shared this sentiment.\n\nThey note in a press release reviewed by Blockworks that “while numerous arbitrary messaging protocols have emerged to address the cross-chain interoperability, they have all done so by building a new messaging standard, paradoxically causing more fragmentation when a standardized and battle tested way to move data between heterogeneous blockchains already exists.”\n\nUltimately, the Polymer team is hoping to ensure that IBC becomes a widely adopted interoperability standard that will shape how blockchain applications of the future will communicate. This latest funding round will bring the team closer to launching mainnet.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kb25hbGQtdHJ1bXAtc29sZC0yLTQtMTkzMDExMDY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nStory continues\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0MDQzL2V0aGVyZXVtLXBvbHltZXItbGFicy1yYWlzZXMtZnVuZGluZ9IBTGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDA0My9ldGhlcmV1bS1wb2x5bWVyLWxhYnMtcmFpc2VzLWZ1bmRpbmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Layer 2 developer Polymer Labs raises $23 million in Series A funding - The Block",
        "content": "Polymer Labs, which is building an Ethereum ETH +1.27% Layer 2 network to provide interoperability-as-a-service to Ethereum and its rollups, has raised $23 million in a Series A funding round.\n\nBlockchain Capital, Maven 11 and Distributed Global co-led the round, with Coinbase Ventures, Placeholder, Digital Currency Group, North Island Ventures and Figment Capital participating, Polymer Labs said Tuesday.\n\nIt isn't clear when Polymer began raising for the round and when the project closed; co-founder Peter Kim declined to comment on the timeline. He also declined to comment on the structure of the round and whether it was an equity, token, or equity-plus-token-warrants round, as well as on valuation.\n\nPolymer's Series A round comes nearly two years after it raised $3.6 million in seed funding. The project's Ethereum interoperability infrastructure is under development, and it plans to launch the testnet by March, Kim said.\n\nEthereum interoperability hub\n\nPolymer Labs is building an \"Ethereum interoperability hub,\" first to connect Ethereum and its rollups and then all blockchains with the goal of establishing the next generation of the internet.\n\nThe current Layer 2 networks and interoperability token bridges are widely used but have been susceptible to hacks, Polymer said, adding that its Layer 2 rollup will enable protocols on different chains to \"communicate efficiently and securely without introducing new trust assumptions, enhancing the functionality of a wide range of blockchains.\"\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nPolymer utilizes the Inter-Blockchain Communication (IBC) protocol, the Cosmos standard for blockchain interoperability, and the Optimism Stack for its hub. Any developer building any web3 application on any chain will eventually be able to use its interoperability tool, Polymer said.\n\nPolymer plans\n\nWith fresh capital in hand, Kim looks to expand the current team of about 30 members by hiring across functions, including business development and engineering. Polymer also aims to launch its mainnet sometime this year, \"depending on testnet performance,\" Kim said.\n\nPolymer said its team has had professional working experience at firms including Google, Citadel, McKinsey, Amazon, Verizon, EY, and Uber.\n\n\"While many bridges have prioritized go-to-market and business development, we emphasize the importance of building the right solution for the long term,\" Kim said. \"Most of our engineering team members were brought on outside of crypto — more senior developers with experience specifically around scaling the infrastructure for the internet in web2.\""
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NvaW5iYXNlLWNsaWVudC1kaXZlcnNpdHktdmFsaWRhdG9yLWJ1Z9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Coinbase confronts client diversity risk following Nethermind bug - Blockworks",
        "content": "Coinbase is looking into ways to address client diversity concerns following an outage that affected 8% of Ethereum validators.\n\nEthereum’s Nethermind client software — a tool that is used to connect validators with blockchain networks — saw a bug that pulled validators offline.\n\nAlthough the bug was resolved within four hours, concerns about client centralization on Ethereum began to surface.\n\nSpecifically, users flagged that if client software Geth — Ethereum’s most popular execution client used by 84% of validators — were to shut down, then Ethereum itself would stop finalizing.\n\nRead more: Liquid Collective pitches efficiency standards for Ethereum validators\n\n“When a minority client fails, the penalty is losing [ether] ETH at the same rate as you gained it, but if Geth fails because it instantly stops the chain from finalizing, the penalty is much harsher,” Labrys, a Web3 development company in Australia, wrote in a post on X.\n\nCoinbase Cloud nodes currently rely solely on client software Geth, as does Binance and Kraken. Following urging from community members, a Coinbase Cloud spokesperson told Blockworks that Coinbase is actively assessing alternative execution clients.\n\n“We believe that client diversity helps the health of the Ethereum network. As industry leaders, we are committed to helping our customers participate in the crypto-economy safely and securely,” a Coinbase spokesperson said.\n\nThey note that, to date, Geth has been the only execution layer client software that has met its technical requirements.\n\nRead more: Parallelized EVMs are gaining popularity, but they won’t scale blockchains alone\n\n“Many other operators on the network have reached the same conclusion, which is part of the reason why 84% of Ethereum validators run Geth. However, the tide is turning,” Coinbase Cloud wrote in a post on X.\n\nIt added that “alternative execution clients have come a long way, and so we are conducting an updated technical assessment with the goal of adding another execution client to our infrastructure.”\n\nIt is expected that Coinbase will share an update on alternative execution client solutions in late February.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1ldGYtY29taW5nLXNvb25lci10aGFuLXlvdS1leHBlY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "An Ethereum ETF is coming sooner than you expect - Cointelegraph",
        "content": "We finally have a Bitcoin spot ETF — an event few of us thought we would see in our careers — the industry has now turned to the approval of an Ether (ETH) spot ETF as its next target. Those gearing up for another decade of juicy headlines, though, will be disappointed.\n\nThe approval of an ETH spot ETF is now not only certain, but imminent. While the United States Securities and Exchange Commission was able to spout nonsense for over 10 years in its various denials of its BTC equivalent, the watchdog can no longer hide behind diffuse objections to what is a patently clear commodity ETP filing.\n\nIndeed, as was observed by Commissioner Hester Peirce in her damning indictment of the SEC’s conduct over this approval published on Jan. 10, the denials of these applications never made sense.\n\nRelated: Will Bitcoin keep dropping because of the ETFs?\n\nRather than follow what was always a very clear process for these products, the regulator denied applications based only on “prejudice” against Bitcoin (BTC) — a prejudice that was only, finally — ended by Greyscale’s lawsuit.\n\nThe result, as Peirce observed, has not only been the erosion of trust in the SEC, but a “circus” around these crypto products that would otherwise not have been witnessed — a fact to which the $1 billion of assets now sitting in BlackRock’s BTC spot ETF can attest.\n\nSuch a circus will not be seen around an Ether ETF. Currently, there are seven ETH spot ETF applications sitting on the SEC's desk. This time, VanEck is the first in line with a deadline of May 23, 2024. The deadline for BlackRock’s application is in August, but while typically we would expect the world's largest asset manager to dictate the terms of the approval, the securities watchdog has already instituted proceedings on VanEck's applications.\n\nEthereum ETF deadlines. Source: Bloomberg Intelligence\n\nAs such, it would have to come up with an awfully good reason for a denial, which would have a knock-on effect on other pending applications. This is why the market appears so certain that an approval is coming in May.\n\nAnd this will not be the result for just an ETH product, either. The path has now been cleared for any kind of crypto-backed or linked ETP — from spot products to more complex instruments like structured products, all linked to digital assets.\n\nAs a really long shot, the only potential obstacle in the way of a spot ETH approval is liquidity. Just as the size and scale of the market was a concern for a Bitcoin spot product, it will be even more so for Ethereum, whose move to proof-of-stake has further constrained the supply of ETH.\n\nMoreover, while BTC — now used almost purely as a store of value - can be held long-term inside large investment funds, ETH is a working currency used to pay for ever-growing numbers of transactions on the highly composable chain.\n\nRelated: Gary Gensler approved the ETFs — but now he’s striking back\n\nThis and this only may throw a spanner in the works for the world’s second-biggest cryptocurrency when it comes to a spot ETF approval, but it truly is an outside chance. Indeed, the same argument could be applied to equities — and it never is.\n\nThe liquidity issue will continue to plague almost all markets as these mega ETP funds soak up assets from the pensions savings of an aging global population, and solutions will continue to be found. Right now, in fact, we are seeing a lot of Bitcoin flowing into Coinbase wallets, which is almost certainly whales doing over-the-counter (OTC) deals to satisfy institutional demand.\n\nThe question of whether ETH is a security is also null and void as, once it becomes an ETF, it becomes a security. And we already have commodity ETFs — lots of them.\n\nThe reason it took 10 years for a Bitcoin ETF to be approved was politics — plain and simple. The SEC was neither sure or ready to be sure until the asset managers were sure and ready to be sure that this new asset class should be allowed through the door. We now have clarity on this.\n\nWith the approval of the BTC spot ETF, cryptocurrency is not only through TradFi’s hallowed door, but sitting firmly at its table. Now, more than the approval of a spot ETH ETF, we can prepare for the full-scale institutional colonization of the cryptocurrency industry.\n\nLucas Kiely is the chief investment officer for Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tY3lwaGVycHVuay1ldGhlcmV1bS1kbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Making Vitalik Buterin's cypherpunk dream for Ethereum a reality - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin has a dream. He wants to make Ethereum cypherpunk again — harkening back to the foundational values of blockchain, like decentralization, open participation, censorship resistance and credible neutrality.\n\nIn the Dec. 28, 2023 post titled “Make Ethereum Cypherpunk Again,” Buterin argued that these concepts should shape not only the future of Ethereum but also the future of the internet as Web2 develops into Web3.\n\nAt the same time, Buterin lamented “degen [-erate] gamblers” on Ethereum who put their money into memecoins or nonfungible tokens (NFTs) in the hope of outsized financial rewards.\n\nAccording to Buterin, degens “can be okay in moderate doses,” but “when they are the largest group using the chain on a large scale, this adjusts the public perception and the crypto space’s internal culture,” among other negatives.\n\nIf the Ethereum founder is to avoid what he sees as degeneracy and ever get closer to his dream, he has a long way to go. As Buterin says himself, “The only non-financial application that is actually being used at a large scale on-chain is ENS.”\n\nWhile that’s a grand endorsement of ENS — the Ethereum Name Service — it’s not a fantastic record of achievement either. ENS launched in 2017, so by Buterin’s admission, not a single successful Ethereum project launch since then has met the standards he’s setting. That’s a fairly lamentable record.\n\nWith that being the case, can all of the blame really be laid at the feet of degens?\n\nA single shining cypherpunk beacon\n\nIf the vast bulk of projects on Ethereum can either be classed as cypherpunk and not successful or as successful and not cypherpunk, then it is worth examining the supposed single exception to the rule: the Ethereum Name Service.\n\nENS is a domain naming service for the Ethereum blockchain. It allows a standard Ethereum address’s randomly created letters and words to be personalized into easily recognizable words or phrases, such as a name or a brand. As the internet has “.com,” Ethereum thusly has “.eth.”\n\nCointelegraph spoke with Nick Johnson, the founder and lead developer of the Ethereum Name Service, to find out what kind of forces might drive Ethereum’s cypherpunk renaissance.\n\nAs Johnson sees it, the cypherpunk idealogy -— which also drives the shift from Web2 to Web3 — will prove increasingly popular with the public as ordinary people become more familiar with centralization and its negative associations. He believes this is especially true for hot-button issues such as privacy:\n\n“Web3 is poised to be a tangible reality as individuals see the impact of centralized technology on their lives, especially their data, and gradually recognize the inherent value in decentralized and credibly neutral technologies.”\n\nJohnson pointed out that while the solutions take time to develop and emerge, “As blockchain technology advances, there is a decentralized alternative for every centralized option.”\n\nJohnson said Buterin singled out ENS as unique among the whole Ethereum ecosystem because it brings “a true non-financial use case to Ethereum.”\n\nRecent: Crypto community speculates about Bitcoin transfer to Satoshi’s genesis block\n\n“The .eth naming system now stands as a foundational pillar within Web3’s architecture and is a gateway for Web2 companies scaling into Web3, proving we have slowly entered the transition to Web3. ENS believes in building an internet that adheres to the original ethos of Ethereum to foster inclusivity and self-sovereignty,” he concluded.\n\nThe transaction fee problem\n\nVitalik Buterin may lament the rise of “degeneracy” on Ethereum, but he sees high transaction fees, rather than individual users, as the main culprit and driver of the phenomenon.\n\nButerin writes, “When the cost of writing to the chain is $0.001, or even $0.1, you could imagine people making all kinds of applications that use blockchains in various ways, including non-financial ways. But when transaction fees go to over $100, as they have during the peak of the bull markets, there is exactly one audience that remains willing to play — and in fact, because coin prices are going up and they’re getting richer, becomes even more willing to play: degen gamblers.”\n\nIf that point is accepted as true, there is a further argument to be made that the high cost of transactions on Ethereum is due to historical and current network limitations. A more charitable assessment may be that Ethereum is a victim of its own success, making it difficult to keep up. However you chose to phrase the matter, it boils down to an essential indisputable point: Ethereum is struggling to meet demand.\n\nIn 2022, Ethereum switched from proof-of-work consensus to proof-of-stake in a bid to improve throughput and provide a future platform for increased scalability.\n\nBut even with Ethereum’s consensus change, much work remains. The network currently processes 30 transactions per second or lower. The stated goal is to reach anywhere up to 100,000 transactions per second.\n\nEthereum can do it with time\n\nThe road to a cypherpunk Ethereum may be long, but some have confidence that the network is on the right path.\n\nBarney Mannerings, co-founder of the Vega Protocol decentralized exchange, believes that Buterin can succeed in making Ethereum a more cypherpunk network, but “The caveat is that it remains to be seen how big the market for this is and how much adoption can be gained.”\n\nWhat founders envisage and what the market responds to do not always perfectly align.\n\nMannerings told Cointelegraph that he sees a parallel with end-to-end encryption for messaging, saying that cypherpunks “fought for strongly end-to-end encrypted communications for years. Initially, they succeeded, technically, with the likes of Phil Zimmernan’s PGP [Pretty Good Privacy], but this has always suffered from a bad UX and low adoption — a lack of ‘product market fit.’”\n\nRecent: 100 days out: What the Bitcoin halving means after BTC ETF approvals\n\nMannerings says it wasn’t until later, when Signal arrived with its improved user experience (UX), that the concept fared better. Mainstream messaging apps such as WhatsApp now offer encryption but with some compromises.\n\n“I expect the same to happen here,” said Mannerings. “It will be easier to technically create and disseminate the tools and building blocks of Vitalik’s cypherpunk dream than it will be to get everyone using them, and for these building blocks to filter through to the real world in a big way could take decades.”\n\nThat’s not to make an argument against the attempt. In fact, as Mannerings points out, “I think it is a strong vision and one worth building toward and fighting for, and I think Ethereum is well placed to lead the charge from a position of strength, with an aligned community and ecosystem.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmxpdmViaXRjb2lubmV3cy5jb20vZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtZXRoLXJldHJlYXRzLWxvd2VyLWZyb20tMjcwMC_SAVtodHRwczovL3d3dy5saXZlYml0Y29pbm5ld3MuY29tL2V0aGVyZXVtLXByaWNlLWFuYWx5c2lzLWV0aC1yZXRyZWF0cy1sb3dlci1mcm9tLTI3MDAvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Retreats Lower From $2,700 - Live Bitcoin News",
        "content": "Ethereum price started a downside correction from the $2,700 resistance against the US Dollar.\n\nETH price is now trading below $2,550 and the 55 simple moving average (4 hours).\n\nThere is a key bearish trend line forming with support at $2,400 on the 4-hour chart (data feed from Coinbase).\n\nThe pair could start a fresh increase if it clears the $2,400 resistance zone.\n\nEthereum price is declining below $2,550 against the US Dollar. ETH/USD remains at a risk of more downsides below the $2,300 support zone.\n\nEthereum Price Analysis\n\nIn the past few weeks, Ethereum started a decent increase above the $2,320 resistance zone against the US Dollar. ETH price climbed above the $2,500 and $2,600 resistance levels.\n\nFinally, it tested the $2,720 resistance zone. A high was formed near $2,718 before there was a downside correction. There was a move below the $2,550 support zone. The price even traded below the 50% Fib retracement level of the upward wave from the $2,168 swing low to the $2,718 high.\n\nETH is now trading below $2,550 and the 55 simple moving average (4 hours). There is also a key bearish trend line forming with support at $2,400 on the 4-hour chart.\n\nOn the upside, the price is now facing resistance near the $2,380 level. The first major resistance is near the $2,400 level. The next major resistance is near the $2,440 zone. A clear move above the $2,400 and $2,440 resistance levels might call for a fresh move to $2,550.\n\nAny more gains could even send the price toward the $2,700 resistance zone or even $2,920 in the near term. On the downside, initial support is near the $2,300 level and the 76.4% Fib retracement level of the upward wave from the $2,168 swing low to the $2,718 high.\n\nThe next major support is now near the $2,200 level. A break below the $2,200 support could push the price to $2,120. If the bulls fail to protect the $2,120 support, the price might decline toward $2,075.\n\nLooking at the chart, Ethereum price is clearly trading below $2,450 and the 55 simple moving average (4 hours). Overall, Ether price could continue to move down if it breaks the $2,300 support zone.\n\nTechnical indicators\n\n4 hours MACD – The MACD for ETH/USD is now gaining momentum in the bearish zone.\n\n4 hours RSI (Relative Strength Index) – The RSI for ETH/USD is now below the 50 level.\n\nKey Support Levels – $2,300, followed by the $2,200 zone.\n\nKey Resistance Levels – $2,380 and $2,400."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1wbHVuZ2UtY29udGludWVzLWV0aC1wcmljZS1vbi10aGUtcGF0aC10by1yZXRlc3QtMjAwMC10aGlzLXdlZWsv0gF4aHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLXByaWNlLXBsdW5nZS1jb250aW51ZXMtZXRoLXByaWNlLW9uLXRoZS1wYXRoLXRvLXJldGVzdC0yMDAwLXRoaXMtd2Vlay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Plunge Continues! ETH Price On The Path To Retest $2,000 This Week? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nAltcoins continue to record massive price volatility with major top tokens experiencing a significant correction in their respective value. Further, the leader of altcoins, Ethereum price, lost over 8% within the last 24 hours.\n\nThe Ethereum price traded in a narrow space between $2,190 and $2,248 for a while, after which the market gained momentum, resulting in a price breakout.\n\nAfter reaching a top of $2,401, the leader of altcoin faced restriction, and the price traded in a consolidated range between $2,248 and $2,401 for over a week.\n\nTradingView: ETH/USDT\n\nThe price faced repeated rejection at $2,401, following which it lost momentum and recorded a correction of approximately 9% in valuation. The price then traded in a narrow space between $2,190 and $2,248 for the next four days.\n\nAs the market volatility grew, the Ethereum token displayed a minor pump-and-dump in its chart. After multiple attempts, the bulls regained momentum and jumped over 19.5%, following which it faced rejection at $2,691.5.\n\nThe coin then traded sideways for a while, indicating a cool-off in the market sentiments. After this, the price moved in a closed range between $2,501 and $2,589 for a week. The ETH token constantly traded under a bearish influence and lost over 11% in valuation.\n\nCurrently, the price is displaying a bearish move and is on the verge of testing its crucial support level of $2,190, of which the outcome is uncertain.\n\nWill ETH Price Rise Back Up?\n\nThe Moving Average Convergence Divergence (MACD) displays a constant red histogram, indicating a higher selling-over-buying pressure in the market. Further, the averages show a bearish curve, highlighting a bear power in the crypto space.\n\nIf the market experiences a trend reversal, the ETH price will test its resistance level of $2,248. Maintaining the price at that level will set the stage for Ethereum to attempt to test its upper resistance level of $2,401 in the coming days.\n\nNegatively, if the market continues to lose value, the star altcoin will test its support level of $2,102 soon. Moreover, if the market is dominated by the bears, it will plunge and prepare to test its lower support level of $2,000 this month."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vY3J5cHRvY3VycmVuY3kvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi0yMDI0LTIwMzAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction 2024 - 2030 - Cryptonews",
        "content": "Ethereum Price Prediction 2024 – 2030\n\nEthereum is the world’s #2 cryptocurrency (by market cap) and the world’s most popular smart contracting platform. It was designed to operate as a world computer and has overcome many hurdles in its short, 8 year existence—some self-induced, others put there by those threatening to stifle innovation.\n\nIn this Ethereum price prediction, we dive into what Ethereum is aiming to accomplish through its development roadmap, what has happened to it in the past, and how all this has, and will, affect Ethereum’s price in the future. We’ll also look at the myriad of factors that affect the Ethereum price.\n\nWhat lies ahead for Ethereum and the ETH price at this crucial moment in Ethereum’s history?\n\nEthereum Price Prediction Overview\n\nThe Ethereum network was launched in 2015, and ETH’s first registered price is $1.2222\n\nThrough 2017 Ethereum gained an astounding 17,970.6%, rising from $8.10 to peak at $1,463.72\n\nEthereum lost value after The Merge, the biggest network upgrade in its history\n\nWe predict that Ethereum will get its first 5 figure all-time high (ATH) of $10,200 in 2029, as a result of the Bitcoin Halving Event\n\nBitcoin, regulators, the global economic picture, network upgrades, and institutional usage rates are all factors impacting the price of Ethereum\n\nEthereum’s roadmap lays out how it is going to scale to 100,000 transactions per second and onboard thousands of users—we discuss how these upgrades will affect the price of ETH\n\nThe table below contains a summary of our Ethereum price prediction for each year:\n\nYear Low Prediction Average Prediction High Prediction 2024 $2,200 $3,600 $4,200 2025 $3,400 $4,200 $6,600 2026 $3,500 $4,500 $5,800 2027 $3,900 $5,200 $4,400 2028 $4,200 $5,800 $6,300 2029 $7,100 $8,800 $10,200 2030 $8,800 $9,000 $9,600\n\nHistorical Evolution of Ethereum\n\n\n\nThe idea for Ethereum was first conceived in 2013 by a young programmer, Vitalik Buterin, after his father introduced him to Bitcoin. Vitalik authored the initial Ethereum whitepaper, outlining the idea that blockchain technology could be used for more than just the transfer of value—as Bitcoin is.\n\nMore specifically, Vitalik proposed that blockchain technology could be used to host contracts (what we today call “smart contracts”) that could perform a whole host of functions and that the distributed network could function as a world computer.\n\nEthereum’s Beginnings\n\nIn 2014, Vitalik took his idea to the North American Bitcoin Conference, in Miami, where he outlined his vision in a 25 minute speech. After this address, Vitalik and a few others from the conference, now considered the cofounders of Ethereum, who were excited by the idea, rented a house to work on the idea.\n\nOne of these individuals, Gavin Wood (creator of Polkadot), then wrote the Ethereum Yellow Paper, which defines the Ethereum Virtual Machine (EVM)—the operating environment that makes smart contract execution possible.\n\nIn the summer of 2014, the Ethereum Foundation was created, as a non-profit to oversee the development of Ethereum. Funds for this development were raised through a crowdsale—which was one of the first initial coin offerings (ICOs)—where Ethereum tokens were sold for Bitcoin—raising more than $18 million.\n\nOver the next 18 months, the initial Ethereum protocol was developed, multiple testnets were run and the network was officially launched on July 30th, 2015, with the creation of the Ethereum genesis block.\n\nLike Bitcoin, Ethereum was initially a proof-of-work network. Unlike Bitcoin, Ethereum had an uncapped supply, which made it an inflationary asset.\n\nThe DAO Hack and DAO Hard Fork Controversy\n\nAn important part of Ethereum’s history is often glossed over as it is considered a stain on the world’s #2 cryptocurrency’s reputation.\n\nIn 2016 a group, containing many members of the Ethereum Foundation, proposed a project simply called The DAO. The DAO’s goal was to become a crowdfunded venture capital firm to invest in new projects building on Ethereum.\n\nThe DAO had initial success, raising $150 million—14% of the total supply of Ethereum at the time—in its own crowdsale.\n\n\n\nHowever, after the crowdsale had concluded, a bug was found in the DAO’s smart contract that allowed someone to drain funds from the contract. A hacker noticed it first and made away with 30% of all the raised funds before well-intentioned hackers stepped in to secure the other 70%.\n\nTo solve the problem of stolen funds a soft fork was proposed and implemented on the network. However, a bug was quickly found in the soft fork and the miners rejected it, forcing the need for another solution.\n\nA hardfork was proposed which, controversially, would return all the funds from the hacker’s account to The DAO. A short, and also controversial, vote was held to authorize the fork, which was subsequently implemented 5 days later.\n\nPrior to this incident, the mantra “code is law” was one of Ethereum’s calling cards, meaning that whatever happens on the blockchain cannot be changed—regardless of its origin. There are those who vehemently disagreed with the idea of the hard fork on these grounds, and its implementation can be seen as an evolution in the network’s principles.\n\nThe Birth of a Classic (Ethereum Classic) After the hardfork was implemented it was thought that just one chain would exist, and the unchanged chain would disappear. However, some miners continued to support the original chain. Two exchanges gave this chain price discovery and rebranded it to Ethereum Classic, which is still its name today. The DAO hack and subsequent infighting is a long story with many twists and turns. If you want to know more, this post tells the in-depth story of the DAO hack and subsequent community divisions, and this timeline offers a chronological overview of events.\n\n\n\nHardforks and Network Evolution\n\nThe DAO fork was not the first or last hard fork on the Ethereum blockchain, as hard forks are how the Ethereum protocol is upgraded. There have been multiple in Ethereum’s history, some of which are more consequential in the history of Ethereum than others, these we’ve summarized in the table below:\n\nHardfork Name Date Most Significant Impact Byzantium October 2017 Allowed for the creation of layer 2s to scale the network Constantinople February 2019 Initial setup for move to proof-of-stake (PoS) Istanbul December 2019 Improved layer 2 and smart contract functionality Beacon Chain December 2020 The initial deployment of the PoS chain for Ethereum London August 2021 Introduction of fee burning mechanism reducing the inflation rate and increasing the chance of ETH being deflationary Bellatrix September 6th 2022 Second upgrade to the Beacon chain, preparing it for The Merge “Paris\n\n(The Merge)” September 15th 2022 Proof-of-work (PoW) was switched off, PoS was switched on, completing The Merge and Ethereum’s switch to proof-of-stake consensus\n\nAs said, this isn’t a complete list, and each hardfork introduced more than just the significant impact we’ve stated here. Those looking for a deeper dive into each hardfork and the technical evolution of the Ethereum blockchain can read this complete history of Ethereum hardforks.\n\nCryptoPunks, CryptoKitties, and NFTs Here it is worth noting another important step in the evolution of Ethereum and the cryptocurrency world, NFTs. In 2017 a revolution started on Ethereum with the launch of CryptoPunks. CryptoPunks were one of the earliest examples of NFTs on Ethereum, and have continued to remain relevant; the current lowest price for a CryptoPunk is just under 60 ETH, around $150,000. This collection of 10,000 algorithmically generated pixel characters were not actually NFTs, but they did help to spur the creation and implementation of the ERC-721 NFT standard on Ethereum. Later on in 2017, the cats began to take over Ethereum, with the rise in popularity of the CryptoKitties game. In this game, users take NFT kittens and breed them together to create new, unique kittens that draw on the traits of their parents. This game grew so popular that it took up 20% of Ethereum’s computation and drastically increased transaction costs. This hastened the need for scaling solutions, because who’s going to want to use a network that can be put out of action by a viral cat game?\n\n\n\nEthereum, The Merge, and Proof-of-Stake\n\nThe Merge was an event almost 5 years in the making, and it was the talking point of the cryptocurrency ecosystem for a long time before, and even after, it happened. Ethereum cofounder, Joe Lubin, said to Time that the Merge “may end up being more significant” than the genesis day.\n\nThe Merge combined the existing Ethereum PoW blockchain with the PoS Beacon chain that had been running alongside it since December 2020. This merging of the two chains meant that the Ethereum network didn’t lose any of its history as it switched from PoW to PoS—all without affecting the users at all.\n\nThere are several reasons Ethereum switched to a POS consensus model:\n\nReduced Energy Consumption: Ethereum’s energy consumption was reduced by over 99% after the switch to proof-of-stake, and some even stated that “the merge will reduce worldwide electricity consumption by 0.2%”. This was all coming at a time when passions around climate change were high and the power consumption of blockchains was one of the pieces of vitriol being thrown at them.\n\nDeflationary Potential: Prior to The Merge around 13,000 ETH was issued per day. With the switch to PoS this shrank to around 1,700 ETH per day—significantly reducing ETH inflation.\n\nThe London hardfork also introduced a burning mechanism that removes the minimum fee attached to each transaction from circulation. If a single day has an average gas price of more than 16 gwei then the burned amount of ETH exceeds the issuance limit and results in deflation of ETH in that day.\n\nStaking Interest: Ethereum users can now stake their ETH to help secure the network and earn interest (in newly issued ETH) for doing so. A user requires a minimum of 32 ETH to operate a validator and earn this reward.\n\nLower Barrier to Entry: Mining is an expensive operation that requires massive amounts of energy, limiting the number of people with the resources and capacity to secure the network. Staking made it easier for more people to participate in securing the network, making it more decentralized in the process. However, at current prices, a user needs over $88,000 worth of ETH to run a validator node.\n\nNew Scaling Possibilities: Moving to a PoS consensus mechanism allows for future scalability upgrades that are not possible when using a PoW consensus mechanism. This allows Ethereum to scale to meet the needs of a global, digital society.\n\nCurrent State of Ethereum\n\n\n\nEthereum is a fully functioning, decentralized proof-of-stake blockchain that works as a global computer where people can interact and transact in a permissionless manner, from anywhere in the world. It is used by individuals and enterprises for a wide variety of functions, from transferring value to taking out loans to storing data in an immutable fashion.\n\nThe Ethereum ecosystem contains many of the world’s most popular dApps and some of the biggest technological transformations to come from the cryptocurrency movement, including NFTs, DeFi, zero-knowledge privacy solutions, and layer 2 scaling networks. Here’s a quick look at the Ethereum blockchain in numbers:\n\nAlongside these stats, the Ethereum network processed an average of more than 1 million transactions per day over the past year, a number that is only expected to grow as the number of unique addresses and daily active addresses continue to increase.\n\nWhile these numbers are impressive there are also more than 8 layer 2 networks posting their transactions to Ethereum and taking the load off the main chain, and many more in the pipeline to be launched—meaning the number of transactions secured by the Ethereum layer 1 is much higher than the counts expressed above.\n\nRecently there has also been the launch of an application-specific (for gaming) layer 3 on top of the Arbitrum layer 2.\n\nMarket Position and Performance\n\nEthereum is sat at #2 on CoinMarketCap’s ranking of coins by market cap, as it has been since 2016. In the same article linked above, it is also pointed out that Ethereum is the third best performing asset in the CoinMarketCap top 100 since 2013, with a more than 700x increase.\n\nIn the past year, the price of Ethereum has seen a over 80% increase in price, from $1,643.30 on February 22nd, 2023, to $2,966.91 on February 22nd, 2024. The total supply of available ETH has also been slowly decreasing since the introduction of The Merge in September 2022 making Ethereum a deflationary asset, a move that Vitalik said was giving Ethereum “legitimacy” as “ultra sound money”.\n\nOverall, Ethereum’s recent performance has been strong through the Crypto Winter of 2022–2023. Its market dominance of 17–19%, also held strong through the Bitcoin ETF speculation-fueled price rises and a sudden and sustained surge by Solana in early 2024.\n\nFinally, before we dive into our Ethereum price prediction, Ethereum is the only cryptocurrency that is currently available to institutional investors as a futures contract, approved in October 2023 by the SEC. It is also seen as the next candidate for ETF approval, reflected in the markets the day after Bitcoin ETF approval with a 9% ETH price pump. There are already 7 Ethereum ETF spot applications registered with the SEC, with the first approval deadline set for May 23rd, 2024, and a Bloomberg analyst giving them a 70% chance of being approved.\n\nEthereum Price Predictions 2024-2050\n\n\n\nHere we take a look at what is in store for the Ethereum network in each of the coming years, along with the impact it could have on the price of Ethereum, and we make an Ethereum price prediction for each year.\n\nETH Price Prediction for 2024\n\n2024 is shaping up to be an exciting year for the world of cryptocurrencies, especially Ethereum.\n\nLooking at the technical indicators on the weekly chart for Ethereum, we find that the 50-day simple moving average (SMA) is toying with the 200-day SMA after coming down to touch in Q2 of 2023. The last time this happened was in late 2020, when a “golden cross” movement had ETH make the move upward to make those ATHs 12 months later.\n\nEthereum has also broken upward out of the trading channel on the chart below, but has met heavy resistance at $3,000—just as the Bitcoin price has also net heavy resistance at $52,000. If the current rally is sustained and Ethereum sustains this breakout then we could have the same scenario as in 2020–2021 on our hands, wit the potential of new all-time highs.\n\nMany things could help to spur this move onward, not just market sentiment built on indicators. These other factors include the upcoming deadline for Ethereum ETF approval in May, increasing investor confidence throughout the year as the Fed cuts interest rates, and the release of the Dencun upgrade for the network, targeted for March 13th, that will make Ethereum more secure and introduce faster operations for layer-2 scaling solutions.\n\nAll-in-all, our Ethereum price prediction 2024 is a low of $2,200, a high of $4,200, and a median price of $3,600.\n\nETH Price Prediction for 2025\n\nIt is widely predicted that the cryptocurrency narrative in 2025 will be dominated by the effects of the 2024 Bitcoin Halving event. These Halving events typically induce new ATHs for Bitcoin and many altcoins 12–18 months after they’ve occurred, meaning that these gains are expected to arrive in 2025.\n\nAs a result, our ETH price prediction 2025 is a new ATH high of $6,600, a low of $3,400, and an average price of $4,200.\n\nETH Price Prediction for 2026\n\nIf the expected narrative is correct, and we feel the positive price effects of the 2024 Bitcoin Halving in 2025, then 2026 is when we’ll be coming down off these highs.\n\nHowever, with Crypto prices prominent in the news last year thanks to new ATHs, we can expect governments around the world to be well on the way to implementing cryptocurrency regulations. So long as these are positive and foster the continued evolution of crypto, which we expect them to and be and do, then we can expect the bleeding to be somewhat restrained by these positive developments.\n\nAdd to this the fact that scaling developments should be implemented onto the Ethereum network by this point, greatly increasing its utility, and we are mutedly bullish for Ethereum in 2026, with no new ATH predictions but sustained highs of $5,800, lows of $3,500, and an average price of $4,500.\n\nETH Price Prediction for 2027\n\nNot every year is going to be as exciting as the others, and 2027 might be that year for Ethereum. Many big regulatory moves have already been made, no Halving events are affecting the price, and the global economy should be chugging along nicely after everything has settled from the recession scares of 2022 and 2023.\n\nInstitutional use of the Ethereum protocol will hopefully continue to grow into 2027, increasing demand for ETH. However, this demand will be countered by technical improvements that make ETH cheaper and easier to use.\n\nAs a result, we may find that prices have contracted into a smaller range for 2027, with highs of $5,200, lows of $3,900, and an average price of $4,400\n\nETH Price Prediction for 2028\n\n2028 will be the year of the 5th Bitcoin Halving event, and with cryptocurrencies now mainstream and, with investors knowledgeable of the Bitcoin Halving cycle and the expected increase in cryptocurrency prices, we can expect rises in the price of Ethereum based on investors speculation. However, will the Ethereum and Bitcoin prices have decoupled by this point? It is unlikely, and ETH will still be at BTC’s mercy.\n\nThis is why we predict highs of $6,300—close to the ATHs set in 2025 as no one wants to buy higher than this just yet. We also predict lows of $4,200, and a high median price of $5,800.\n\nETH Price Prediction for 2029\n\nIn 2029 we can expect most of Ethereum’s planned upgrades to either be complete or very close to implementation. Here we’re likely to see growing institutional and public use of the network for all sorts of business and personal use cases that greatly impact the way we conduct commerce and value transfer.\n\nOn top of this, while everyone thought the Bitcoin Halving event was priced in, prices continue to climb and Ethereum, if it retains the title of the most used and most popular smart contracting platform in the world, could see its first 5 figure ATH of $10,200, a low of $7,100, and an average price of $8,800.\n\nETH Price Prediction for 2030\n\nIf Ethereum has retained its place as the top altcoin then we could see it decouple from the Bitcoin price, and the fallout from the Bitcoin Halving event, if it does hit the crypto market at all, will hardly impact the Ethereum price, helping to bring greater price stability to ETH.\n\nWe should also be in, or close to, the Splurge section of the Ethereum roadmap, where developers are tidying up the existing code and fine-tuning the Ethereum protocol. It is also highly likely that new ideas will be under development by this point, and may even be close to implementation—with the possibility of taking blockchain technology and cryptocurrencies to new heights.\n\nWith all that said, 2030 could bring much more stability to the Ethereum price with people looking to the future for it to be a major part of society. This is why we’re predicting a much tighter range, with highs of $9,600, lows of $8,800, and an average price of $9,000\n\nFactors Influencing Ethereum’s Price\n\n\n\nThere are numerous items that affect the price of Ethereum. The most important of those have been detailed here.\n\nBitcoin: Arguably the biggest influence on any altcoin is the price of Bitcoin and the happenings on the Bitcoin network. The price action of Ethereum, just like any other altcoin, is closely tied to that of the world’s #1 cryptocurrency.\n\nHere we must also mention the Bitcoin Halving, which has historically driven Bitcoin and all altcoins to new ATHs 12–18 months after the event occurs. The next Bitcoin Halving event is due to happen in April of 2024 and investors will be watching it closely.\n\nRegulator’s Definition of Ethereum: In June of 2023, the SEC separately sued both Coinbase and Binance, labeling Ethereum as a security in both lawsuits (prompting large drops in the price of Ethereum). The New York General Attorney also called Ethereum a security in 2023, in a lawsuit against the KuCoin exchange.\n\nUntil these regulators remove this label, the presumption that ETH is a security will keep downward pressure on the price. However, when, or if, this is cleared up, we could likely see the price of Ethereum skyrocket.\n\nRegulatory Landscape: Changing the stance on Ethereum as a security is one thing, but once regulators around the globe begin enacting regulations for cryptocurrencies there’ll be a lot clearer picture for retail investors about what will happen to them if they use or interact with cryptocurrencies.\n\nRegulations permitting and clarifying the use of crypto will likely result in positive price action, whereas those decrying and restricting crypto are likely to drive negative price action.\n\nInstitutional Usage Rate: If Ethereum is accepted under a regulatory framework in some of the world’s biggest economies then this gives institutions and corporations the green light to begin using it for products and services—which could include everything from identity solutions, to tokenized assets and supply chain tracking.\n\nThe news of big companies or institutions choosing to use Ethereum is sure to drive price action, while the increase in network traffic brought by such use will also drive demand for ETH, increasing the price.\n\nProtocol Upgrades: The Ethereum roadmap is discussed below and there we discuss the connection between network upgrades and price movements. In short, until the price of Ethereum decouples from that of Bitcoin, protocol upgrades are unlikely to have a large price impact.\n\nHowever, if, or once, Ethereum’s price does decouple from that of Bitcoin, then protocol upgrades will have a much larger impact, expected to result in a net-positive, on the price of Ethereum.\n\nThe Macroeconomic Environment: At the moment, cryptocurrencies are seen as a monetary asset and speculative asset class. These are traditionally only popular during times of economic growth and stability. While the global economy has been quite chaotic since the global pandemic, with interest rates hitting new highs as the Fed tries to avoid an recession in the USA, an occurrence that could have a knock-on effect in other economies around the world.\n\nHowever, the worst is said to be behind us—with the Fed expected to cut interest rates 3 times or more in 2024. A return to normal means investors typically move out of safer assets and into more speculative assets, like cryptocurrencies. Ethereum is expected to be one of those cryptocurrencies thanks to its prominent position and future hopes of an EFT approval.\n\nSupply and Demand: When it switched from a PoW to a PoS network the Ethereum network’s daily reward rate was greatly reduced—and there is now the potential for it to be a deflationary asset. According to the Ether Supply Growth Chart on Etherscan, the total supply of ETH has been steadily decreasing since The Merge.\n\nThis might only be a 0.30% decrease over the course of 17 months, but as network usage grows, the supply is expected to continue decreasing. The increase in network usage will also increase demand for ETH, and these two factors combined will put upward pressure on the price of ETH.\n\nEthereum Price Analysis and Historical Sentiments\n\n\n\nEthereum was officially launched on July 30th, 2015, and the first price information for Ethereum on CoinMarketCap is from August 12th, 2015, where it was valued at $1.2222 per coin. Here we’ll briefly cover the history of Ethereum and its price action from Launch thought to today.\n\nHistorical Price Movements\n\nIn its first few months of existence, Ethereum traded below $2 and also hit its all-time low of $0.4209 on October 21st, 2015. Then, at the beginning of 2016, Ethereum started to climb, and hit local highs of $18.36 in mid-June 2016. This climb existed alongside Bitcoin’s price rise back in 2016—showing just how long altcoins, even new altcoins, have been tracking Bitcoin’s price movements.\n\nHowever, any further positive price movement was halted by the news of The DAO hack. ETH lost almost half its value over the next few months, trading as low as $7.2764.\n\n2017 was when a larger part of the world really heard about cryptocurrencies, as Bitcoin climbed from ~$900 at the beginning of the year to peak just below $20,000 in December 2017. Ethereum was one of the altcoins that faired best in this time, rising from an opening price of $8.10 on January 1st, to peak at $1,463.72 just over a year later, on January 13th, 2018—a meteoric gain of 17,970.6% that made it one of the fastest growing cryptocurrencies of the time and firmly placed it as the world’s most popular altcoin.\n\nLike Bitcoin and all other cryptocurrencies, Ethereum’s price then plummeted, reaching lows around $80 in 2018, and finding critical support at $120. Ethereum then bumbled along slowly and didn’t see prices above $1,000 again until January 4th 2021, spending most of its time between 2018 and 2021 under $400.\n\nThe last Bitcoin halving happened in May 2020 and is widely said to be responsible for the price action that started in the crypto markets in 2021, resulting in new ATHs for the majority of cryptocurrencies. Ethereum is included in that list, rallying 563% from an opening price of $737.60 at the start of 2021 to its current ATH of $4,891.70 on November 16th.\n\nFrom here the price of Ethereum steadily declined along with the rest of the crypto market as the Crypto Winter of 2022 set in—all assisted by the collapse of Luna and the Terra (UST) in May—to hit local lows of $880 in June 2022, an 82% decrease, before quickly establishing support at $1,000 and $1,275.\n\nEthereum remained at these levels for a month, until the 13th of July when it bounced off a low of $1,005.61 to start a price rise in anticipation of The Merge event, now scheduled for September 2022 after numerous delays. This culminated in highs of just over $2,000 in August.\n\nOn September 6th, the Belatrix hardfork successfully upgraded the Beacon Chain causing ETH to 15% in anticipation of The Merge on September 15th with the Paris upgrade. However, by this date Ethereum had lost these gains and was trading in the same range as it was for the Belatrix hardfork on the day of The Merge—a day where, despite the success of Ethereum’s biggest ever upgrade, ETH lost 8.29% of its price.\n\nEthereum’s Performance Post-Merge\n\nEthereum’s poor start to life as a PoS blockchain continued, as further losses throughout the remainder of September and October saw it lose another 19.74% of its value and hit lows of $1,181.76. It then traded sideways before rallying to above $1,600 for the beginning of November 2022.\n\nNovember 2022 saw the collapse of FTX and Alameda Research, which shook the crypto markets to its core, and caused huge sell-offs. Ethereum lost over 34% of its value before finding support at $1100.\n\nFrom here Ethereum has recovered well, starting 2023 with a three week rally that saw it gain 40%, and retake the same price levels as before the collapse of FTX.\n\nHowever, from here regulatory scrutiny, and vagueness, around the case of whether ETH is a security, by both the New York Attorney General, Gary Gensler, and the SEC, caused some wild individual day drops in the Ethereum price throughout 2023—some of over 15%.\n\nDespite all this regulator-induced FUD, the price of ETH continued to rise throughout the year—showing hugely positive sentiment from investors. ETH also ended 2023 on a high, thanks, in part, to gains driven by the expected approval of a Bitcoin ETF—closing 2023 at $2,282.89 with YoY gains of 91%.\n\n2024 has since been positive, and the approval of 11 Bitcoin ETFs in January 2024 saw ETH pump 9% (while Bitcoin remained stable) on expectations that it might be the next cryptocurrency to have an ETF approved. Ethereum has since followed in the lead of Bitcoin as it rallied toward $52,000 in February, and rallied up toward $3,000, with both cryptocurrencies meeting strong resistance at these marks.\n\nEthereum Price Predictions by Experts and Analysts\n\n\n\nEthereum’s position as the world’s #2 cryptocurrency by market cap and the world’s most popular smart contracting platform, means that there’s no shortage of ETH price predictions from experts and analysts. Here we’ve summarized Ethereum price predictions from some expert analysts.\n\nCathie Woods’ ETH Prediction\n\nCathie Woods, the Ark Invest CEO, has stated that she expects Ethereum to reach a $20 trillion market cap by 2030. If the circulating supply of ETH remains relatively stable between now and then, then that equates to a $160,000 to $180,000 valuation for a single ETH.\n\nBill Barhydt’s ETH Prediction\n\nBill Barhydt, the CEO of the Abra platform for private and institutional investment in cryptocurrencies, predicts that Ethereum could reach prices as high as $40,000, albeit, without specifying a timeframe. He also states that he is more bullish on Ethereum than he is on Bitcoin.\n\nFinder’s ETH Prediction\n\nA panel of experts at Finder.com, a renowned comparison website, offers an ETH price prediction that sees the world’s #2 cryptocurrency hit $5,824 by 2025 and $14,411 by 2030. Notably, this is a slight reduction in their predictions, previously given in July 2023.\n\nVanEck’s ETH Prediction\n\nThe VanEck investment management company predicts that ETH will hit a token price of $11,800 by 2030. This, they state, will be driven by “improving functionality, lower take-rates and an ethos of inclusivity.”\n\nGeoff Kendrick’s ETH Prediction\n\nGeoff Kendrick, analyst and Head of Crypto Research at the Standard Chartered Bank, predicts that Ethereum could hit $8,000 by 2026. But labeled this as only a “stepping stone” on the way to a larger valuation of $26,000–$25,000, with no timeframe given for this larger valuation.\n\nBonus Prediction: While they have not predicted the price, at the end of 2023 JP Morgan said that they expect Ethereum will outperform Bitcoin in 2024 as a result of the release of proto-danksharding on the network.\n\nWhat’s Next for Ethereum?\n\n\n\nThe Ethereum development roadmap lays out the future of the Ethereum network and how developers plan to upgrade it in the near and distant future. At the Ethereum Developer Conference in July 2022, Vitalik Buterin shared that Ethereum would only be about 55% complete after the Merge.\n\nIn the same talk, Vitalik described the next steps—which rhyme—for Ethereum’s growth, these are called the Surge, the Verge, the Purge, and the Splurge. The most updated roadmap was shared by Vitalik at the end of 2023 on X—with an added step called the Scourge. Here we’ll take a closer look at what these upgrades involve, and their potential impact on the Ethereum price.\n\nUpcoming Developments and Roadmap\n\nThe Surge:\n\nA focus on scaling and getting Ethereum to 100,000 transactions per second using a combination of scaling solutions like sharding and layer 2s like rollups. This stage, specifically the development of rollup technology, is well underway, with numerous layer 2s already deployed on the network, and a rollup friendly network update scheduled for March 13th.\n\nThe Scourge: According to Vitalik, this is “about fighting economic centralization”, specifically that caused by liquid staking platforms—issues which he raised in a blog post—like Lido, which, at the time of writing, controlled 31.61% of all the staked ETH securing the network.\n\nThe Verge: Introduces Verkle trees, which, in short, will allow for stateless clients to exist—a stateless client is a node that validates blocks but doesn’t have to store the state of the entire blockchain—lowering the hardware requirements for nodes and increasing decentralization.\n\nThe Purge: This will simplify the protocol by allowing the existence of nodes that only store the last year of data, significantly reducing their storage requirements, reducing network congestion, and making it easier to participate in the network.\n\nThe Splurge: The tinkering phase, where developers are making sure that everything already done is working smoothly, and adding upgrades to fine-tune all the elements of the protocol.\n\nPotential Impacts on ETH Price\n\nThese protocol upgrades will happen over a course of 5–10 years, and it is likely to be closer to the higher end of that period before we’re near the Splurge. If we look back at the most significant protocol upgrades in Ethereum’s history, detailed in the Historical Evolution of Ethereum section earlier, and the price action around them, we find little to no correlation between the release of these upgrades and price movements in either direction.\n\nIndeed, Ethereum seems to correlate much more tightly with movements in the price of Bitcoin and the wider crypto market than it does with any calendar of previous protocol upgrades.\n\nAs an example, the two hardforks, Belatrix and Paris, that initiated The Merge—the biggest and most anticipated event in Ethereum history—happened in the first half of September 2022. Over the course of that month Ethereum saw gains of just 1.57%.\n\nAs a result, it is unlikely that upgrades to the Ethereum protocol will significantly impact its price. That is, at least until it has decoupled from tracking the price of Bitcoin.\n\nBottom Line for Ethereum Price Prediction\n\n\n\nPrice predictions are just that, predictions, and those that you’ve read here should not be taken as gospel. There are many Ethereum price predictions out there and this one, looking at technical indicators for the short term, and diving deep into the many technical, economic, and regulatory factors for the long term, has returned a positive price prediction for the future of Ethereum\n\nIf we’re to look to the other end of the scale, for balance, we need to look no further than the words of successful investor Warren Buffet, who is one of the world’s 10 richest people: ”In terms of cryptocurrencies generally, I can say almost with certainty that they will come to a bad ending.”\n\nFAQs\n\nWill ETH Price Cross Key Milestones? (e.g., $3,000, $5,000)\n\nAccording to our comprehensive Ethereum price prediction, Ethereum will be back above $3,000 in 2024, and will climb above $5,000 to hit new ATHs of $6,600 in 2025. Furthermore, we expect Ethereum to reach $10,000 in 2029.\n\nIs Ethereum a Good Long-Term Investment?\n\nIn our in-depth Ethereum price prediction, which takes into account a myriad of factors, we find that Ethereum is indeed a good long-term investment as the price of Ethereum is likely to increase multiple-fold between now and 2030—making it a solid pick for any investor.\n\nRisks and Considerations in Ethereum Investment\n\nThose investing in Ethereum should know that it comes with many risks and price influences. These include regulatory scrutiny, price volatility, and the macroeconomic climate. We dive into these elements in detail in our Ethereum price prediction for 2024-2030. Investors also have to consider exchange hacks and how they should store their coins."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8yMy9ldGhlcmV1bS1pbnRlcm9wZXJhYmlsaXR5LWh1Yi1wb2x5bWVyLXJhaXNlcy0yM20tc2VyaWVzLWEtZnVuZGluZy1mcm9tLW1hcnF1ZWUtaW52ZXN0b3JzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8yMy9ldGhlcmV1bS1pbnRlcm9wZXJhYmlsaXR5LWh1Yi1wb2x5bWVyLXJhaXNlcy0yM20tc2VyaWVzLWEtZnVuZGluZy1mcm9tLW1hcnF1ZWUtaW52ZXN0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Interoperability Hub Polymer Raises $23M Series A Funding From Marquee Investors - CoinDesk",
        "content": "\"Existing interoperability solutions such as token bridges are widely used but have proven unreliable and susceptible to hacks, leading to a lack of standardization within the Ethereum ecosystem with billions lost in exploits,\" Polymer Labs said in an emailed announcement on Tuesday."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvLm5ld3Mvc2VjLWNvbW1pc3Npb25lci1ldGhlcmV1bS1ldGYtYXBwcm92YWxzLXdvbnQtYmUtc2FtZS1hcy1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "SEC Commissioner: Ethereum ETF approvals won't be same as Bitcoin - crypto.news",
        "content": "SEC Commissioner Hester Peirce said that the Ethereum ETF approval process won’t be the same as Bitcoin, as the SEC has learned several lessons from the spot Bitcoin ETF saga.\n\nIn an interview today with Zack Guzmán, Peirce said that the SEC shouldn’t need to be persuaded by a court to approve crypto-backed ETFs eventually. Peirce mentioned that the regulators will change their approval process for ETH ETF applicants, and they will make regular consumer and market considerations, as it does with all ETF products.\n\n“We shouldn’t need a court to tell us that our approach is arbitrary and capricious in order for us to get it right.” – Hester Peirce, SEC Commissioner\n\nNEW: SEC Commissioner Hester Peirce tells me the SEC won't repeat the same mistakes with ETH ETFs after fumbling Bitcoin ETFs:\n\n\n\n\"That's not how we're going to do our approvals … I think that kind of a lesson will certainly stick with us.pic.twitter.com/QNu52Gmr3H — Zack Guzmán (@zGuz) January 23, 2024\n\nYou might also like: Coinbase faces headwinds as Bitcoin and ETF interest dips, says JPMorgan\n\nThe Commissioner also expressed her frustration over the long delays in Bitcoin ETF approvals, as she always thought these products met the requirements for approval long ago.\n\nPeirce also shed light on the SEC’s X account hack, which previously posted the fake approval post, leading to a brief market manipulation. She believes the hack might not have happened if the SEC hadn’t built up so much attention around these approvals and that the agency could’ve avoided this by using its regular approach to ETF applications.\n\nThe lack of heightened anticipation will be a key consideration in Ethereum ETF approvals, as the SEC shouldn’t be building hype around a regulatory decision.\n\nPeirce further emphasized that approving spot Bitcoin ETFs doesn’t necessarily mean that the SEC will change how it regulates crypto. She also mentioned that the agency is not in the business of policing crypto, rather its focus will also be on regulating securities products based on crypto that trades on securities exchanges, just as it does with the gold market.\n\nFollow Us on Google News"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXZhbGlkYXRvcnMtcmVsaWFuY2Utb24tZ2V0aC1zcGFya3MtY2xpZW50LWRpdmVyc2l0eS1wdXNoLWJ5LWNvaW5iYXNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum validators' reliance on Geth sparks client diversity push by Coinbase - CryptoSlate",
        "content": "Coinbase, a leading cryptocurrency exchange, announced plans to diversify its execution clients amidst concerns over the dominance of go-Ethereum (Geth).\n\nIn a Jan. 23 statement on the social media platform X (formerly Twitter), Coinbase Cloud disclosed ongoing evaluations to identify alternative qualified execution clients for its platform while acknowledging the growth being made in the industry.\n\n“Alternative execution clients have come a long way, and so we are conducting an updated technical assessment with the goal of adding another execution client to our infrastructure,” Coinbase said.\n\nThe Brian Armstrong-led exchange added that it will release a formal update on the process by the end of February.\n\nGeth dominance raises concern\n\nGeth is an Ethereum execution client responsible for handling transactions and the deployment of smart contracts. According to Ethereum client diversity data, 84% of Ethereum validators rely on it, raising security apprehensions within the community over its dominance.\n\nThe concerns were escalated after a bug issue briefly took all Nethermind validators (approximately 10% of the network) offline. Although a prompt fix was implemented, community members highlighted the potential impact of a similar occurrence on Geth.\n\nLachlan Feeney of Labrys, the development studio behind MEV Watch, a tool addressing censorship risks on the Ethereum blockchain, explicitly warned that stakers running Geth face the prospect of losing up to 100% of their assets in the event of critical bug discovery, which instantly halts the network chain’s finalization."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8yMTM4MDAvcG9seW1lci1sYWJzLXNlcmllcy1hLWV0aGVyZXVtLWludGVyb3BlcmFiaWxpdHktaHVi0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMzgwMC9wb2x5bWVyLWxhYnMtc2VyaWVzLWEtZXRoZXJldW0taW50ZXJvcGVyYWJpbGl0eS1odWI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Polymer Aims to Unify Ethereum Ecosystem With 'Interoperability Hub' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere’s a new entrant in the already very crowded field of Ethereum layer-2 solutions—and this one wants to be the chain that rules them all.\n\nPolymer today announced it has completed a $23 million Series A with investments from top-tier VCs in the crypto space, including Coinbase, Placeholder, and Digital Currency Group. The company plans to use the cash to build its eponymous network, which it describes as “the first Ethereum Layer 2 that provides interoperability-as-a-service to Ethereum and its rollups.”\n\nWhat that means, essentially, is that Polymer aims to be a hub, of sorts, for Ethereum and all other Ethereum-based networks, such as Arbitrum and Optimism. It’s the network you’d use to defragment the vast Ethereum ecosystem, and the one that would make sure that the financial data, assets, and applications across the ecosystem all play nice—at least, that’s the plan.\n\nAD\n\nAD\n\nTo do that, Polymer uses the Cosmos IBC protocol. Cosmos basically provides the software framework from which all manner of blockchains can be built. There are many popular Cosmos-based chains on the market today, such as Injective, Cronos, Thorchain, and the buzzy Celestia. The Polymer team thinks IBC can be to Web3 what TCP/IP was for the internet.\n\n“There were several different organizations and universities that established TCP/IP as the internet’s standard. We’re one of those organizations trying to establish IBC as the standard for interoperability in Web3,” Polymer co-founder Peter Kim told Decrypt.\n\nThe interoperability holy grail\n\nPolymer aims to empower developers to build cross-chain applications by introducing a “neutral standard” that can be used to deploy applications on multiple chains, without the usual headaches that this entails. The standard, according to Polymer, will allow applications on different chains to communicate with each other—without introducing new trust assumptions.\n\nUniversal communication across blockchains is hard, and users end up carrying the burden of this by being confined to only using applications that are available on the blockchain or layer-2 network they’re using at any given time. This results in users typically picking a chain where they place most of their capital and leaving it there. And this can be especially problematic in the Ethereum ecosystem.\n\nData can’t be passed between decentralized applications on different layer 2’s because the system “lacks a decentralized and open interoperability standard,” Polymer said in a press release. As such, Ethereum and its many rollups are the first market Polymer is focusing on.\n\nAD\n\nAD\n\nPolymer co-founder Bo Du told Decrypt that while Polymer is still in a private testnet, he encourages builders working on interesting projects to reach out to him directly so that he can “get them building right away.” Once they’ve moved on from their private testnet, they’ll be launching a partner program to help onboard new developers.\n\nDu will have plenty of competition though. Ethereum is littered with layer-2s, rollups and sidechains that all compete for both market and mindshare. Throughout the years, we’ve seen many Layer 1’s and 2’s make a big splash—only to fizzle out due to not being able to capture the attention of builders. There was a point in time where even Tezos was called a “ghost chain” due to its lack of developer attention. There are only so many crypto devs to go around, after all—and fewer and fewer every year, according to Electric Capital.\n\nBlockchain interoperability is also something of a “holy grail” in crypto—and has been for some time. Competing Ethereum-based network Layer Zero has also thrown its hat in the interoperability ring, and has seen a lot of usage—although it’s largely driven by speculation that early participants will receive an airdrop.\n\nWhy neutral standards are important\n\nStill, Polymer believes it can set itself apart from the pack by introducing a “neutral standard” that other Ethereum-based chains will then abide by.\n\n“The reason standards are important is that any of these subprotocols can be difficult for an application developer to spec out, implement, and most importantly, do the prior two correctly,” Du told Decrypt.\n\nIn other words, having no standards in place for cross-chain operability makes building applications that facilitate it far more challenging. Developers have to essentially build everything from scratch. If you’re a developer building a cross-chain application, you need to build an integration for each chain you want to be compatible with. Without standards in place, each of these integrations looks different. Each chain integration is a new problem for a dev team to figure out.\n\nBut creating a new standard is easier said than done.\n\nYou not only need to build the product, you then need to build the social consensus from the community being addressed.\n\nAD\n\nAD\n\nPolymer believes the best way to achieve this is through neutrality, and making it as easy and robust as possible for developers to work with. The company acknowledges that there are others out there already addressing cross-chain operability, but it believes those competitors sacrifice neutrality in exchange for simplicity or speed to market.\n\nWhat’s more, both chain developers and application developers are more likely to adopt standards that are neutral and not tied to any one company. While Polymer is, in fact, a company, IBC is an open-source framework—one that has the neutrality that Polymer believes it needs in order to become the new standard for interoperability."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS13aGFsZS1tb3Zlcy00Ni1taWxsaW9uLWluLWV0aC1hY3Jvc3MtYmluYW5jZS1iaXRmaW5leC1hbmQtYWF2ZS1kZXRhaWxz0gFjaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLXdoYWxlLW1vdmVzLTQ2LW1pbGxpb24taW4tZXRoLWFjcm9zcy1iaW5hbmNlLWJpdGZpbmV4LWFuZC1hYXZlLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Whale Moves $46 Million in ETH Across Binance, Bitfinex and Aave: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a surprising move that has captured the attention of the cryptocurrency community, an Ethereum (ETH) whale has orchestrated a series of transactions involving major exchanges, moving a staggering $46.02 million in ETH over the past two days. The entity, utilizing a network of eight wallets, withdrew funds from Binance and Bitfinex before staking with Lido, a liquid staking solution.\n\nAdvertisement\n\nBlockchain analytics platform Spot On Chain first brought attention to the substantial transactions through a tweet, revealing intricate details of the massive ETH movement. The whale withdrew the Ethereum holdings from crypto exchanges Binance and Bitfinex at an average price of approximately $2,419.\n\nOver the past 2 days, an entity with 8 wallets withdrew $46.02M in $ETH from #Binance and #Bitfinex at ~$2,419, then staked with #Lido:\n\n\n\n- 5 wallets withdrew 50.15M $USDT from #Aave to CEX for 19,021 $ETH ($46.02M).\n\n\n\n- 3 wallets still hold ~30M $USDT in #Aave and may deposit it… pic.twitter.com/vqPYTTaWjT — Spot On Chain (@spotonchain) January 23, 2024\n\nSubsequently, five wallets were employed to withdraw 50.15 million USDT from Aave, a prominent DeFi protocol, to the CEX trading platform, exchanging the stablecoin for 19,021 ETH, equivalent to the $46.02 million value. Spot On Chain further disclosed that three wallets still retained around 30 million USDT in Aave, sparking speculation that they might deposit these funds into a CEX soon, potentially acquiring more ETH.\n\nEthereum price struggles\n\nThe timing of these transactions coincided with a challenging period for the Ethereum market. At the time of the whale's activity, the price of ETH struggled, recording a 4.57% dip in the last 24 hours and a 9.46% decline in the past week. Current market data indicates ETH trading at $2,296.\n\nCoinglass, another analytics platform, reported a significant amount of liquidations for ETH within the last 24 hours, totaling $53.78 million. Of this amount, $47.48 million resulted from long liquidations, while short liquidations accounted for $6.29 million. The liquidation data underscores the volatility and uncertainty prevalent on the market, with traders experiencing significant losses."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJhbHRpY3RpbWVzLmNvbS9ldGhlcmV1bV9zX3JlY29yZF9udW1iZXJfb2ZfaG9kbGVyc19kb3duZ3JhZGVzX2JpdGNvaW5fdG9fc2Vjb25kX3BsYWNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's record number of hodlers downgrades Bitcoin to second place - Baltic Times",
        "content": "Comparisons between Bitcoin and Ethereum have made the topic of many crypto debates, leading to many different conclusions. Bitcoin is the holder of many notable records and achievements, including being the first decentralized cryptocurrency established by Satoshi Nakamoto in 2009, the most valuable digital asset and the one that occupies the largest share in the cryptocurrency market. As a result, Ethereum, which was founded in 2015 by Vitalik Buterin, has always lived in Bitcoin’s shadow, alongside all the other digital currencies that emerged in its wake, forming the altcoin pack.\n\nHistorical cryptocurrency data reveals that the two assets have moved in tandem, with the flagship crypto dictating the price trajectory. Judging by the difference between the current Ethereum price and the Bitcoin price, the latter wins by a landslide. Ethereum always seems to be several steps behind Bitcoin, unable to pose a real threat to its dominance and yank it off its throne.\n\nHowever, if we delve a bit deeper, we can see that the altcoin leader also showcases a series of strong suits and key metrics that place it at the top of the cryptocurrency hierarchy, in front of its longtime rival, and hodler count is one of the areas where Ethereum excels.\n\nEthereum hits record number of hodlers in 2023\n\n2023 has been a good year for Ethereum for several reasons. The second-ranked crypto has been on an appreciation journey for the better part of the year, with a 20% gain in the last month and a 38% gain over the past 60 days. Apart from the considerable price increase, Ethereum has also seen a significant surge in hodler numbers.\n\nHodler is a popular crypto slang term that designates long-term holders of a cryptocurrency. These investors buy and hold onto assets regardless of price volatility, trusting their long-term value and their ability to weather market fluctuations.\n\nAccording to IntoTheBlock data, addresses that have held Ether for more than 12 months currently make up 72% of all Ethereum holders, reaching the highest level since 2018. At the moment, Ethereum counts approximately 73.9 million long-term holders, after a 44.2% increase, while Bitcoin’s holder figures stand at 33.6 million.\n\nHodlers play an important role in the health and performance of digital assets. Coins backed by a large number of holders tend to be less susceptible to market volatility and are generally perceived as more resilient and trustworthy. So, the fact that Ethereum’s holder community is growing is certainly a positive development for the network.\n\nIn addition, Ethereum also outclasses Bitcoin in terms of whales, which refers to persons or entities that own a large amount of a single cryptocurrency, between 1000 and 10,000 coins. By the latest count, the number of Ethereum whale addresses has recently reached 5,370, marking a 12% yearly increase, while Bitcoin whale wallets amount to 1,920.\n\nThis proves that Bitcoin is not the only coin boasting record-breaking performances in the cryptocurrency ecosystem. Ethereum outshines the original crypto in many ways, so even though there’s still a huge price discrepancy between the two, the top altcoin continues to attract an increasing number of investors.\n\nWhat prompted Ethereum’s holder increase?\n\nNot too long ago, Bitcoin used to hold supremacy in hodler numbers as well. What’s more, both Bitcoin and Ethereum have had impressive runs this year and recorded increases in their hodler metrics. So, what exactly caused the tables to turn and lead to such a notable disparity between the two assets?\n\nEthereum’s surge in long-term holders can be attributed to a series of factors. One of the most likely causes for the increase is the rise in Ethereum staking registered this year. The amount of staked Ether has nearly doubled since the beginning of 2023, with roughly 24% of all Ethereum’s circulating supply being locked in staking deposits. Since most staked funds remained untouched for more than 12 months, this led to a major rise in the Holder Ratio.\n\nHowever, there are other factors that have contributed to the phenomenon which have to do with the purpose and the evolution of the two crypto projects. On one hand, Bitcoin has continued to operate as a deflationary store of value and a peer-to-peer form of digital money, so it hasn’t strayed away from its original purpose and use cases.\n\nOn the other hand, Ethereum has undergone massive transformations since its launch back in 2013. Designed by Vitalik Buterin as a programable blockchain, Ethereum started its journey as a platform that enables the deployment of decentralized apps (dApps). However, over the years and after multiple upgrades and updates, the Ethereum ecosystem expanded considerably, with applications and use cases spanning across many other areas, including gaming, decentralized finance (DeFi), and non-fungible tokens (NFTs).\n\nBitcoin is clearly more established and mainstream than Ethereum, having a longer track record in the market and being superior in terms of price performance and scalability. Ethereum is in a weaker position from this point of view, but price action is not the only aspect that attracts investors and drives crypto adoption.\n\nThe fact that Ethereum boasts a diversity of use cases and represents a hub for innovation in the crypto sphere has caught the eye of stakeholders and that has led to an increase in hodler numbers.\n\nThe Ethereum network also seems to respond better to the changing needs and demands of market participants. The Merge and Shapella upgrades, which saw Ethereum switch from a proof-of-work (PoW) consensus protocol to a proof-of-stake (PoS) mechanism, stand as proof of Ethereum’s adaptability, flexibility and its constant focus on innovation. These attributes have turned it into a decentralized blockchain powerhouse and continue to draw in more investors and holders.\n\nFinal thoughts\n\nEthereum’s record number of long-term holders might not be enough to steal the leader position from Bitcoin, so it’s rather premature to make assumptions about a potential flippening in the near future. However, changes in this key metric serve as an indicator of Ethereum’s strength and potential and are worth taking into account by crypto enthusiasts."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1hYm91dC10by1sb3NlLTQwMDAwLWV0aGVyZXVtLWV0aC1pbi1kYW5nZXJvdXMtcG9zaXRpb24tc2hpYmEtaW51LXNoaWItYXQtbG9jYWwtc3VwcG9ydNIBdmh0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1hYm91dC10by1sb3NlLTQwMDAwLWV0aGVyZXVtLWV0aC1pbi1kYW5nZXJvdXMtcG9zaXRpb24tc2hpYmEtaW51LXNoaWItYXQtbG9jYWwtc3VwcG9ydD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum finds itself shaky on the edge of a precarious position. The recent price chart indicates a concerning situation: the 26-day Exponential Moving Average (EMA), a key indicator of short-term momentum, is under threat. If this level fails to hold, Ethereum could see its value dip to the $2,347 mark, a scenario that may well trigger a more pronounced decline.\n\nThis potential slip below the 26 EMA is crucial because it suggests a weakening in buying pressure and a shift in market sentiment from accumulation to potential distribution. A break below this level would not only establish $2,347 as the next price floor but could also exacerbate the asset's losses, leading to further bearish momentum.\n\nETH/USD Chart by TradingView\n\nThe Ethereum ecosystem has faced its share of challenges despite the rise of layer 2-networks, which have not catalyzed the anticipated rally. The broader market has similarly not exhibited the explosive bull run many investors had hoped for, with Ethereum’s trajectory reflecting this subdued market energy.\n\nAdditional support and resistance zones can be gleaned from the chart. On the support side, following the $2,347 level, the next critical support lies around $2,175.2 - a breach of which could see ETH test the psychological and technical support near the $2,000 level. Resistance, on the other hand, is firmly established at the recent high of $2,547.6. This price point serves as a litmus test for Ethereum’s ability to rebound and reclaim bullish momentum.\n\nThe current market dynamics, marked by cautious trading and a lack of definitive direction, have placed Ethereum in a zone of uncertainty. Investors are advised to monitor these levels closely, as a break below or above these could signal Ethereum's next significant move.\n\nBitcoin in trouble\n\nBitcoin finds itself at a precarious juncture as it teeters on the edge of the critical $40,000 mark. The recent price action paints a troubling picture for Bitcoin enthusiasts, with the asset losing its grip on the 50-day Exponential Moving Average, a key support level that has historically indicated bullish sentiment.\n\nAs Bitcoin's price struggles to maintain the $40,000 level, the next potential foothold lies at the 100-day EMA. However, this level does not traditionally offer substantial support, and a breach below could precipitate a fall below $39,000, triggering heightened market concern. The chart reveals that the next major support zone stands near the $35,888 mark, a level that buyers might attempt to defend vigorously.\n\nOn the resistance front, Bitcoin faces a significant challenge at the $42,786 price level. Overcoming this resistance is crucial for Bitcoin to regain stability and demonstrate potential for a recovery. However, the market currently lacks the necessary liquidity to facilitate a strong rebound, as trading volumes remain relatively low.\n\nShiba Inu gets hit\n\nThe token is currently trading at a local support level, which is a make-or-break situation for its short-term future. A breakdown below this point could spell trouble, signaling a potential decline and testing the resilience of its investor base.\n\nThe current market landscape for SHIB is challenging, with a noticeable lack of growth catalysts and low liquidity in the broader cryptocurrency market, both of which could exacerbate the asset's precarious position.\n\nHowever, there is a glimmer of hope. The descending trading volume accompanying SHIB's price consolidation suggests that bearish momentum could be waning. This deceleration of selling pressure often precedes a stabilization of price, or even a reversal if bulls regain control.\n\nIn terms of specific price levels, SHIB is currently finding tentative support around the $0.000027 mark. Should this level fail to hold, the next support zone lies near $0.000022, which may serve as a new accumulation point for buyers. On the resistance side, SHIB faces a hurdle at $0.000035, a breach of which could open the door to a retest of higher levels, possibly around the $0.000040 range."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1hZGRyZXNzZXMtZ2V0aC1kb21pbmFuY2UtY29uY2VybnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Coinbase addresses Geth dominance concerns with client diversity - Cointelegraph",
        "content": "Cryptocurrency exchange Coinbase is working to add another Ethereum execution client to its infrastructure as critics continue to sound the alarm over Geth dominance across the ecosystem.\n\nA post on X (formerly Twitter) published on Jan. 22 drew attention to the exchange’s renewed efforts to move away from its total dependence on go-ethereum, or Geth. As the thread details, Coinbase Cloud found that Geth was the only Ethereum execution client that met its technical requirements when it launched Ethereum staking.\n\n1/ Execution client diversity on Ethereum is a critical concern for all of us at Coinbase. Here’s what we’re doing about it. ↓ — Coinbase Cloud ️ (@CoinbaseCloud) January 23, 2024\n\n“Although we’ve evaluated execution clients since 2020, none have met Coinbase Cloud’s requirements to date. Many other operators on the network have reached the same conclusion, which is part of the reason why 84% of Ethereum validators run Geth. However, the tide is turning,” the thread reads.\n\nGeth is an Ethereum execution client that handles transactions and the deployment and execution of smart contracts.\n\nRelated: Ethereum devs air concern over Vitalik’s plan to increase gas limit\n\nCoinbase is now undertaking a technical assessment of alternative Ethereum execution clients with the intention of adding another to its infrastructure. The exchange is set to release a formal update on the process by the end of February 2024.\n\nThe exchange’s statement regarding its dependence on Geth was prompted by an X post from cryptocurrency investor Aftab Hossain. Posting from his DCinvestor profile, which has around 236,000 followers, Hossain unpacked his decision to unstake Ether (ETH) from Coinbase due to its reliance on Geth:\n\ndear @coinbase\n\n\n\ntoday, i unstaked all of the ETH i had staked with you since the first day you offered it as a service. i kept it there to earn passive yield, but also to support your work for the crypto industry (which i greatly value)\n\n\n\nbut i can't ignore the risks of what… — DCinvestor (@iamDCinvestor) January 22, 2024\n\n“I can't ignore the risks of what appears to be a single client staking setup (reliant on geth) at this time. If I have misinterpreted your architecture, please use this post as an opportunity to clarify it,” Hossain wrote.\n\nThe post drew a direct reply from Coinbase CEO and co-founder Brian Armstrong, who noted that the exchange was looking into the matter. Hossain also had contact with Coinbase staking product lead John Zettler and protocol specialist Bienvenido (Ben) Rodriguez, with both indicating that the exchange is working to address community feedback.\n\nCointelegraph reached out to Zettler and Coinbase regarding its reliance on Geth, the potential alternatives, and the potential risks of relying on a single execution client.\n\nRelated: Ethereum devs expect 10x lower rollup costs as Dencun upgrade hits testnets\n\nEthereum.org has a page dedicated to client diversity and estimates that 85% of all nodes operate on Geth. The page highlights the potential for a bug in Geth that affects transaction handling or execution payload, which could lead to consensus clients finalizing problematic or bugged transactions.\n\nConcerns around execution client bugs are pertinent after Ethereum infrastructure firm Nethermind addressed a critical bug in several versions of its execution client that reportedly caused users to fail to process blocks on Ethereum on Jan. 22.\n\nMagazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXRyYWRlcnMtcmVhbGl6ZS1uZWFybHktMzMtbWlsbGlvbi1pbi1sb3NzZXMtYXMtb3ZlcmhlYXRlZC1mdXR1cmVzLW1hcmtldC1jb29scy0yMDI0MDEyMzExMDDSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tdHJhZGVycy1yZWFsaXplLW5lYXJseS0zMy1taWxsaW9uLWluLWxvc3Nlcy1hcy1vdmVyaGVhdGVkLWZ1dHVyZXMtbWFya2V0LWNvb2xzLTIwMjQwMTIzMTEwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum traders realize nearly $33 million in losses as overheated futures market cools - FXStreet",
        "content": "Share:\n\nEthereum traders realized $32.73 million in losses during the crypto market correction on Monday.\n\nETH funding rate declined alongside Ethereum's price drop of nearly 7%.\n\nSentiment among traders improved, increasing the chances of a recovery in the altcoin's price.\n\nEthereum price dipped nearly 7% in the past day as the crypto market corrected on Monday. Bitcoin led the decline by dropping below $40,000, a psychologically important level, for the first time since December 3.\n\nETH price, which is correcting to the lowest level in two weeks, could be bottoming out as market participants’ sentiment improves alongside a decline in the altcoin’s funding rate.\n\nAlso read: Bitcoin bleeds below $40,000, sign of recovery or concerning dip?\n\nEthereum traders hit by $32.73 million losses in single day\n\nEthereum’s Network Realized Profit/ Loss (NRPL) metric indicates that ETH traders suffered $32.73 million in losses on Monday. This marks the first time Ethereum traders realized a loss since October 13.\n\nEthereum’s Network Realized Profit/Loss. Source: Santiment\n\nEthereum price dropped from $2,467 to $2,300 on Monday. The altcoin continued to decline on Tuesday, hitting a low of $2,285. While Ethereum’s price is currently in a downward trend, some on-chain indicators suggest that the altcoin could begin a recovery.\n\nTwo key metrics, Ethereum’s funding rate and weighted sentiment, suggest that ETH price trend could reset. The sentiment among traders, according to data from crypto intelligence tracker Santiment, recovered from its 2024 low of negative 0.89 on Monday to negative 0.75 on Tuesday.\n\nMeanwhile, the funding rate is considered a key predictor of the Ethereum price trend. If the funding rate declines while the sentiment among traders improves, it indicates there is a cooling-off in the derivatives market.\n\nEthereum price could begin its recovery following the completion of the ongoing correction.\n\nEthereum funding rates and price. Source: Coinalyze\n\nEthereum weighted sentiment. Source: Santiment\n\nTo the downside, Ethereum price could find support at $2,232, the 50% Fibonacci retracement level of its decline from April 2022 to June 2022. Should the current selling pressure abate at this level, ETH price could reboundand make a recovery to its 2023 peak of $2,446.\n\nETH/USDT 1-day chart\n\nHowever, a daily candlestick close below $2,232 could invalidate the bullish thesis. If Ethereum price drops further, the bearish imbalance zone between $2,086 and $2,056 could act as the next support zone."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL3NvbGFuYS1kb21pbmF0ZXMtZXRoZXJldW0tYml0Y29pbi1uZnQtYWN0aXZpdHkv0gFXaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9zb2xhbmEvc29sYW5hLWRvbWluYXRlcy1ldGhlcmV1bS1iaXRjb2luLW5mdC1hY3Rpdml0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Solana Dominates Ethereum, Bitcoin In NFT, Activity: What’s Next For SOL? - NewsBTC",
        "content": "According to on-chain data from SolanaFloor, Solana is dominating other blockchains, including Ethereum and Polygon, across various non-fungible token (NFT) activity metrics in the third week of January.\n\nSolana Dominates Ethereum, Bitcoin In NFT Activity\n\nIn a post shared on X on January 23, Solana maintained its NFT dominance among competing blockchains, mainly Ethereum and other high throughput alternatives. Thus far, the blockchain has the highest numbers in unique wallets, transactions, unique buyers, and first-time wallets over the past week.\n\nTo illustrate, Solana had over 106,000 unique wallets by the third week of January 2024. This is more than twice those created in Ethereum. Meanwhile, there were over 22,000 first-time wallets on Solana, roughly 3X those in Ethereum and 2X in Bitcoin.\n\nAt the same time, more than 2.8 million transactions were posted on Solana. This figure is over 20X those in Ethereum during the same time frame.\n\nExtrapolating from this data suggests that the blockchain is increasingly popular among NFT projects, collectors, and traders. Several factors could be contributing to Solana’s NFT success.\n\nThe platform is known for its high throughput and low transaction fees. Considering how minters and active traders are sensitive to trading fees, Solana is emerging as a layer-1 option for projects wishing to enjoy the security of the mainnet while also benefiting from low transaction fees.\n\nLegacy chains, including Ethereum, continue to struggle with on-chain scalability. Minting on the mainnet often translates to high fees, which can decrease profitability, especially for active traders and collectors.\n\nBeyond scalability advantages, Solana’s ecosystem is rapidly expanding. Despite the catastrophic drop of SOL prices at the end of 2022, the spectacular revival in 2023 activated on-chain activity with meme coins blooming and NFT projects opting to launch on Solana.\n\nThe ongoing recovery of SOL and the increasing number of projects opting to deploy on the mainnet could further drive on-chain activities, including NFT minting and trading, to new levels in 2024.\n\nDevelopers At Work, Will SOL Reclaim $125?\n\nAs the network draws users, its developers are also working to make the platform more robust and decentralized. In 2024, Solana developers plan to activate Firedancer, a validator client developed by Jump Capital. This client will help further decentralize Solana’s infrastructure, improve performance, and substantially improve reliability, eliminating network hitches that plagued the blockchain in 2022 and early 2023.\n\nSOL is cooling off, trading at around $80 when writing. The coin is down 34% from December 2023 peaks and below the dynamic 20-day moving average, pointing to bears.\n\nKey support remains at around $70. If there is demand at this price point, SOL may recover and retest $125 in the sessions ahead.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3MvY29pbmJhc2UtdG8tYWRkcmVzcy1ldGhlcmV1bS1jbGllbnQtZGl2ZXJzaXR5LXdvZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Coinbase to address Ethereum client diversity woes - crypto.news",
        "content": "Cryptocurrency exchange Coinbase has announced plans to diversify its Ethereum execution client infrastructure.\n\nCoinbase’s decision comes in response to the increasing dominance of Geth (go-ethereum) in the ecosystem, which has been a point of contention among industry experts and stakeholders. The company announced the initiative in a Jan. 23 X post. According to the thread published by Coinbase Cloud, since its inception, Geth was the only Ethereum (ETH) execution client that fulfilled the company’s technical needs for Ethereum staking.\n\nAlthough we’ve evaluated execution clients since 2020, none have met Coinbase Cloud’s requirements to date. Many other operators on the network have reached the same conclusion, which is part of the reason why 84% of Ethereum validators run Geth. However, the tide is turning. Coinbase Cloud | Source: X\n\nYou might also like: Uranium Finance hacker executes $2.5m BUSD transfer to Ethereum\n\nGeth plays a crucial role in the Ethereum network, handling transactions and the deployment and execution of smart contracts. The dominance of Geth has raised concerns about centralization and the risks associated with a single client.\n\nCoinbase is now proactively conducting a technical assessment of alternative Ethereum execution clients and is committed to integrating another client into its infrastructure. The exchange plans to provide a comprehensive update on this process by the end of February 2024.\n\nThe situation underscores a broader issue within the Ethereum network, as highlighted by Ethereum.org. The website notes that approximately 85% of all nodes operate using Geth, raising the specter of systemic risks should a major bug occur, affecting transaction processing or allowing for the execution of payloads.\n\nThis concern gained further traction following a critical bug discovered in several versions of Nethermind’s execution client on Jan. 22, which reportedly led to processing failures of blocks on Ethereum.\n\nFollow Us on Google News"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2pwLW1vcmdhbi1zYXlzLXNwb3QtZXRoZXJldW0tZXRmcy1hcHByb3ZhbC1pcy1uZXh0LXdpdGgtNTAtY2hhbmNlcy_SAWJodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9qcC1tb3JnYW4tc2F5cy1zcG90LWV0aGVyZXVtLWV0ZnMtYXBwcm92YWwtaXMtbmV4dC13aXRoLTUwLWNoYW5jZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "JP Morgan Says Spot Ethereum ETFs Approval Is Next – With 50% Chances - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nWith the recent approval of Spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC), attention in the crypto space turns to the potential approval of Spot Ethereum ETFs. However, JP Morgan analysts, in a note to clients, have expressed skepticism about the likelihood of approval for Ethereum Spot ETFs.\n\nETH Facing Regulatory Challenges\n\nJP Morgan analysts, led by Nikolaos Panigirtzoglou, are not so optimistic about the SEC approving Ethereum ETFs. The analysts attributed their cautious stance to regulatory and judicial considerations, estimating the likelihood of approval to be no higher than 50%.\n\n“While we understand the arguments, we doubt the SEC will classify ether as a commodity by May,” said JP Morgan analysts.\n\nMeanwhile, the SEC recently delayed the decision on Fidelity’s Ethereum Spot ETF, extending the deadline to March 5, 2024, for further evaluation. Moreover, the SEC’s final decision on Spot Ethereum ETF applications is now anticipated between late January and August 2024.\n\nPerhaps, the approval of Ethereum futures ETFs in January 2024, completely acknowledging Ethereum as a commodity, brings a glimmer of hope. However, JP Morgan analysts emphasized that the SEC’s classification of Ethereum—whether as a commodity or a security—will play a pivotal role in determining the fate of Spot Ethereum ETFs.\n\nGrayscale’s Impact on SEC Decision\n\nA key date that could provide more clarity on the possible introduction of these ETFs is January 25—the deadline for Grayscale’s Ethereum Spot ETF application\n\nEarlier, grayscale, which successfully challenged the SEC in the past for rejecting its Bitcoin ETF, is now seeking approval for an Ethereum Spot ETF. Meanwhile, the SEC’s response to Grayscale’s previous success will likely influence its decision on\n\nA Balancing Act\n\nWhile the SEC’s recent approval of Spot Bitcoin ETFs may signal a positive shift, Chairman Gary Gensler’s public declaration that the agency neither approves nor endorses Bitcoin adds a layer of caution.\n\nAs, the crypto community awaits regulatory clarity while balancing scrutiny and hopes for more accessible investment options."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtY29tbWlzc2lvbmVyLWhlc3Rlci1wZWlyY2Utbm8tMDU0MTU3MjUwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "SEC Commissioner Hester Peirce: No Lawsuit Needed for Spot Ethereum ETF Approvals - Yahoo Finance",
        "content": "SEC Commissioner Hester Peirce: No Lawsuit Needed for Spot Ethereum ETF Approvals\n\nHester Peirce, a commissioner at the United States Securities and Exchange Commission (SEC), has stated that the SEC should not require a lawsuit to approve spot Ethereum (ETH) exchange-traded fund (ETF) applications. Speaking to Coinage Media, Peirce emphasized that the SEC should learn from the Grayscale court ruling that preceded the approval of spot Bitcoin ETFs in the United States. She believes that the SEC should not need a court to tell it that its approach is \"arbitrary and capricious\" in order to make the right decisions.\n\nPeirce acknowledged that the facts and circumstances vary with each ETF application, but she expects the SEC to apply the same precedent that came from the Grayscale case. She stressed the importance of ensuring that the disclosures align with how the product actually works.\n\nSeveral companies, including BlackRock, VanEck, ARK 21Shares, Fidelity, Invesco Galaxy, Grayscale, and Hashdex, have submitted spot Ether ETF applications to the SEC for approval. Bloomberg ETF analyst Eric Balchunas estimates a 70% chance of a spot Ether ETF approval by May. The SEC has specific deadlines to decide on each application, ranging from May 23 to August 7.\n\nSEC Chair Gary Gensler has previously stated that the approval of a spot Bitcoin ETF does not signal the Commission's willingness to approve listing standards for other cryptocurrency ETF applications. He emphasized that most crypto assets are investment contracts subject to federal securities laws."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1zb2Z0d2FyZS1jbGllbnQtY2VudHJhbGl6YXRpb24tc3BhcmtzLWNvbmNlcm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 15:24:43 GMT",
        "title": "Ethereum Software Client Centralization Sparks Concern - The Defiant - DeFi News",
        "content": "Alarm bells are ringing as execution client centralization mounts with 84% of nodes running Go Ethereum (Geth).\n\nBy: Pedro Solimano • Loading...\n\nDeFi News\n\nEthereum nodes are mostly concentrated in one execution client, triggering worries that a large portion of ETH can be wiped out if there’s an exploit.\n\nGo Ethereum (Geth) clients currently make up 84% of all nodes running Ethereum software, representing an important threat–especially after another client, Nethermind, encountered and resolved a bug on Sunday.\n\nThe 84% represents a 20 point surge from last year, when Geth clients ran 63.9% of Ethereum nodes.\n\nSupermajority Client\n\nSoftware engineer Cygaar pointed out that thanks to the overwhelming number concentrated in Geth, the software implementation is considered a “supermajority client.” This means that validators running Geth can finalize Ethereum’s blockchain without needing agreement from smaller clients.\n\nAccording to Cygaar, the users should diversify Ethereum clients, favoring options such as Nethermind (8.1%), Besu (4.97%) or Erigon (1.6%), among others.\n\nCygaar added that Coinbase, Binance, and Kraken are only using Geth, while the largest staking pool on Ethereum, Lido, has a 76% stake in Geth.\n\nJimmy Ragosa, governance advisor to Sismo, a sovereign identity aggregator, joked that Eigenlayer should delete all the points of users who are re-staking liquid staking tokens from protocols that run more than 67% of Geth clients.\n\nIn fact, Lido Finance has been criticized for being a source of centralization itself, commanding 74% of all liquid staking, as per DeFiLlama.\n\nMillions of ETH Destroyed\n\nThe concern, says Cygaar, is that a critical bug in the Geth client could result in millions of ETH destroyed from validators.\n\nLefteris Karapetsas, founder of privacy-focused portfolio manager, Rotkiapp, wrote that in the case of a bug that leads to the complete loss of the stake of validators running a supermajority client, “at the moment this would burn > ~20% of the entire ETH supply.”\n\nKarapetsas calls the scenario “chaos, armageddon,” which must be avoided at all costs. He added that there is no incentive to run a minority client, at the moment.\n\nBut that’s not all. A bug could also mean a chain unable to finalize, ending up “in a world with incorrect forks,” Cygaar said.\n\nKarapetsas said large stakers are in a position to make an impact.\n\n“We need Lido Finance, Coinbase, Kraken, and Figment to take action,” he said. According to him, they have the resources to easily switch their infrastructure.\n\nHe concluded, “Please take action for the good of the network and your end users.”"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8yMTM5MDQvZXRoZXJldW0tc29sYW5hLWxvc3Nlcy1waWxlLXVwLWJpdGNvaW4tc2VsbC1vZmYtc2lua3MtY3J5cHRvLW1hcmtldNIBY2h0dHBzOi8vZGVjcnlwdC5jby8yMTM5MDQvZXRoZXJldW0tc29sYW5hLWxvc3Nlcy1waWxlLXVwLWJpdGNvaW4tc2VsbC1vZmYtc2lua3MtY3J5cHRvLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Solana Losses Pile Up as Bitcoin Sell-Off Sinks Crypto Market - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and the wider crypto market are down bad this week. But some of the biggest losers near the top of the market were once recently stars of the show, including Ethereum (ETH), Solana (SOL), and Avalanche (AVAX).\n\nIn recent weeks, all three of those top 20 cryptocurrencies were making big gains as they attracted institutional investor interest. Now, each has slipped by at least 14% over the past seven days, and have posted sizable losses on the day.\n\nEthereum is down sharply this morning, per data from CoinGecko, falling 7% over the past 24 hours to a current price of about $2,200 and pushing its seven-day dip to 14%.\n\nAD\n\nAD\n\nSolana is down almost 16% over the past seven days at a current price of $82.50. It has rebounded slightly from earlier this morning, but remains down about 5% on the day.\n\nMeanwhile AVAX, which is the 11th largest cryptocurrency, has plunged 19% on the week to a current price of just under $29. Like Solana, it has shored up some of its losses since this morning, now down about 5% over the past 24 hours.\n\nIt was just over a week ago that Ethereum came just shy of hitting $2,700, its highest price since April 2022. Excitement over Ethereum grew amid the launch of spot Bitcoin ETFs as investors considered the next wave of prospective institutional adoption, particularly as BlackRock CEO Larry Fink talked up the prospect of an Ethereum spot ETF.\n\nSOL had been on a big run starting from the end of October. It was expected to take a hit during the trial of disgraced crypto mogul Sam Bankman-Fried, who was heavily invested in the asset via his now collapsed crypto empire, FTX.\n\nBut major companies such as Visa and Shopify sung the project's praises and said they'd use its blockchain. A growing developer base also meant the price of SOL shot up. It rose as high as $123 in December 2023, nearing a two-year high after plunging to a price of about $8 in December 2022.\n\nAD\n\nAD\n\nAVAX also attracted interest when investment banking giant J.P. Morgan said in November it had used the Avalanche blockchain to tokenize portfolios.\n\nLong-term holders have reason to be optimistic, though—despite the recent dips in price, both coins over a one-year period are doing well: SOL is up 239%, while AVAX has jumped by 64%. Even Ethereum is up by 35% over the last year.\n\nThe broader crypto market has taken a nosedive as it follows the price action of the biggest digital asset by market cap, Bitcoin.\n\nSince crypto fund Grayscale converted its flagship BTC fund into an exchange-traded fund (ETF) and started trading on the stock market, investors have been keen to redeem shares previously locked into the product.\n\nThis has put pressure on the price of the biggest and oldest digital coin in recent days.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdhcGUuY29tL2NlbHNpdXMtbW92ZXMtbWFzc2l2ZS1ldGhlcmV1bS1ob2xkaW5ncy10by1leGNoYW5nZS1ldGgtcHJpY2UtZG93bi00L9IBXmh0dHBzOi8vY29pbmdhcGUuY29tL2NlbHNpdXMtbW92ZXMtbWFzc2l2ZS1ldGhlcmV1bS1ob2xkaW5ncy10by1leGNoYW5nZS1ldGgtcHJpY2UtZG93bi00L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "ETH Price: Celsius Moves Massive Ethereum Holdings to Exchange, ETH Price Down 4% - CoinGape",
        "content": "Bankrupt crypto lender Celsius Networks has been moving a very large number of its Ethereum holdings to exchanges in recent days. This unstaking of ETH and moving it to exchanges comes as part of its recovery plans amid the ongoing bankruptcy process.\n\nCelsius Moves $35 Million Worth of Ethereum\n\nIn the latest insights from on-chain data provider LookonChain, the Celsius wallet has executed significant transactions in the past 10 hours. A deposit of 13,000 ETH, equivalent to $30.34 million, was made to Coinbase, while another transaction involved the deposit of 2,200 ETH, amounting to $5.13 million, to FalconX.\n\nadvertisement\n\nAs of the latest data, two staking wallets associated with Celsius continue to hold a substantial amount of Ethereum (ETH). The combined holdings in these staking wallets total 557,081 ETH, valuing approximately $1.3 billion. These transactions and the significant Ethereum holdings in Celsius wallets add an interesting dimension to the ongoing movements and activities within the crypto space.\n\nArkham Intelligence revealed that between January 8 and January 12, Celsius liquidated over $125 million worth of Ethereum (ETH) coins. As said, this sale particularly aims at repaying creditors. Concurrently, Dune Analytics reported a more extensive trend of redemptions, with over $1.6 billion worth of staked Ethereum redeemed in the same timeframe. These redemptions represent the largest recorded since the Shanghai upgrade last year.\n\nETH Price Pressure\n\nAmid the recent movement of ETH coins by Celsius, the ETH price has come under strong selling pressure. As of press time, the ETH price has tanked an additional 4% dropping under $2,350 levels. Thus, one area of concern is that the ETH price has dropped under its key demand zone of $2,388 and $2,460.\n\nIf Ethereum is unable to sustain the mentioned support, there is a potential for a retracement to the subsequent significant support level, projected to be approximately $2,000. As shown in the Santiment chart, when there are sudden increases in big transactions by wealthy investors (whales), it aligns with moments when Ethereum holders are also taking profits, according to the NRPL metric. When these large wallet owners sell to take profits, it usually puts more selling pressure on the asset and causes prices to go down."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM2OTEwL2V0aGVyZXVtLXByZWRpY3Rpb24tamFudWFyeS0yMy0yMDI0L9IBS2h0dHA6Ly9hbXAuY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM2OTEwL2V0aGVyZXVtLXByZWRpY3Rpb24tamFudWFyeS0yMy0yMDI0Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,506.30 By Jan 28, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is down -4.60% today against the US Dollar\n\nEthereum is currently trading 6.75% below our prediction on Jan 28, 2024\n\nEthereum gained 0.99% in the last month and is up 42.89% since 1 year ago\n\nEthereum price $ 2,337.01 Ethereum prediction $ 2,506.30 (8.06%) Sentiment Neutral Fear & Greed index 50 (Neutral) Key support levels $ 2,260.52, $ 2,206.97, $ 2,100.63 Key resistance levels $ 2,420.41, $ 2,526.75, $ 2,580.31\n\nETH price is expected to rise by 8.06% in the next 5 days according to our Ethereum price prediction\n\nEthereum price today is trading at $ 2,337.01 after losing -4.60% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -2.37% in the same time period. ETH performed poorly against BTC today and recorded a -1.11% loss against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,506.30 by Jan 28, 2024. This would represent a 8.06% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 0.99% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 30.74% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 42.89% 1-year price change. On this day last year, ETH was trading at $ 1,635.52.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.05. Ethereum recorded 12 green days in the last 30 days.\n\nEthereum technical analysis for today - Jan 23, 2024\n\nThe sentiment in the Ethereum markets is currently Neutral, and the Fear & Greed index is reading Neutral. The most important support levels to watch are $ 2,260.52, $ 2,206.97 and $ 2,100.63, while $ 2,420.41, $ 2,526.75 and $ 2,580.31 are the key resistance levels.\n\nNeutral sentiment for Ethereum\n\n14 indicators are currently signaling a bullish prediction for Ethereum, while 14 indicators are showing a bearish forecast. With 50% of indicators favoring a positive prediction. This results in an overall Neutral sentiment for Ethereum.\n\nCrypto market is currently experiencing Neutral\n\nCurrently, the Fear & Greed index is at 50 (Neutral), which signals that investors have a neutral outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,483.53 (SELL) $ 2,416.91 (SELL) - - MA5 $ 2,452.01 (SELL) $ 2,380.54 (SELL) - - MA10 $ 2,463.33 (SELL) $ 2,323.92 (BUY) - - MA21 $ 2,395.77 (SELL) $ 2,232.92 (BUY) $ 2,799.51 (SELL) $ 2,033.55 (BUY) MA50 $ 2,313.67 (BUY) $ 2,074.80 (BUY) $ 2,482.72 (SELL) $ 1,900.02 (BUY) MA100 $ 2,104.79 (BUY) $ 1,945.07 (BUY) $ 1,607.35 (BUY) $ 1,876.10 (BUY) MA200 $ 1,927.88 (BUY) $ 1,854.46 (BUY) $ 1,986.60 (BUY) $ 1,657.07 (BUY)\n\nPeriod Value Action RSI (14) 53.13 NEUTRAL Stoch RSI (14) 67.40 NEUTRAL Stochastic Fast (14) 54.09 NEUTRAL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 19.16 NEUTRAL Awesome Oscillator (5, 34) 122.52 NEUTRAL Momentum (10) -158.30 NEUTRAL MACD (12, 26) -7.52 NEUTRAL Williams Percent Range (14) -45.91 NEUTRAL Ultimate Oscillator (7, 14, 28) 53.13 NEUTRAL VWMA (10) 2,520.84 SELL Hull Moving Average (9) 2,471.57 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 2,426.71 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 53.13, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Neutral. ETH would have to increase by 8.06% to hit our $ 2,506.30 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLWFkZHMtc2VsbGluZy1wcmVzc3VyZS0xLTdtLW1vdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Is the Local Top In? Ethereum Foundation Adds to ETH Selling Pressure With $1.7M Move - DailyCoin",
        "content": "The Ethereum Foundation has piled on the pressure on Ethereum’s price.\n\nThe Foundation’s move has sparked fears about forming a local ETH price top.\n\nETH has continued to dip amid a broader market correction.\n\nCrypto project teams selling tokens to fund operations are nothing new. However, it hardly ceases to spark concern. In the latest instance, a move from the Ethereum Foundation has sparked concerns about forming a local price top and beginning a price dump, particularly amid uncertain market conditions.\n\nEthereum Foundation on the Move\n\nThe Ethereum Foundation sold 700 ETH for about 1.7 million DAI in four transactions between 8:54 am UTC and 9:02 am UTC on Monday, January 22, per Etherscan data. The sum was later transferred to a “Grant Provider” address, potentially for distribution.\n\nThe Ethereum Foundation (0xd7…c1f4) sold 700 ETH on Cow Protcol between 16:54-17:05 UTC+8 at a price of $2,406 and exchanged it for 1,684,445 DAI. The DAI was then transferred to the Ethereum Foundation for funding disbursement. The address of Grant Provider: 0x9e…313D.… — Wu Blockchain (@WuBlockchain) January 22, 2024\n\nThe move has stirred concerns within the crypto community, as selling by the Ethereum Foundation has often been linked to the formation of local market tops.\n\nETH did not react sharply to the sell-off, experiencing a mild decline from $2,420.61 to $2,417.63 around the transaction time. However, this price decline has continued amid a broader market correction.\n\nETH Sheds Recent Gains\n\nAt the time of writing, ETH is trading at around $2,320, down nearly 6% in the past 24 hours as it sheds gains that had seen it surpass the $2,600 price point on speculation that the SEC was set to approve spot Ethereum ETFs in May 2024.\n\nThe recent market correction follows concerns over significant outflows from Grayscale’s Bitcoin ETF, which have placed downward pressure on the BTC price.\n\nOn Sunday, January 21, prominent analyst Ali Martinez warned that ETH risked a pullback to the $2,000 price level if it failed to hold support at $2,388.\n\nOn the Flipside\n\nEthereum’s price dip appears more linked to a broader market correction than the Ethereum Foundation’s sell-off.\n\nExperts have predicted that Ethereum will outperform Bitcoin in 2024.\n\nWhy This Matters\n\nThe move from the Ethereum Foundation potentially increases the selling pressure on ETH.\n\nRead this for more on Ethereum’s recent dump:\n\nWhales Pour XRP & ETH into CEXs, Triggering Altcoin Sell-off\n\n\n\nFind out more about the oral arguments in the SEC case against Binance:\n\nHere’s Why Tense Binance SEC Court Drama May End in a Split"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jb2luYmFzZS1wcmVtaXVtLWdhcC1kaXBzLWFmdGVyLXNwb3QtZXRmLWFwcHJvdmFsL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jb2luYmFzZS1wcmVtaXVtLWdhcC1kaXBzLWFmdGVyLXNwb3QtZXRmLWFwcHJvdmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Coinbase Premium Gap dips after spot ETF approval - AMBCrypto News",
        "content": "Since ETFs were approved, the Ethereum Coinbase Premium Gap has declined.\n\nThe coin’s price remained prone to swings despite the decrease in volatility.\n\nEthereum’s [ETH] Coinbase Premium Gap has shrunk since the launch of Bitcoin [BTC] spot exchange-traded fund (ETF) on the 10th of January, data from CryptoQuant revealed.\n\nThis metric tracks the difference between ETH’s price on Coinbase and Binance. When this indicator returns a positive value and rises, it means that the coin is trading at a premium on Coinbase.\n\nConversely, when it declines, it means that the coin trades at a much lower price on Coinbase than on Binance, mostly due to a shift in sentiment or buying pressure between US-based investors.\n\nAccording to data from CryptoQuant, ETH’s Coinbase Premium Gap was -1.53 at press time, declining by over 450% since BTC ETF went live.\n\nAn assessment of the Asian markets revealed that the coin’s Korean Premium Gap stayed positive after BTC ETFs became tradable.\n\nETH’s Korean Premium Gap measures the price gap between South Korean exchanges and other exchanges. When it climbs, it indicates the presence of strong buying pressure among Korean retail investors.\n\nAs of this writing, ETH’s Korean Premium Gap was 3.32, per data from CryptoQuant.\n\nImpending price volatility?\n\nCoinbase ranks as the second-largest cryptocurrency exchange by volume. Hence, the sustained decline in ETH’s Premium Gap on the exchange is one to take note of.\n\nThis is because a sustained discrepancy between exchange prices could increase Ethereum’s market volatility.\n\nAn assessment of the coin’s Bollinger Bands (BB) indicator on a daily chart showed a steady widening of the gap between this indicator’s upper and lower bands.\n\nWhenever this gap widens, it signals that an asset’s price deviates more from its average.\n\nHowever, at the same time, ETH’s Average True Range (ATR) and its Chaikin Volatility, which are also market volatility markers, have trended downward.\n\nAt press time, ETH’s ATR was 102.20, falling by 18% since the 12th of January. Likewise, the coin’s Chaikin Volatility has since plunged by over 150%.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nWhen these indicators trend downward, it suggests a decrease in the volatility of an asset’s price movements.\n\nTherefore, while ETH’s BB indicator hints at potential price swings, the declining ATR and Chaikin Volatility suggest that the trend has become less volatile."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1pbnZlc3RvcnMtZXllLXJlbmV3ZWQtc3VyZ2UtYW1pZC1jb29saW5nLW9mZi1waGFzZS1kYXRhL9IBXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1pbnZlc3RvcnMtZXllLXJlbmV3ZWQtc3VyZ2UtYW1pZC1jb29saW5nLW9mZi1waGFzZS1kYXRhLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Investors Eye Renewed Surge Amid Cooling-Off Phase: Data - CryptoPotato",
        "content": "Ethereum has currently found itself situated within a crucial demand zone after falling below the $2,300 threshold.\n\nWhile the risk of additional decline in the altcoin’s value, the recent dynamics in Ethereum’s futures market sentiment have been underscored by a critical analysis of funding rates, which serves as a crucial indicator, shedding light on the intensity of orders executed by buyers and sellers.\n\nAccording to CryptoQuant’s latest analysis, this displays an upward trajectory in funding rates, aligning with the surge in Ethereum’s price. This alignment signals a bullish sentiment in the market.\n\nHowever, caution is warranted as elevated funding rates can indicate an overheated state in the perpetual markets, potentially foreshadowing a looming long-squeeze event.\n\nFollowing a recent short-term correction, a notable development has emerged with a major decline in funding rates.\n\nThe on-chain intelligence platform said the decline not only signifies that the overall sentiment remains bullish but also points to a cooling-off in the perpetual markets from their previously overheated state.\n\nThis shift in sentiment sets the stage for a potential resurgence in Ethereum’s price, with the market undergoing a corrective phase.\n\nSuch a trend also suggests a moderation in aggressive trading, providing an opportunity for the market to stabilize before potentially resuming its upward trajectory.\n\n“Consequently, there exists the potential for the price to resume its upward trajectory following the completion of the ongoing correction stage.”"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2NlbHNpdXMtMzVtLWV0aGVyZXVtLXNlbGwtb2ZmLXNwYXJrcy1jb25jZXJucy1ldGgtcHJpY2UtYXQtcmlzay1vZi1kcm9wcGluZy1iZWxvdy0yay_SAXRodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9jZWxzaXVzLTM1bS1ldGhlcmV1bS1zZWxsLW9mZi1zcGFya3MtY29uY2VybnMtZXRoLXByaWNlLWF0LXJpc2stb2YtZHJvcHBpbmctYmVsb3ctMmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Celsius’ $35M Ethereum Sell-Off Sparks Concerns; Price at Risk of a Crash? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Celsius selling large amounts of Ethereum to address financial issues.\n\nDespite selling, Celsius still holds a significant Ethereum reserve\n\nAnalysts anticipate possible descent below $2,000 for Ethereum if key support levels are breached.\n\nThis week, Celsius Networks made some big moves in the Ethereum space that got people’s attention in the digital currency world, even though the company is having money problems and is in the process of filing for bankruptcy.\n\nIn the past 10 hours, Celsius Networks recorded significant deposits, including 13,000 ETH ($30 million) on Coinbase and an extra 2,200 ETH ($5 million) on FalconX. Paired with other substantial Ethereum movements, these transactions highlight Celsius’s proactive approach in addressing financial challenges.\n\nThe $35 Million Ethereum Sell-Off\n\nReports from Arkham Intelligence shed light on Celsius’s extensive Ethereum sales, totaling over $125 million from January 8 to January 12. This strategic move aligns with the platform’s commitment to liquidating assets to meet financial obligations and fulfill creditor demands.\n\nSimultaneously, Dune Analytics identified a noteworthy trend of Ethereum redemptions, surpassing $1.6 billion during the same period. This surge in redemption activity, the highest since last year’s Shanghai update, indicates a substantial shift in Ethereum market dynamics.\n\nDespite facing financial constraints from court proceedings, Celsius still maintains a significant Ethereum reserve. Two staking wallets belonging to Celsius currently hold over 557,000 ETH, valued at approximately $1.3 billion. This reserve complicates the matter further for Celcius.\n\nThe Ethereum Market Reacts\n\nIn an effort to satisfy creditors during bankruptcy proceedings, Celsius is auctioning its Ethereum holdings, leading to a 4% dip in Ethereum’s value. Analysts express concern over breaching the $2,350 threshold, a crucial point within the demand zone of $2,380 to $2,461.\n\nAnalysts anticipate a potential descent to $2,000 or lower should this level be breached.\n\nAlso Read: JP Morgan Says Spot Ethereum ETFs Approval Is Next – With 50% Chances\n\nWhales at Play\n\nSantiment’s historical data introduces the intriguing concept of “whales,” significant players capable of triggering profit-taking activities. While this often results in market dips, decreasing funding rates suggest underlying optimism. This subtle shift hints at a possible cooldown in perpetually overheated markets, offering hope for Ethereum’s resurgence once selling pressures subside."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1mb3JlY2FzdHMvd2lsbC1ldGhlcmV1bS1wcmljZS1jcmFzaC1pbi0yMDI0LW9yLXdpbGwtaXQtc2ltcGx5LXJldHJhY2Uv0gFsaHR0cHM6Ly9pbnZlc3RpbmdoYXZlbi5jb20vY3J5cHRvLWZvcmVjYXN0cy93aWxsLWV0aGVyZXVtLXByaWNlLWNyYXNoLWluLTIwMjQtb3Itd2lsbC1pdC1zaW1wbHktcmV0cmFjZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Crash 2024 Happening Now? Or Is Ethereum ‘Simply’ Retracing? - Investing Haven",
        "content": "The short answer: we are not concerned about an Ethereum price crash, for many reasons. However, the panic that is being created for Ethereum’s retracement might make you think otherwise. As always, we prefer to let the data speak, first and foremost the charts.\n\nBitcoin’s topping pattern was too obvious\n\nWe explained that is not the end of Bitcoin’s bull market, contrary to what many make you believe. Consequently, this is not the end of Ethereum’s bull market and there should be no Ethereum price crash.\n\nIt was so clear that a breakdown in Bitcoin would occur, it was too obvious.\n\nBut a pullback and a price crash are two completely different things.\n\nWe predicted, mid-December, in our premium service, and recommended members in our crypto investing research service to take profits. We called for a choppy January, that’s what we got.\n\nFrom our premium crypto alert sent on Dec 21st, 2023, ‘How To Spend Cash Realized From Free Tokens? Hint: The Mega Opportunities Of 2024!‘ (available for anyone after signing up here):\n\nShort term, it is blatantly clear that we are hitting a big resistance area. Like with any resistance area that has its roots many years back in time, the local top requires time to complete. In the end, if anything, the market would like to keep this bull market hidden. BTC has to come down a bit, it might be 34.5k or a little higher where it will find support. It might be a slow process, choppy, and that’s fine.\n\nIt’s not a crash. It is a buy opportunity.\n\nIn that same premium research alert, mentioned before, we wrote the following:\n\nMuch more important is the following: the big, huge, giant profits will be made in tokens that nobody is talking about. We see tremendous reversals. We cannot believe what we start seeing on the charts: it’s going to be huge, mark our words. But a minority will hit those multi-baggers. Why? Because the market will follow a different script, a very different script. The point is that the market never follows the same path, every cycle is different. The majority of investors will be looking for a replay of 2020/2021, we are telling you ‘it won’t happen like 2 years ago’, it will happen in a very different way.\n\nIndeed, the concept of the HIDDEN BULL MARKET is one we have covered extensively in our research service. Interestingly, we explained it even on our public blog: Crypto’s bull market 2024 is an hidden bull market.\n\nHidden bull market? What about Ethereum’s price crash?\n\nThe one and only way to neutralize these loaded topics, like the end of Bitcoin’s bull market and the so-called Ethereum price crash, is to look at the data. Charts are data. They may be read differently, but it’s data.\n\nEthereum’s price chart, shown below, shows a rising channel.\n\nA rising channel is an uptrend.\n\nAn Ethereum price crash would occur in a downtrend. The direction of the channel would point down, the color of the channel would be red.\n\nWe have the exact opposite in place now.\n\nDownside targets of Ethereum’s retracement? We see $2100.56 and $1849.01 as candidates, in that order. We think in terms of closing prices, so we cannot exclude a scenario in which Ethereum dips, intraday, to $1849 only to close that same day around $2100. This is the world of crypto, volatile are normal.\n\nMore evidence: no Ethereum price crash\n\nWe have been shouting from the roof: crypto in 2024 will come with a HIDDEN BULL MARKET. We also have been calling for a bi-furcated alt season 2024.\n\nHardly anyone is talking about this, but finally there is this one social media post that suggests there is another analyst on this planet that shares our expectations:\n\nWith the #Bitcoin ETF becoming a classic sell-the-news event, we explore the market’s risk appetite for tokens further out on the risk curve. There are some indicators alluding to #Ethereum outperformance, as well as interesting divergences in altcoin price action relative to… pic.twitter.com/r2P897hmVd — glassnode (@glassnode) January 23, 2024\n\nBuying Ethereum? Sentiment is negative, selling makes more sense.\n\nThat’s the sentiment when price is dropping, indeed.\n\nYou need a lot of courage to be contrarian. When prices are dropping, they can continue to drop. A contrarian call can be disastrous if you don’t have a decent price analysis methodology in place as an analyst.\n\nAt InvestingHaven, we are convinced there will be no Ethereum price crash in the coming months, certainly not in the coming 3 months.\n\nHow can we know?\n\nBecause there is no secular bearish turning point in our cycle analysis.\n\nAnalyzing charts, analyzing Ethereum, analyzing any other market or stock requires price analysis combined with time analysis. Both, combined, make a price analysis methodology complete.\n\nWhile we can always be wrong, we simply have not detected a secular bearish turning point that suggests a crash is underway in the short term, not in Bitcoin nor in Ethereum.\n\nYou may want to consider receiving our premium research notes because all the points we made in this article were shared a month ago in our research service. Below this article you will find a banner with a link to our premium service, why don’t you give it a try?\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvd2hhdC1jb3VsZC10aGlzLWNvcnJlY3Rpb24tbWVhbi1mb3ItZXRoZXJldW0tcHJpY2UtaW4tcTEtMjAyNC_SAV9odHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL3doYXQtY291bGQtdGhpcy1jb3JyZWN0aW9uLW1lYW4tZm9yLWV0aGVyZXVtLXByaWNlLWluLXExLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "What Could This Correction Mean For Ethereum Price In Q1 2024? - CoinGape",
        "content": "Ethereum price faces immense bottlenecks amid a sustained drop from its 2024 peak at $2,715 to slightly above $2,200. The sell-off impacting the performance of ETH over the last couple of weeks stems from the downturn that swiftly followed the approval of spot Bitcoin ETFs in the US.\n\nWhile many altcoins and even Bitcoin crumbled under the weight of post-ETF approval blues, Ethereum price stood defiant, briefly basking in the warm glow of investor optimism. But even its flame couldn’t withstand the icy grip of the relentless market malaise.\n\nadvertisement\n\nNow, the king of smart contracts teeters precariously, its crown at risk of slipping below the $2,000 mark.\n\nIs this a good time to buy Ethereum price dips?\n\nThe path of least resistance is majorly inclined downwards, reinforced by a vivid sell signal from the Moving Average Convergence Divergence (MACD) indicator.\n\nAccording to the daily chart, most traders and speculators missed a negative Relative Strength Index (RSI) divergence from ETH price possibly due to optimism around the ETF.\n\nWith the RSI neutral but falling below 40, an immediate recovery could be a pipe dream. Therefore, it could be prudent for traders to be ready to dollar-cost average (DCA) while anticipating a rebound.\n\nRecommended: Which Top Altcoin To Buy For The Bull Run Today: LINK, SHIB, LUNC?\n\nFibonacci levels reveal that the trend reversal might continue slightly below $2,000 but precisely at $1,980, as highlighted by the 0.618 retracement ratio.\n\nFor such an outcome, Ethereum price will have to flip the highly contested $2,200 level into a resistance as well as the 200 Exponential Moving Average (EMA) (purple) at $2,016.\n\nHolding above $2,200, on the other hand, could usher in another bullish era, where bulls push for an upswing beyond the January peak of $2,715 and aim for highs above $3,000.\n\nSeveral crypto analysts like @Gotzeuus agree with the short-term bearish outlook, suggesting that Ethereum price will dive to sweep the $2,067 low. If this level holds, a rebound could ensue.\n\nThe analyst warned on X that Ethereum and altcoins could take a beating from Bitcoin price action, implying that this might not be the time to “overexpose” the crypto portfolio to altcoins.\n\n$ETH update There is high change we go to take 2067 low if we don't hold here, so patience ETH/BTC also looking ready for a pullback after 0.061 bearish retest, therefore expect ETH and alts to suffer from BTC price action Not the days to overexpose yourself in conclusion https://t.co/5Cjqz0DGis pic.twitter.com/mSiLtzrwYD — Gotzeuus (@Gotzeuus) January 23, 2024\n\nFor now, the best advice could be to exercise patience and avoid rushed decisions. Letting the doldrums settle will provide a clear trajectory Ethereum will likely follow.\n\nRelated Articles"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ0Yy1kaXBzLWJlbG93LTQwMDAwLWFuZC1ldGgtc3RydWdnbGVzLXRvLWhvbGQtMjIwMC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as BTC Dips Below $40,000 and ETH Struggles to Hold $2,200 - Cryptonews",
        "content": "Bitcoin and Ethereum Price Prediction as BTC Dips Below $40,000 and ETH Struggles to Hold $2,200\n\n\n\nBitcoin, the foremost digital currency, witnessed a notable dip below the critical $40,000 mark, briefly falling to around $39,500. This decline has been linked to substantial Bitcoin sales, notably influenced by the Grayscale GBTC Bitcoin ETF, fueling concerns about a possible further descent to the $38,000 level.\n\nBitcoin has fallen about 20% since the Jan. 11 launch of the first ETFs funds investing directly in the token https://t.co/3jGyNKrvfT — Bloomberg Markets (@markets) January 23, 2024\n\nConcurrently, Ethereum, another major player in the crypto arena, is grappling with its own bearish momentum, having fallen to $2,347, marking a significant 24-hour drop of nearly 3%.\n\nThese movements come amidst a broader market context where Bitcoin has seen over a 20% decline since the launch of the first exchange-traded funds (ETFs) by major firms like BlackRock and Fidelity.\n\n#BTC looks ready for bounce imo👀 I’m expecting bounce from here cause most important liquidity levels got hit last night 💯 In most worst case we can see $37K-$38K, hope this will not happen.. Then pump imminent for me 👊 Just sharing my own thoughts with you guys.. it’s… pic.twitter.com/lkkQ6ell9L — ᴡʜᴀʟᴇ ᴏғ ᴄɪᴛʏ 🐳 (@Whale_Of_City) January 23, 2024\n\nThis decline, from a high of $49,021 on the ETFs’ debut to a current standing of $38,975, reflects a complex interplay of factors including market sentiment, institutional actions, and broader macroeconomic conditions.\n\nBitcoin’s Price Decline: Miner Stress and Institutional Dynamics\n\n\n\nBitcoin (BTC) recently experienced a notable downturn, slipping below the $40,000 support and sparking market concerns. This correction not only rattled holders but also posed challenges for BTC miners.\n\nOver the past 24 hours, miners faced financial struggles with transaction fees hitting their lowest since June 2022. The pressure on miners may lead to selling, adding downward momentum to Bitcoin’s price.\n\nBitcoin's average transaction fee hits $6.85, surging 35.5% from yesterday & a massive 448% YOY. Miners face a challenge as fees climb. #BitcoinFee #CryptoMining #MarketTrends pic.twitter.com/TVGRA4z5qg — Arslan Ali (@forex_arslan) January 23, 2024\n\nIn the brighter side, institutional players are strategically accumulating BTC, reflecting confidence in its long-term value. However, this could impact short-term market dynamics and potentially concentrate BTC ownership.\n\nChanges in address numbers and the long/short ratio hint at evolving market sentiment, while increased network activity offers stability.\n\nConsequently, this news of Bitcoin’s dip below $40,000 pressures miners with low transaction fees, potentially deepening the price decline amid institutional accumulation.\n\nGoogle Bard’s Forecast: Bitcoin’s Potential Slide to $35,000 in Current Market\n\n\n\nInsights from Google’s AI, Google Bard, suggest Bitcoin could further decline to $35,000, influenced by inflation, interest rates, and regulatory factors.\n\nHowever, potential uplifts from block reward halving, rising demand, institutional adoption, and positive developments may facilitate recovery.\n\n#Bitcoin: Google Bard forecasts a critical juncture for Bitcoin: Regulatory headwinds and macro pressures could push prices below $38K, while the April halving and institutional adoption may reignite the climb. #BitcoinPrediction #GoogleBardForecast #CryptoEconomy #BitcoinHalving pic.twitter.com/33WpZ4VDJk — Arslan Ali (@forex_arslan) January 23, 2024\n\nWith Bitcoin’s current position just under $39,000, Google Bard indicates a possible stagnation with prices oscillating between $35,000 and $45,000 as market forces collide.\n\nAmidst these fluctuations, investors are advised to proceed with caution.\n\nBitcoin Price Prediction"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9jb2luYmFzZS1iZWdpbnMtdGVjaG5pY2FsLWFzc2Vzc21lbnQtdG8tb25ib2FyZC1uZXctZXRoZXJldW0tZXhlY3V0aW9uLWNsaWVudC1mb3ItZGl2ZXJzaXR5Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Coinbase Begins Technical Assessment to Onboard New Ethereum Execution Client for Diversity - Cryptonews",
        "content": "Coinbase Begins Technical Assessment to Onboard New Ethereum Execution Client for Diversity\n\nDigital asset exchange Coinbase has revealed its effort toward Ethereum execution client diversity after users complained about the platform’s overreliance on Go.Ethereum (Geth).\n\nIn a Jan 23 X (formerly Twitter) post, Coinbase quelled community concerns about the dominance of Geth as the only execution layer on the platform noting that plans were in motion for more giving reasons for the status quo.\n\n1/ Execution client diversity on Ethereum is a critical concern for all of us at Coinbase. Here’s what we’re doing about it. ↓ — Coinbase Cloud 🛡️📞 (@CoinbaseCloud) January 23, 2024\n\nAccording to the post, diversity concerns on the exchange are a serious problem for both users and the team. Consequently, Coinbase has taken steps to move away from complete dependence on Go.ethereum.\n\nIt was revealed that launching the staking feature on the platform Geth was the only execution client that met the requirements of the exchange.\n\n“Coinbase Cloud prioritizes the security of customer assets, and the underlying blockchain, above all else. When launching Ethereum staking and evaluating execution layer clients to maximize these traits, Geth was the only client that met our technical requirements.”\n\nIn 2022, two years before the staking feature was rolled out, Coinbase Cloud and other network operators came to the exact conclusion that has led to the dominance of Geth.\n\nPresently 84% of Ethereum validators operate on Geth but alternative solutions are being developed and scaled up with the possibility of network integration in the future.\n\nThe exchange added that it has a record of taking client diversity seriously to improve users’ overall experience. Coinbase also added that it would perform the latest assessments and conclusions towards the next step in this direction, which will be revealed in February.\n\nCoinbase user flags Geth dominance\n\n\n\nThis recent controversy was sparked with a post on X when a user complained of the risk Geth’s dominance poses to the system. The user specifically stressed that he could lose his assets in the event of a bug.\n\n“and in the event of an unforeseen geth consensus bug in the meantime, I could stand to lose a large percentage of my deposit. today, I’ve decided that this is not worth the risk.”\n\ndear @coinbase today, i unstaked all of the ETH i had staked with you since the first day you offered it as a service. i kept it there to earn passive yield, but also to support your work for the crypto industry (which i greatly value) but i can't ignore the risks of what… — DCinvestor (@iamDCinvestor) January 22, 2024\n\nBrain Armstrong, the CEO of Coinbase noted that he would take a look into the incident spurring the comprehensive response.\n\nAddressing previous concerns\n\n\n\nIn February 2022, the exchange addressed similar concerns of client diversity of eth2 regarding validators’ dependence on Prysm. Coinbase noted that securing user assets was paramount to the network and decided to start with Prysm because it was the viable option.\n\n“Remote signers allow validators to generate and store keys in isolated environments instead of keeping them on the validator itself, which greatly increases the security of the eth2 validators on Coinbase.”\n\nA conclusion was drawn to secure onboard Lighthouse remote signers giving users and partners more options."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8yMTM5NTgvZWR3YXJkLXNub3dkZW4tdG9ybmFkby1jYXNoLWV0aGVyZXVtLWZvdW5kZXItbGVnYWwtZnVuZC1kYW_SAVtodHRwczovL2RlY3J5cHQuY28vMjEzOTU4L2Vkd2FyZC1zbm93ZGVuLXRvcm5hZG8tY2FzaC1ldGhlcmV1bS1mb3VuZGVyLWxlZ2FsLWZ1bmQtZGFvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Edward Snowden Urges Support for Jailed Founder of Ethereum Mixer Tornado Cash - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhistleblower turned international fugitive Edward Snowden today backed and endorsed the legal defense fund for the Tornado Cash founder.\n\nIn a Tuesday post on Twitter, the exiled former CIA contractor asked followers to pitch in to help Roman Storm, co-founder of the once popular but fatally sanctioned cryptocurrency mixing service.\n\nYesterday, Storm said on Twitter that he would launch a campaign—in the form of a decentralized autonomous organization (DAO)—to raise money for a lawyer. Last year, the U.S. Department of Justice arrested Storm and charged him with money laundering for his part in the creation of Tornado Cash.\n\nAD\n\nAD\n\nTornado Cash was a popular cryptocurrency coin mixing application that allowed users to anonymously send and receive Ethereum, the second largest digital asset by market cap.\n\nBut the Department of the Treasury’s Office of Foreign Assets Control (OFAC) in 2022 banned Americans from using the service, claiming that criminals had used it to launder dirty money.\n\nThey then alleged that Storm and his colleague Roman Semenov laundered more than $1 billion in criminal proceeds. Developer Alex Pertsev was also arrested.\n\nBut the new fundraiser’s website argues that “the arrests of Roman Storm and Alex Pertsev are considered a direct attack on the open-source development space and may have devastating consequences for developers who write and publish code.”\n\nIf you can help, please help. Privacy is not a crime. https://t.co/R4vauNLRB4 — Edward Snowden (@Snowden) January 23, 2024\n\nAD\n\nAD\n\n“If you can help, please help,” Snowden said in a retweet of Storm’s plea. “Privacy is not a crime.”\n\nSnowden, who has been living in exile in Russia since being charged by the U.S. government with espionage in 2013, has long been a privacy and cryptocurrency advocate.\n\nHe said last year that the sanctioning of Tornado Cash was “deeply illiberal and profoundly authoritarian.”\n\nSnowden also helped create the privacy coin Zcash and has spoken about how people should use cryptocurrencies rather than buy them as an investment.\n\nSnowden has also pointed out Bitcoin’s privacy problem. The biggest cryptocurrency by market cap is pseudonymous: a user’s identity isn’t recorded on the blockchain but every single transaction is.\n\nAuthorities are, therefore, able to track down people who send and receive the digital coin if necessary.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdG9rZW5wb3N0LmNvbS9FdGhlcmV1bS1EZW5jdW4tVXBncmFkZS10by1BZmZlY3QtRVRILVByaWNlLUFuYWx5c3RzLVNheS0xMTEyOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade to Affect ETH Price, Analysts Say - TOKENPOST",
        "content": "Ethereum Dencun Upgrade to Affect ETH Price, Analysts Say\n\nThe upcoming Dencun upgrade of the Ethereum network might have repercussions on the supply of ether, as noted by Luke Nolan, a research associate specializing in Ethereum at CoinShares.\n\nLuke Nolan, a research associate specializing in Ethereum at CoinShares, warns that the upcoming Dencun upgrade of the Ethereum network may influence the supply of Ether.\n\nThe Dencun upgrade introduces the blobspace, an alternative to the current transactional calldata mechanism, facilitating Layer 2 transactions on the Ethereum network. This change can reduce gas usage, decreasing the amount of Ether burned during transactions.\n\nCurrently, all Esther used for gas base fees in transactions is burned. Nolan explained, \"Layer 2s pay 90% of their gas fees for transactional calldata. With the Dencun upgrade, instead of using calldata, Layer 2s can opt for the new blobspace mechanism, significantly reducing gas costs. This shift could stabilize gas prices at lower levels, resulting in less Ether being burned.\"\n\nImpact on Ether Burn Mechanism\n\nThe anticipated reduction in Ether burned may impact the overall growth of Ether supply. Gas demand on the Ethereum network is a crucial driver of Ether's deflation mechanism through gas burn, potentially reducing the circulating supply of Ether. Nolan emphasized that even with reduced gas prices due to blobspace usage, Ethereum is unlikely to become significantly inflationary.\n\n\"Layer 1 demand is crucial for driving deflation. The Dencun upgrade aims to decrease gas fees for roll-up transactions, attracting users back to the network with lower fees. Increased activity means higher overall gas usage,\" Nolan explained.\n\nAccording to The Block, despite potential changes to the Ether burn mechanism, Nolan highlighted that secondary effects of the Dencun upgrade are likely to be a net positive in the long run. He underscored that Ethereum's goal is to solidify its market share, and any short-term gas fluctuations are overshadowed by the broader objective of enhancing user experience and network activity.\n\nDencun Upgrade Schedule\n\nThe Dencun network upgrade was initiated on the Goerli testnet on Jan. 17, introducing Ethereum Improvement Proposals, including EIP-4844 for the blobspace mechanism. The Sepolia testnet is set to activate the Dencun upgrade by Jan. 30, with the Holesky testnet following on Feb. 7.\n\nAccording to Coin Gape, Nolan indicated that mainnet activation of the Dencun upgrade could occur as early as March this year. However, he cautioned that unforeseen testnet issues could impact the timeline. Ethereum core developers anticipate the mainnet activation to happen at least one month after Holesky, but exact timing remains uncertain due to potential testnet challenges.\n\nPhoto by: Blank/Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZnV0dXJlcy1zZXRzLXN0YWdlLWV0aC1yYWxseS1hbmFseXN0L9IBWGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZnV0dXJlcy1zZXRzLXN0YWdlLWV0aC1yYWxseS1hbmFseXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Futures Market Cool Off Sets Stage For ETH To Rally: Quant - NewsBTC",
        "content": "An analyst has explained that the latest cooldown in the Ethereum futures market could suggest there is potential for a price rise to resume for ETH.\n\nEthereum Funding Rates Have Seen A Decline Recently\n\nAn analyst in a CryptoQuant Quicktake post explained that the ETH funding rates have seen a cooldown from their previously overheated levels. The “funding rate” refers to the periodic fees that futures contract holders on derivative platforms currently exchange with each other.\n\nWhen the value of this metric is positive, it means that the long contract holders are paying a premium to the shorts to hold onto their positions. Such a trend implies that most traders share a bullish sentiment right now.\n\nOn the other hand, the under zero indicates that a bearish sentiment is currently dominant in the futures market, as the short traders are overwhelming the longs.\n\nNow, here is a chart that shows the trend in the Ethereum funding rates over the last few months:\n\nThe value of the metric seems to have been low in recent days | Source: CryptoQuant\n\nAs displayed in the above graph, the Ethereum funding rates have been mostly positive during the last few months, implying that traders on the futures side of the market have mostly been bullish about the asset.\n\nThe few times that the metric did dip into the negative inside this period didn’t turn out to be anything major, as the indicator only attained low red values and rebounded back inside the green territory without too much wait.\n\nThe chart shows that during some phases of this lasting period of bullish sentiment, the metric attained particularly high values. “However, it’s crucial to note that elevated values in funding rates raise concerns about a potential overheated state in the perpetual markets, signaling the possibility of an impending long-squeeze event,” notes the quant.\n\nA “squeeze” is an event in which a sharp swing in the price triggers a large number of liquidations, which in turn feed into this price move, elongating it and causing further liquidations.\n\nWhen such a cascade of liquidations affects the long side of the market (that is, the price move in question is a rapid drawdown), the event is known as a “long squeeze.”\n\nGenerally, the side of the futures market most heavily dominated by traders is likelier to fall prey to a squeeze. Thus, when the funding rates are highly positive, a long squeeze can be more probable.\n\nRecently, though, as Ethereum has gone through its latest correction, so have the funding rates. Although they are still positive, their magnitude may no longer be associated with an overheated market, and the risk of a long squeeze would have thus fallen.\n\n“Consequently, there exists the potential for the price to resume its upward trajectory following the completion of the ongoing correction stage,” explains the analyst.\n\nETH Price\n\nEthereum has declined by around 5% during the past week as its price has now fallen under $2,400.\n\nLooks like the price of the coin has been sliding off recently | Source: ETHUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvY2Vsc2l1cy1kdW1wLXRyaWdnZXJzLWV0aGVyZXVtLWRpdmUtMzUtbWlsbGlvbi1zZWxsLW9mZi1zZW5kcy1ldGgtcHJpY2UtY3Jhc2hpbmcv0gFyaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9jZWxzaXVzLWR1bXAtdHJpZ2dlcnMtZXRoZXJldW0tZGl2ZS0zNS1taWxsaW9uLXNlbGwtb2ZmLXNlbmRzLWV0aC1wcmljZS1jcmFzaGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing - NewsBTC",
        "content": "Celsius Networks, currently undergoing bankruptcy proceedings, has engaged in significant Ethereum transactions that are causing ripples within the digital currency landscape.\n\nIn the past 10 hours, on-chain analysts at LookonChain detected noteworthy transfers, including a 13,000 ETH deposit ($30 million) on Coinbase and an additional 2,200 ETH ($5 million) on FalconX. These transactions suggest a proactive stance by Celsius in addressing its ongoing financial challenges.\n\nCelsius Sells $125M ETH, Maintains $1.3B Reserve\n\nAccording to Arkham Intelligence, Celsius sold more than $125 million worth of Ethereum (ETH) coins between January 8 and January 12. The primary goal of this auction is to pay off creditors.\n\nDune Analytics also revealed a more widespread pattern of redemptions, with over $1.6 billion of staked Ethereum being redeemed during the same period. Since the Shanghai update last year, the amount of redemptions recorded is the highest.\n\nDespite facing financial constraints imposed by the court, Celsius still holds a substantial Ethereum reserve. This reserve amounts to over 557,000 coins in two staking wallets, with a total valuation of approximately $1.3 billion. The size of this reserve adds a layer of complexity to Celsius’ current financial situation and underscores the evolving narrative within the crypto space.\n\nSource: LookOnChain\n\nAs part of its obligations to creditors, Celsius has been actively liquidating its Ethereum holdings. These auctions, aimed at paying off outstanding debts, are integral to Celsius’ bankruptcy proceedings.\n\nSource: LookOnChain\n\nThe market has responded to these Ethereum transactions, resulting in a 4% decline in the price of ETH. The cryptocurrency slipped below the $2,350 mark, raising concerns among analysts, especially as ETH now wavers below its crucial demand zone ranging from $2,380 to $2,461.\n\nAnalysts predict that a failure to maintain this level could lead to a potential retreat towards the $2,000 mark.\n\nEthereum currently trading at $2,307.2 on the daily chart: TradingView.com\n\nWealthy Investors Trigger Ethereum Profit-Taking\n\nSantiment’s historical data reveals that significant transactions by wealthy investors, commonly known as whales, often trigger profit-taking activities among regular ETH holders. This phenomenon intensifies selling pressure and contributes to price declines.\n\nMeanwhile, decreasing funding rates suggest an underlying optimism in the market, hinting at a possible cooldown in previously overheated perpetual markets. This situation leaves room for ETH to rebound once the selling pressure subsides.\n\nAs the bankruptcy drama of Celsius unfolds, the scrutiny on its Ethereum transactions and the resulting market dynamics will persist. Investors and observers are closely monitoring the situation, eagerly awaiting further developments and anticipating the broader implications for both Celsius and the crypto ecosystem.\n\nFeatured image from Shutterstock\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    }
]