[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aGF0LWlzLWV0aGVyZXVtLXJlc3Rha2luZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "What Is Ethereum Restaking? A Beginner's Guide - Unchained - Unchained",
        "content": "Ethereum restaking, as proposed by the Ethereum-based middleware protocol EigenLayer, involves reusing staked ETH tokens to secure other protocols. Proponents of restaking believe it can be used to amplify trust across networks, while detractors are worried about its possible ramifications.\n\nRead on to learn what Ethereum restaking is, how it works, and the pros and cons of restaking ETH tokens.\n\nWhat Is Ethereum Restaking?\n\nBefore we can delve into restaking, we need to understand staking digital assets in PoS networks.\n\nStaking refers to network participants locking up a certain amount of cryptocurrency on-chain to secure the network in exchange for staking rewards.\n\nOn Ethereum, it means locking up 32 ETH into a validator, which acts as an economic incentive for validators to act honestly when verifying transactions. In this process, a validator commits to producing Ethereum blocks and maintains the integrity of the Ethereum network. The economic incentive for validators is earning ETH rewards.\n\nHowever, if they attempt to manipulate the network or act dishonestly, they are penalized and stand to lose their staked ETH in an act called slashing.\n\nEthereum restaking refers to simultaneously using your staked ETH to secure other protocols and earn rewards. In other words, you are depositing your already staked ether tokens in another protocol to extend the same trust generated by Ethereum’s validators to the new protocol.\n\nDuring this process, your ETH will remain staked on Ethereum, and validators will continue confirming transactions, but your staking power will now expand to other protocols. Restakers will earn additional rewards for their ETH stake but will be penalized or “slashed” for failing to perform their staking duties.\n\nHow Does Ethereum Restaking Work?\n\nEigenLayer\n\ndeploys smart contracts on Ethereum so ETH stakers can restake their assets on external protocols. EigenLayer acts as the conduit through which you can restake your staked ETH tokens, as well as a decentralized trust marketplace for stakers looking to compound their yields.\n\nEigenLayer provides two ways to restake: native restaking or LSD restaking.\n\nNative restaking allows you to restake your ETH stake directly to EigenLayer by assigning your validator’s withdrawal credentials to EigenLayer’s smart contracts (EigenPod).\n\nLSD restaking is you restaking your liquid-staked tokens. You can stake ETH on liquid-staking platforms such as Lido and Rocket Pool. Liquid staking is less complicated and has a lower barrier of entry than running your Ethereum validator. You can then restake your liquid-staked tokens.\n\nEigenLayer\n\nallows you to stake Lido ETH (stETH), Rocket Pool ETH (rETH), Coinbase Staked Ether (cbETH), and more liquid staked assets.\n\nHow to Restake Ethereum\n\nNow, let’s take a look at how you can restake your ETH.\n\nSet up a Web3 wallet: Get a Web3 wallet to allow you to interact with DeFi protocols and dApps. If you have already staked ETH on liquid staking platforms, you can deposit it directly into the wallet. Connect your wallet to the EigenLayer App: Navigate to app.eigenlayer.xyz and connect your wallet to the protocol. The page will display the assets supported on EigenLayer and the TVL of each locked in the smart contracts. Select a restaking option: Choose the method of restaking that works for you. If you are a validator running your node, then native restaking is optimum. Alternatively, you can select your preferred liquid staking token and input the desired amount. Confirm your transaction: Confirm your deposit on EigenLayer and in-wallet to ensure the transaction is complete.\n\nBenefits and Drawbacks of Restaking Ethereum\n\nHere, we explore several benefits and drawbacks of restaking Ethereum for validators, protocols, and developers.\n\nPros\n\nAdditional rewards: The most obvious advantage of Ethereum restaking for a validator is the ability to compound staking rewards by staking ETH on other protocols.\n\nReducing the start-up cost of new protocols: By restaking Ethereum’s pool of assets, new protocols can benefit economically from Ethereum’s security offerings without starting their validation services.\n\nProtocols can retain sovereignty: By building on EigenLayer, protocols will have the flexibility to customize their architecture without adhering to the rigid rules imposed on Ethereum Layer 2 chains.\n\nCons\n\nSlashing: When you stake ETH, you are exposed to slashing as an economic consequence of bad behavior. Staking amplifies the risk, and you could lose staked ETH if you engage in malicious activity on a secondary protocol.\n\nRisk to Ethereum performance: Restaking opponents fear that with Ethereum’s computational power being redirected to secondary networks, there could be a computational overload on Ethereum’s consensus.\n\nCentralization risks: Restaking protocols like EigenLayer may attract ETH stakers with the promise of high yields, resulting in the rise of centralized networks and a decline in individual ETH stakers.\n\n\n\n\n\n\n\n\n\nFinal Thoughts\n\nWhile still in its early stages, Ethereum restaking is an interesting approach to network security and validation and how users can actively contribute to both.\n\nEthereum restaking may set the precedent on how blockchain protocols incorporate the power of collective participation and pooled economic incentives to shape the future of decentralized finance."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVyeS0yMzAwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVyeS0yMzAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Recovery Faces Major Barrier, Can Bulls Overcome Bears? - NewsBTC",
        "content": "Ethereum price is attempting a recovery wave above the $2,240 zone. ETH could gain bullish momentum if it clears the $2,300 resistance zone.\n\nEthereum started an upside correction above the $2,200 zone.\n\nThe price is trading above $2,240 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $2,265 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair might start a steady increase if it clears the $2,300 resistance zone.\n\nEthereum Price Regains Strength\n\nEthereum price formed a base and started a recovery wave above the $2,220 resistance zone. ETH cleared the $2,240 resistance zone like Bitcoin to move into a short-term bullish zone.\n\nHowever, the bears were active near the $2,300 zone. A high was formed at $2,307 before there was a pullback. The price declined below the $2,280 level. It broke the 23.6% Fib retracement level of the recovery wave from the $2,170 swing low to the $2,307 low.\n\nThe bulls are now active above the $2,240 support and the 50% Fib retracement level of the recovery wave from the $2,170 swing low to the $2,307 low. Recently, there was a break above a connecting bearish trend line with resistance near $2,265 on the hourly chart of ETH/USD.\n\nEthereum is now trading above $2,240 and the 100-hourly Simple Moving Average. On the upside, the first major resistance is near the $2,280 level. The next major resistance is near $2,300, above which the price might rise and test the $2,350 resistance.\n\nSource: ETHUSD on TradingView.com\n\nIf the bulls push the price above the $2,350 resistance, they could aim for $2,420. A clear move above the $2,420 level might start a decent increase. In the stated case, the price could rise toward the $2,550 level.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,300 resistance, it could start another decline. Initial support on the downside is near the $2,240 level.\n\nThe next key support could be the $2,220 zone. A daily close below the $2,220 support might start another major decline. In the stated case, Ether could test the $2,170 support. Any more losses might send the price toward the $2,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,220\n\nMajor Resistance Level – $2,300\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9zZWktYmV0cy1vbi1ldm0tcGFyYWxsZWxpc2F0aW9uLXRvLWx1cmUtZXRoZXJldW0tZGV2ZWxvcGVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Sei bets on 'EVM parallelisation' to lure Ethereum developers — but it's not alone - DLNews",
        "content": "Sei Labs is rolling out an upgrade that it hopes will attract Ethereum developers.\n\nHowever, it is not the only layer 1 competing in the crowded market.\n\nSei Labs, the company behind the layer 1 blockchain Sei, is betting on its Sei v2 upgrade to attract developers and remove barriers for those looking to deploy DeFi protocols on its blockchain.\n\nIt will allow developers to deploy protocols from Ethereum — the biggest blockchain ecosystem with over $57 billion worth of DeFi deposits — on Sei without having to reconfigure their code.\n\n“Going to a new execution environment is very risky,” Sei co-founder Jay Jog told DL News. “If you don’t completely understand it, and you create even one small, tiny bug, that could result in your entire smart contract getting completely drained.”\n\nInvestor deposits ($) in Sei, as measured by total value locked on DefiLlama\n\nSei v2 is scheduled to go live in the first half of 2024 and will remove that risk for developers, Jog said.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nSei Labs is betting that Ethereum developers will opt to build on faster blockchains like Sei as the industry is growing more focused on interoperability, referring to the push to connect disparate blockchain ecosystems.\n\nTapping into Ethereum\n\nEthereum is currently where the vast majority of blockchain development takes place. A recent report from Electric Capital found that 71% of smart contract code was initially deployed on Ethereum.\n\nAlthough Ethereum is the birthplace for the majority of blockchain code, developers also frequently opt to deploy their projects on alternative blockchains that boast higher speeds and reduced transaction fees.\n\nBlockchains like Solana or Cardano have had a hard time attracting Ethereum developers because they use software that is incompatible with Ethereum’s. Solana uses its own custom-made solution, while Cardano uses a UTXO model.\n\nJoin the community to get our latest stories and updates\n\nThis has created an opportunity for Sei and similar projects looking to court Ethereum devs.\n\nNeon EVM, an Ethereum-compatible layer 2 blockchain built on top of Solana, and Monad, a yet-to-be-launched blockchain, also offer Ethereum developers routes to deploy their code on a more performant blockchain without having to make alterations to it.\n\n‘The EVM is here to stay’\n\nCurrently, blockchains fall into one of two broad categories: those that are compatible with the Ethereum Virtual Machine — or EVM for short — and those that are not.\n\nEVM-compatible blockchains make it easy for Ethereum developers to build on them, but many of those chains are prone to transaction congestion and high fees.\n\nWhile some EVM-compatible blockchains find a way around this using technologies like zero-knowledge proofs, such blockchains are still relatively new.\n\nOn the other hand, blockchains that use different software, like Sei and Solana, can achieve much higher transaction speeds.\n\nSei’s answer to this situation is to upgrade its current architecture to make it fully compatible with Ethereum — a request that’s at the top of developers’ wishlist, Jog said.\n\n“The EVM is here to stay,” Jog said. “It’s not necessarily the cleanest and most elegant execution environment to be using, but it is the one that has already gotten most market share.”\n\nSei currently requires developers to write their protocols using programming languages like Rust or C++. But after the Sei v2 upgrade, they will be able to use languages like Solidity and Vyper that are popular with Ethereum developers.\n\nEVM parallelisation\n\nSei already achieves high transaction speeds compared to other blockchains. To maintain these high speeds while also letting developers use the EVM, Sei is implementing a technique called EVM Parallelisation.\n\nThis allows Sei to run multiple execution environments that can simultaneously process transactions instead of having to process transactions one after the other, as most blockchains do.\n\nSei is not the only blockchain leveraging EVM Parallelisation.\n\nNeon EVM also uses EVM Parallelisation to let Ethereum developers tap into Solana.\n\nInvestors deposits ($) in Neon, as measured by total value locked on DefiLlama\n\nBut unlike Sei v2, where both EVM and non-EVM protocols will live on the same blockchain, Neon EVM is its own separate blockchain.\n\nThat means users must first bridge their assets to Neon EVM, introducing a point of friction, which hasn’t prevented Neon from making inroads with Ethereum developers.\n\nStiff competition\n\nAave, the biggest lending protocol on Ethereum with over $7 billion worth of investor deposits, recently polled its token holders on whether it should deploy its v3 version to Neon EVM. The vote ended with over 83% of token holders signalling support.\n\nMonad, a soon-to-be-launched blockchain, is also promising developers EVM compatibility and fast transactions.\n\nBoasting a proprietary consensus algorithm, Monad claims it will achieve processing capabilities of up to 10,000 transactions per second upon its launch later this year.\n\nAlthough Neon EVM has a head start, the competition between these three EVM Parallelisation projects is only just beginning.\n\nSEI token price ($)\n\nSuccess isn’t guaranteed.\n\n“It’s not ‘if you build it, they will come,’” Jog said. “Because there’s been dozens of other chains where no one has gone.”\n\nIn addition to Sei Labs’ focus on parallelisation, the Sei Foundation, an affiliated nonprofit that supports the Sei ecosystem, plans to launch a grants programme for those looking to develop on the Sei blockchain."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vdS50b2RheS94cnAtYml0Y29pbi1hbmQtZXRoZXJldW0tZXllLXVudXN1YWwtdHJhbnNmZXItYWN0aXZpdHktd29ydGgtbWlsbGlvbnPSAVlodHRwczovL3UudG9kYXkveHJwLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWV5ZS11bnVzdWFsLXRyYW5zZmVyLWFjdGl2aXR5LXdvcnRoLW1pbGxpb25zP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "XRP, Bitcoin and Ethereum Eye Unusual Transfer Activity Worth Millions - U.Today",
        "content": "In a day marked by substantial cryptocurrency movements, Bitcoin (BTC), Ethereum (ETH) and XRP have emerged as focal points, engaging the crypto community with transactions of significant financial magnitude.\n\nAdvertisement\n\nCommencing the day's activity was a substantial Ethereum transfer, wherein 14,768 ETH, valued at $33.5 million, traversed from an undisclosed wallet to the esteemed Coinbase platform. This sizable transaction set the stage for a cascade of noteworthy movements within the cryptocurrency landscape.\n\nFollowing suit, 27.7 million XRP, equivalent to $14.48 million, flowed seamlessly to the Bitstamp exchange. Strong indications suggest this transfer is intricately linked to initiatives aimed at fortifying liquidity for the Ripple Payments service, for which Bitstamp serves as a pivotal provider.\n\n🚨 🚨 🚨 🚨 🚨 🚨 3,249 #BTC (137,277,045 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/E3LSUGZTed — Whale Alert (@whale_alert) January 29, 2024\n\nThe zenith of today's crypto transfers unfolded in recent hours, characterized by a momentous transfer of 3,249 BTC, valued at an impressive $137.3 million. This substantial movement transpired from an unidentified wallet to a Coinbase Institutional account, highlighting the evolving dynamics of institutional engagement within the cryptocurrency market.\n\nConcurrently, Coinbase Institutional's vault witnessed a noteworthy outflow of 1,426 BTC, valued at $60.49 million, directed toward another undisclosed wallet.\n\nAs the cryptocurrency market continues to experience dynamic shifts in wealth distribution and heightened institutional participation, the unprecedented transfer activities involving Bitcoin, Ethereum and XRP today beckon a nuanced exploration of the evolving digital asset landscape."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0ODUzL3Nwb3QtZXRoZXJldW0tZXRmLWFwcHJvdmFsLTIwMjUtMjAyNi10ZC1jb3dlbtIBVWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDg1My9zcG90LWV0aGVyZXVtLWV0Zi1hcHByb3ZhbC0yMDI1LTIwMjYtdGQtY293ZW4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETF approval 'unlikely until late 2025 or early 2026,' says TD Cowen - The Block",
        "content": "Investment bank TD Cowen has provided a clearer timeline for when it thinks a spot Ethereum ETH +0.88% exchange-traded fund will be approved in the United States — late 2025 or early 2026. Earlier this month, the bank said the approval could come after the November 2024 election.\n\n\"We do not expect the SEC in 2024 to approve a spot Ethereum ETF,\" TD Cowen Washington Research Group, led by Jaret Seiberg, wrote in a note on Monday. \"This is a political call. We believe there is no upside for SEC Chair Gary Gensler to approve a spot Ethereum ETF given how upset progressive Democrats were over the agency's approval of a spot bitcoin ETF earlier this month.\"\n\nGensler needs the support of progressives to push forward his agenda in this election year, according to TD Cowen. Also, if Gensler pursues a different role, such as Treasury secretary, in the event of President Joe Biden winning a second term, he will still need the backing of progressives, the bank said.\n\nSo, \"there is no reason to provoke a needless fight,\" TD Cowen said. \"We say needless, as our view remains that Gensler is in no hurry to approve an Ethereum ETF as he would first like more experience with the performance of the recently approved spot Bitcoin ETFs. This is consistent with his broader approach to crypto, which is to move incrementally and slowly when it comes to providing regulatory approvals or clarity.\"\n\nSpot Ethereum ETF applications\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nMore than half a dozen companies, including BlackRock and Fidelity, have applied for a spot Ethereum ETF. Last week, the SEC again postponed its decision on Grayscale Investments' proposal for a spot Ethereum ETF, following delays on other applications earlier this month.\n\nThe SEC can take its time reviewing spot Ethereum ETF applications, according to TD Cowen. \"It can eventually reject the rule change, which either will lead to a new application or litigation. Either will take another year or two to play out,\" the bank said.\n\nThe expected late 2025 or early 2026 approval deadline is possible even if Congress fails to enact broader crypto market structure legislation in 2025, TD Cowen said. Gensler's term ends in June 2026.\n\nCrypto experts have been both optimistic and pessimistic that a spot ether ETF approval is on the horizon. Some think such an approval could come as early as May — the initial deadline for approving such funds."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtZGVsYXlzLWdyYXlzY2FsZS1ibGFja3JvY2stc3BvdC1ldGhlcmV1bS1ldGZzLWxhdy1kZWNvZGVkLWphbi0yMi0yOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "SEC delays decision on Grayscale, BlackRock spot Ethereum ETFs: Law Decoded - Cointelegraph",
        "content": "On Jan. 24, the United States Securities and Exchange Commission (SEC) pushed back its decision on BlackRock’s proposed spot Ethereum exchange-traded fund application (ETF) a day before the deadline, citing the need for more time to review the proposed rule change. While the SEC must make a final decision on BlackRock’s spot Ether (ETH) ETF decision by Aug. 7, Bloomberg ETF analyst Eric Balchunas has predicted a final decision will be made on all pending spot Ether ETFs in May — similar to the way the SEC decided on 10 pending spot Bitcoin (BTC) ETFs in January.\n\nThe next day, the SEC also delayed its decision on whether to approve a spot Ether ETF from Grayscale Investments, opening the application to public comments. The SEC said it would institute proceedings to determine whether to approve or disapprove a proposed rule change allowing NYSE Arca to list and trade Grayscale Ethereum Trust shares. Opening the proposed investment vehicle to public comment will push the deadline for a decision by an additional 35 days upon publication in the Federal Register.\n\nThe SEC remains one of the most consistently anti-crypto forces in the United States. According to a report from litigation consulting firm Cornerstone Research, the number of crypto-related enforcement cases brought by the SEC in 2023 was the highest since 2013, suggesting that digital assets were a “top priority” for the commission. Of the 46 enforcement actions in 2023, Cornerstone reported the SEC imposed $281 million in monetary penalties for settlements and tripled the number of administrative proceedings from 2022.\n\nFINRA believes that 70% of crypto asset public communications violate the law\n\nIn other news, the Financial Industry Regulatory Authority (FINRA) reported that roughly 70% of crypto-related communications from a survey contained “false, exaggerated, promissory, unwarranted or misleading” claims or otherwise violated guidelines on public communications. FINRA reviewed over 500 crypto asset-related retail communications starting in November 2022. According to the regulator, it identified more than 70% of the reviewed communications that had “potential substantive violations” of its rules on communications with the public.\n\nAccording to the regulator, crypto-related communications could range from a podcast to an ad spot in the Super Bowl. Violations potentially included misleading claims on crypto and misrepresenting how the protections of federal securities laws apply to digital assets. FINRA added that the targeted exam provided crypto firms with questions to consider in their public communications.\n\nContinue reading\n\nFlorida and Alaska revoke Binance.US’s right to operate in their territories\n\nTroubled cryptocurrency exchange Binance.US continues to face pressure from regulators in the U.S. after the former Binance CEO Changpeng Zhao’s guilty plea. Regulators in Florida and Alaska have told Binance.US that the crypto exchange can no longer serve its residents. The Alaska Division of Banking and Securities reportedly denied renewing Binance.US’s license in January 2024. Florida’s Office of Financial Regulation has also issued an emergency suspension order against Binance.US’s money transmitter license. The suspension reportedly came a week after Binance’s founder and former CEO Zhao, also known as CZ, pleaded guilty to violating U.S. Anti-Money Laundering rules on Nov. 21, 2023. In late December, regulators in Arkansas, Illinois and South Dakota reportedly reached an agreement with Binance.US that would allow it to keep operating in those states. As part of that, Binance.US must make the transfer of Zhao’s voting rights irreversible.\n\nContinue reading\n\nCrypto lender Abra settles with Texan regulators\n\nCrypto lending firm Abra — allegedly insolvent since March 2023 — has entered a settlement in principle with the Texas State Securities Board (TSSB). The company will return assets invested by the state’s citizens. According to the document, Abra “began winding down U.S. retail operations” and will notify clients with more than $10 in their balances so they can withdraw their assets in seven days. The unclaimed assets will be converted to fiat currency and directed to remaining Texas investors.\n\nAccording to the settlement text, by the time the TSSB filed actions, Abra held $13.6 million of crypto on behalf of more than 12,000 investors in the United States. Only $1.8 million of them were owned by approximately 1,600 Texas residents. The company’s X account has been silent since June 2023. Bill Barhydt confirmed the settlement, emphasizing that Abra “has never (ever) frozen withdrawals for US users” and “voluntarily wound down” the Earn and Boost programs in 2023.\n\nContinue reading"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vaGFja2Vybm9vbi5jb20vZGlzdHJpYnV0ZWQtdmFsaWRhdG9yLXRlY2hub2xvZ3ktZGVjZW50cmFsaXppbmctZXRoZXJldW1zLXByb29mLW9mLXN0YWtl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Distributed Validator Technology: Decentralizing Ethereum's Proof-of-Stake - hackernoon.com",
        "content": "Too Long; Didn't Read\n\nPeople Mentioned\n\nDVT spreads out the tasks and risks related to the validation process in Ethereum's PoS system. It works by dividing and sharing a validator's key responsibilities among several entities, decreasing the chances of centralized control and eliminating single points of failure."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1jbGFzc2ljLXByaWNlLWZhY2VzLXJlcGVhdGVkLXJlamVjdGlvbi13aGF0cy1uZXh0LWZvci1ldGMtcHJpY2Uv0gFyaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLWNsYXNzaWMtcHJpY2UtZmFjZXMtcmVwZWF0ZWQtcmVqZWN0aW9uLXdoYXRzLW5leHQtZm9yLWV0Yy1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Faces Repeated Rejection! What’s Next For ETC Price? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe Ethereum Classic price continues to display strong bearish moves, indicating increased selling-over-buying pressure in the crypto industry. Moreover, the ETC price struggles to break out of its key resistance level, suggesting a bear power in the crypto space.\n\nThe ETC price traded in a closed range between $20.32 and $21.94 for a while, following which the market gained momentum and the Ethereum Classic price gained just enough momentum to break out of the resistance level.\n\nTradingView: ETC/USDT\n\nHowever, the rally was short-lived as the price faced rejection at $23.45, after which it traded sideways for a while. As the market volatility grew, the price experienced a correction of approximately 20%. The price traded between $18.77 and $20.32 for five days.\n\nFollowing the approval of the Bitcoin Spot ETF trading, the ETC price recorded a massive jump of 66% in valuation within the next three days. After facing rejection at $31.23, the price has been constantly traded under a bearish influence and has lost over 30%.\n\nThe ETC coin tested its important level of $21.94, but the bulls held the price strong, resulting in a price breakout. Since then, the price has been trading in a range between $23.45 and $25.04.\n\nWill ETC Price Regain Value?\n\nThe technical indicator, MACD, displays a neutral trend, indicating a weak buying and selling pressure in the market. Further, the averages show a flatline, suggesting an uncertainty in the future price action of this token.\n\nIf the bulls regain power, the price will gain momentum and test its resistance level of $25.04. Moreover, if the market continues to trade positively, it will prepare to test its upper resistance level of $26.43 in the coming time.\n\nNegatively, if the market fails to hold the price above the support level of $23.45, the price will lose momentum and fall to test its lower support level of $21.94. Further, if the bears hold power over the bulls, it will plunge further and prepare to test its support level of $20.32."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2NyeXB0by1hbmFseXN0LXdhcm5zLW9mLXBvdGVudGlhbC1wcmljZS1kcm9wLWZvci1ldGhlcmV1bS1iZS1jYXV0aW91cy_SAWVodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9jcnlwdG8tYW5hbHlzdC13YXJucy1vZi1wb3RlbnRpYWwtcHJpY2UtZHJvcC1mb3ItZXRoZXJldW0tYmUtY2F1dGlvdXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Crash Alert! Analyst Predicts Dive Below $1,000 - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Analyst Benjamin Cowen predicts a potential value drop below $1,000 based on historical patterns and the ETH/BTC pair.\n\nBitcoin's performance significantly impacts Ethereum.\n\nPotential approval of Ethereum ETFs in March could boost its price, but the wait-and-see approach remains.\n\nWell, this could come as bad news for many! Benjamin Cowen, a respected analyst, has raised a red flag regarding Ethereum’s future compared to Bitcoin. Widely recognized for his precise predictions, Cowen recently shared crucial insights on YouTube, pointing towards a potential downturn in Ethereum’s value.\n\nAt present, Ethereum is cautiously navigating around $2,297, reflecting a modest 0.33% dip in the last 24 hours.\n\nBut what’s coming next? Read on to find out.\n\nCowen’s Bearish Analysis\n\nIn a recent video, Benjamin Cowen, known for his accurate crypto predictions shared his thoughts about Ethereum (ETH), he believes that Ethereum’s value might drop a lot, possibly below $1,000 before entering into a bullish period.\n\nCowen looks at how Ethereum has behaved in the past and sees a historical pattern where it usually goes down, then a bit up, and then down again. This makes him think that Ethereum might still have to go down again before things get better.\n\nKey Indicator to Focus On\n\nCowen emphasizes the importance of the ETH/BTC pair, warning that a breakdown could lead to a significant drop in Ethereum’s USD value. Historical data supports this correlation.\n\nThat’s why Cowen predicts that Ethereum might go back to low values below $1,000, especially if the ETH/BTC pair breaks down.\n\nAlso Read: Crypto Market Analysis: Bitcoin, Ethereum, and Solana Price Prediction For This Week\n\nUnderstanding Bitcoin’s Impact\n\nHighlighting the symbiotic relationship between Ethereum and Bitcoin, Cowen predicts that a surge in Ethereum’s value hinges on a preceding uptick in Bitcoin. The gravitational pull of Bitcoin’s market dynamics significantly shapes Ethereum’s journey.\n\nAcknowledging the inherent unpredictability of predictions, Cowen factors in variables such as the Ethereum spot ETF and Bitcoin halving narratives. He emphasizes the intricate nature of market dynamics, recognizing their role in shaping Ethereum’s future.\n\nCould An ETF Help?\n\nWhile Cowen urges caution, optimism surrounds the prospect of Ethereum’s price surge if the SEC greenlights spot Ethereum ETFs. BlackRock’s extension and other major players, including VanEck, ARK 21Shares, Fidelity, Invesco Galaxy, Grayscale, and Hashdex, submitting ETF proposals, with decisions looming by March 10 and deadlines ranging from May to July, add layers of anticipation.\n\nRead More: Approval for Ethereum ETFs Coming Soon? Key Challenges You Should Know\n\nAs Ethereum stands at a crossroads, Cowen’s insights raise crucial questions about its future trajectory. Will Ethereum weather the storm, or will regulatory decisions reshape its path? We’re all waiting and watching."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0ODUyL21hZ2ljLWVkZW4tbXVsdGktY2hhaW4td2FsbGV0LXNvbGFuYS1wb2x5Z29uLWJpdGNvaW4tZXRoZXJldW3SAWVodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzQ4NTIvbWFnaWMtZWRlbi1tdWx0aS1jaGFpbi13YWxsZXQtc29sYW5hLXBvbHlnb24tYml0Y29pbi1ldGhlcmV1bQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Magic Eden launches multi-chain wallet for Solana, Bitcoin, Polygon and Ethereum - The Block",
        "content": "NFT marketplace Magic Eden has launched a multi-chain wallet supporting the Solana, Bitcoin, Polygon and Ethereum blockchains.\n\nThe platform previously launched the beta version of its wallet in November 2023, available to a small group of early testers, and teased today’s release in an X post on Friday.\n\nDeveloped in collaboration with Exodus, the wallet is self-custodial — ensuring users retain control over their crypto assets. It is designed to offer a more user-friendly experience, enabling instant cross-chain swaps, NFT portfolio management and trading of NFTs directly from the wallet.\n\n\"As the team made great strides in the NFT & Ordinals space, it became clear there was a missing complementary piece critical to convenience: a singular wallet that allows users to seamlessly manage and collect NFTs across major chains,\" Magic Eden wrote in an announcement.\n\nTo incentivize early adopters, Magic Eden said it is also offering limited-time in-wallet mints of NFT projects such as Claynosaurz, Degenerate Ape Academy and BoDoggos throughout February, among airdrops and other perks.\n\nFrom Solana to multi-chain NFT support\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nMagic Eden was initially focused on serving the Solana NFT community but expanded to offer support for Polygon NFTs in November 2022. Bitcoin and Ethereum became its third and fourth supported chains, respectively, in March 2023. Magic Eden was subsequently overtaken by Tensor as the top Solana NFT marketplace by daily trading volume later last year.\n\nMagic Eden is currently the second-largest marketplace by daily trading volume after OKX for Bitcoin Ordinals NFTs, according to The Block’s data dashboard. It also supports BRC-20 tokens — an experimental standard for fungible tokens on the Bitcoin blockchain.\n\nThe Block reached out to Magic Eden for comment."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9jcnlwdG8tbWFya2V0LWFuYWx5c2lzLWJpdGNvaW4tZXRoZXJldW0tYW5kLXNvbGFuYS1wcmljZS1wcmVkaWN0aW9uLWZvci10aGlzLXdlZWsv0gF7aHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2NyeXB0by1tYXJrZXQtYW5hbHlzaXMtYml0Y29pbi1ldGhlcmV1bS1hbmQtc29sYW5hLXByaWNlLXByZWRpY3Rpb24tZm9yLXRoaXMtd2Vlay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Crypto Market Analysis: Bitcoin, Ethereum, and Solana Price Prediction For This Week - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nAnalyst Crypto World has opened up about the current state of Bitcoin, Ethereum, and Solana. The analyst discussed the key technical indicators and potential scenarios for each cryptocurrency.\n\nBitcoin\n\nBitcoin’s price bounces between $37,900 and $38,500 from a crucial support level. The analyst pointed out a bearish divergence still present on the daily chart, as the Relative Strength Index (RSI) has not yet broken above a descending resistance line. However, the possibility of a bullish reversal is hinted at by the potential formation of a bullish cross in the daily MACD (Moving Average Convergence Divergence).\n\nWhile the bearish divergence is technically active, the analyst expressed neutrality in the short term. In the immediate short term, the 2-hour Bitcoin chart displayed a breakout above resistance levels between $41,700 and $42,200. The analyst expected support in this range and warned that a confirmed break below $41,700 could lead to a potential downturn toward $39,500.\n\nEthereum\n\nThe analyst observed that Ethereum Price is still under a bearish divergence on the daily chart. Despite this, the daily MACD indicated a reduction in bearish momentum, suggesting a more neutral outlook in the short term.\n\nOn the 4-hour chart, the analyst identified a potential short-term bullish scenario, comparing the current price structure to a historical fractal. The possibility of a slight bullish relief or sideways consolidation was mentioned, with a watchful eye on potential outflows from Grayscale influencing the market.\n\nSolana\n\nThe Solana price analysis focused on the 8-hour timeframe, where the price encountered resistance around $98 to $99. The analyst pointed out potential resistance levels at $102.50 and $108 to $109. A breakout above $99 and a rejection at $102 to $103 could lead to an inverse Head and Shoulders pattern, indicating a bullish trend reversal. Support levels were identified at $91 to $92 and $83.50 to $85.50."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vbWlsa3JvYWQuY29tL25ld3Mvc2VjLXVubGlrZWx5LXRvLWdyZWVubGlnaHQtZXRoZXJldW0tZXRmLXVudGlsLWxhdGUtMjAyNS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "SEC Unlikely To Greenlight Ethereum ETF Until Late 2025: TD Cowen - Milk Road",
        "content": "Investment bank TD Cowen has pushed back its predicted timeline for U.S. approval of a spot Ethereum exchange-traded fund (ETF) until late 2025 at the earliest.\n\nKey Predictions:\n\nSpot Ether ETF decision not expected before late 2025.\n\nSEC Chair Gensler has no political incentive to accelerate.\n\nSeeks to avoid fighting with progressives critical of crypto\n\nGensler’s term expires in June 2026.\n\nThe updated analyst view casts doubt on whether any spot Ethereum funds get regulatory blessings this cycle. Despite over half a dozen ETF applications awaiting verdicts, delays continue mounting.\n\nRead more: 73% Of Europeans Optimistic About Crypto: Binance\n\nEthereum ETF approval is likely to happen in 2025\n\nJaret Seiberg, the leader of TD Cowen Washington Research Group, wrote in a note on Monday, “We do not expect the SEC to approve a spot Ethereum ETF in 2024.”\n\nTD Cowen’s Washington Research team argues Gensler must tread carefully by neither provoking Congressional Democrats skeptical of crypto nor moving faster than he intends on key product approvals.\n\nThe bank notes that progressive support remains essential for advancing Gensler’s agenda this election year and potentially securing a role like Treasury Secretary in any Biden second term.\n\nRead more: $2.61 Billion Lost In Crypto Hacks And Scams In 2023: PeckShield\n\nSo confronting crypto skeptics over spot Ethereum risks political capital with minimal upside currently. From both a legacy and continuity stance, the SEC has incentives for restraint through 2024.\n\nMoreover, the agency has adopted an incremental philosophy towards crypto expansions like spot Bitcoin ETFs or Ethereum oversight. While frustrating for applicants, this measured tactic affords maximum flexibility to enact tighter rules in response to issues arising post-approval.\n\nTD Cowen suggests that, due to the SEC’s ability to easily delay or dismiss ETF applications using standard administrative procedures, it might take several more years before any final decisions are made, unless there’s significant outside influence."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbmVlZHMtdGhlc2UtMy1jcnVjaWFsLWZhY3RvcnMtdG8tYWxpZ24tZm9yLWdyb3d0aC1kZXRhaWxz0gFaaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1uZWVkcy10aGVzZS0zLWNydWNpYWwtZmFjdG9ycy10by1hbGlnbi1mb3ItZ3Jvd3RoLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Needs These 3 Crucial Factors to Align for Growth: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDespite Ethereum's position as a frontrunner in the altcoin sector, its growth has been stunted by a bearish trend that has held a tight grip on the market in recent weeks. A closer look at the ETH chart reveals that the expected volatility spike that could catalyze a bullish reversal has yet to materialize.\n\nLayer-2 network adoption and ecosystem expansion\n\nFirst, the surge of layer-2 solutions like Arbitrum and Optimism could be a catalyst for Ethereum's growth. These networks aim to enhance Ethereum's ecosystem by providing the much-needed scalability and reduced fees, potentially driving renewed interest and increased adoption of the Ethereum network.\n\nETH/USD Chart by TradingView\n\nScalability and network efficiency\n\nSecond, Ethereum's persistent scalability issues must be addressed. Despite the implementation of EIP-1559, which was anticipated to make transaction fees more predictable, the network still struggles under high demand, leading to exorbitant fees and reduced network functionality. Resolving these scalability woes is crucial, as a more efficient and cost-effective network is vital for Ethereum to retain its value and utility.\n\nIntroduction of Ethereum ETF\n\nFinally, the establishment of an Ethereum ETF would be a strong bullish signal, mirroring the impact of the Bitcoin ETF. An Ethereum ETF would pave the way for institutional investment, providing a regulated and accessible means for traditional investors to gain exposure to ETH. This could secure Ethereum's future as a mainstream financial asset and provide a stable foundation for long-term growth.\n\nLooking at the Ethereum chart, we identify a local resistance level at approximately $2433.5, a price point that has acted as a hurdle in recent trading sessions. For a bullish case to solidify, Ethereum needs to break past this resistance with conviction. Should this occur, it could signal a shift in investor sentiment and open the path to higher price levels."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8yMTQ2MjIvc29sYW5hLWZsaXBzLWV0aGVyZXVtLWRlZmktdHJhZGluZy1qdXBpdGVyLWFpcmRyb3AtbmVhcnPSAVhodHRwczovL2RlY3J5cHQuY28vMjE0NjIyL3NvbGFuYS1mbGlwcy1ldGhlcmV1bS1kZWZpLXRyYWRpbmctanVwaXRlci1haXJkcm9wLW5lYXJzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Solana Flips Ethereum in DeFi Trading as Jupiter Airdrop Nears - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nToken trading on Solana decentralized exchanges briefly flipped that of Ethereum exchanges in December as meme coin mania raged, and now it’s happened again—this time ascribed to an impending token airdrop.\n\nAs of Sunday night, rolling 24-hour trading volume on Solana-based decentralized exchanges (DEXes) topped Ethereum exchanges, according to data from DeFi Llama, with about $705 million on Solana during the span compared to $698 million on Ethereum.\n\nEthereum is back on top as of this writing, but the networks remain close: DeFi Llama shows about $742 million in Ethereum DEX trading over the last 24 hours, while Solana remains steady right around $705 million. Ethereum is well ahead in terms of seven-day volume, however, at $8.9 billion compared to less than $4.5 billion for Solana.\n\nAD\n\nAD\n\nEven so, the recent short-lived reversals show that the long-dominant Ethereum is facing increasing pressure from Solana, as the rival chain offers much cheaper and faster transactions. That was the case in December when trading on Solana meme coins like BONK and Dogwifhat (WIF) helped spike DEX volume.\n\nNow, the culprit appears to be the impending launch of JUP, the official token of the popular Solana decentralized exchange aggregator Jupiter. It’s set to debut on Wednesday with nearly a million wallets eligible to claim a share of JUP tokens.\n\nAccording to data from CoinGecko, Solana trading volume on Jupiter topped that of leading Ethereum DEX Uniswap V3 late Sunday, though much like with the broader chains, those places have already swapped as of Monday morning.\n\nUniswap V3 has over $629 million worth of trading volume over the past 24 hours, while Jupiter has about $571 million in DEX trading on Solana during that span.\n\nIt’s unclear whether any recent trading will actually factor into Jupiter airdrop eligibility, however, as the protocol took a snapshot of early users on November 2. It said that some 955,000 wallets would be eligible for the eventual drop, which is now set to take place on Wednesday. However, Jupiter has additional tokens planned for future airdrops.\n\nAD\n\nAD\n\nJupiter’s launchpad was used for last week’s WEN meme coin drop as a test run ahead of the JUP drop. More than a million wallets were eligible for the WEN airdrop, though the claim only lasted until Monday morning—with over 280 billion WEN left unclaimed.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ0Yy1zdXJwYXNzZXMtNDIwMDAtcmVzaXN0YW5jZS1hbmQtZXRoLXR1cm5zLXJlZC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as BTC Surpasses $42,000 Resistance and ETH Turns Red - Cryptonews",
        "content": "Bitcoin and Ethereum Price Prediction as BTC Surpasses $42,000 Resistance and ETH Turns Red\n\nIn the dynamic world of cryptocurrencies, Bitcoin and Ethereum continue to be the key players with their recent price movements catching the attention of investors. Bitcoin, the trailblazer of the crypto market, has recently rebounded, breaking through the $42,000 resistance level and registering a current price of $42,292. This nearly 0.50% increase in the last 24 hours coincides with the overall crypto market valuation at $1.63 trillion, despite a slight 0.15% drop.\n\nBitcoin’s surge is linked to favorable stock market trends and the significant achievement of BlackRock’s Bitcoin ETFs amassing over $2 billion in Assets Under Management. This bullish trend in Bitcoin’s price is a focal point for price prediction analyses.\n\nOn the other side, Ethereum, the second most notable cryptocurrency, has seen a minor setback, trading at $2,269 with nearly 0.50% decline. However, the buzz around the potential approval of a spot Ethereum ETF, as suggested by analyst James Seyffart, signals an optimistic future for Ethereum. The approval, expected in May, could attract more investment, influencing Ethereum’s price positively.\n\nMoreover, the global interest in cryptocurrencies is evident with developments like Harvest Hong Kong’s application for a Bitcoin ETF and a Binance survey revealing growing crypto acceptance in Europe. These factors collectively contribute to the evolving narrative of Bitcoin and Ethereum price predictions.\n\nHarvest Hong Kong’s ETF Bid: A Global Boost for Bitcoin’s Value\n\n\n\nHarvest Hong Kong, a prominent Chinese fund company, has officially submitted an application for a Bitcoin spot exchange-traded fund (ETF) with the Hong Kong Securities and Futures Commission.\n\nThe approval of this ETF, which is poised for launch after the Lunar New Year holiday on February 10, would mark Hong Kong’s first Bitcoin spot ETF. This initiative follows the successful introduction of spot Bitcoin ETFs in the United States, igniting worldwide interest.\n\nRachel Aguirre of BlackRock has acknowledged the impressive performance of the U.S. ETF, which has surpassed expectations. China’s entry into this sector adds a significant dimension to the dynamic landscape of digital asset investments, signaling a transformation in investor preferences.\n\nThus, Harvest Hong Kong’s application for a Bitcoin ETF reflects increasing global interest. Its potential approval could further elevate Bitcoin’s price by attracting additional investors and reinforcing its legitimacy in mainstream financial markets.\n\nBinance Report: Rising Crypto Acceptance in Europe and Bitcoin’s Prospects\n\n\n\nBinance’s latest survey reveals an increasing acceptance of cryptocurrencies in Europe, driven by their potential for high returns, decentralization, and continuous innovation. The study indicates that 73% of Europeans hold a positive view of digital currencies, with 55% utilizing them for regular transactions. This trend aligns with the global increase in cryptocurrency ownership, which soared from 432 million in January to 580 million by December 2023.\n\nSome really positive findings from our #Binance survey across Europe. 73% of respondents were optimistic about the future of crypto & with MiCA implemented soon, there’s a lot to be excited about in the region! More details from @Finbold here 👇https://t.co/gE3l6e5MtT — Rachel Conlan (@RachelConlan) January 25, 2024\n\nDespite a temporary decline in adoption following the FTX exchange issues in late 2022, confidence rebounded, partly due to the U.S. Securities and Exchange Commission’s (SEC) approval of 11 Bitcoin ETFs. High-profile sponsorships, including Crypto.com’s collaboration with the LA Lakers and OKX’s partnership with Manchester City, further enhanced trust in the sector.\n\nAs a result, the optimistic sentiment in Europe, highlighted by Binance’s survey, may positively impact Bitcoin’s price. The growing adoption, coupled with heightened optimism and usage, could attract more investors, potentially elevating the cryptocurrency’s market value.\n\nSeyffart’s Forecast: Ethereum ETF Approval in May Could Elevate ETH Value\n\n\n\nBloomberg Intelligence analyst James Seyffart sees a 60% chance of a spot Ethereum ETF getting approved in May. Despite recent delays for BlackRock and Grayscale proposals, Seyffart marks May 23 as a crucial date, expecting the SEC’s decision around that time. The SEC, having approved Bitcoin ETFs, is now considering proposals from BlackRock, Grayscale, Ark 21Shares, and VanEck.\n\nThe Road Ahead: A View on ETH Spot This is intended to be a deep dive into the current landscape for crypto spot ETFs generally with emphasis on ETH. Will do this in 4 parts for ease of reference. 1 – General Roadmap\n\n2 – Threshold Issue\n\n3 – BTC Spot Approval\n\n4 – ETH Analysis\n\n🧵 — Scott Johnsson (@SGJohnsson) January 25, 2024\n\nSeyffart is hopeful but acknowledges the SEC’s ability to delay decisions. Grayscale aims for a summer 2024 SEC decision on turning its Ethereum Trust into an ETF. As May approaches, Seyffart keeps an eye on filings, with May 23 as a key date for potential updates. Consequently, the prospect of a spot Ethereum ETF approval, highlighted by James Seyffart, could positively impact ETH price.\n\nBitcoin Price Prediction\n\nAs of January 29, Bitcoin’s (BTC/USD) technical analysis on the 4-hour chart underscores critical price points crucial for its short-term movement. The pivot point is set at $42,161, confronting immediate resistance at $43,394. Additional resistance levels are observed at $44,372 and $45,581. In contrast, the support levels are at $40,957, $39,644, and $38,618. The Relative Strength Index (RSI) reads at 70, reflecting robust buying interest that is nearing overbought territory. The 50-day Exponential Moving Average (EMA) is located at $40,820, providing a key support line. A significant pattern on the chart is Bitcoin’s ascend past a double top near the $42,160 region. A sustained closure above this level could be indicative of a strong upward trend. Thus, Bitcoin’s trend remains bullish as long as it stays above the $42,160 threshold. Ethereum Price Prediction As of January 29, Ethereum (ETH/USD) continues to hover around the $2,250 mark, demonstrating a phase of consolidation. The 4-hour chart sheds light on essential levels that are shaping Ethereum’s immediate market behavior. Its pivot point is identified at $2,321, facing immediate resistance at $2,388. Further resistance levels are located at $2,476 and $2,560. Conversely, Ethereum finds its initial support level at $2,241, followed by $2,169 and $2,102. The Relative Strength Index (RSI) is currently at 54, suggesting a balanced market condition. The 50-day Exponential Moving Average (EMA) stands at $2,314, reflecting a close alignment with Ethereum’s current price movement. Technical analysis indicates that Ethereum has achieved a 38.2% Fibonacci retracement level at $2,313. However, a descending trendline near the $2,300 level could act as an obstacle to any potential upward progression. In summary, Ethereum’s trend appears bullish above the $2,320 level. Short-term expectations include testing the resistance at $2,388, offering essential insights for traders and investors monitoring Ethereum’s market trends."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtanVwaXRlci10cmFkaW5nLXZvbHVtZS1za3lyb2NrZXRzLTE4NDUyOTUzMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Solana's Jupiter trading volume skyrockets ahead of JUP airdrop - Yahoo Finance",
        "content": "Jupiter, a Solana-based liquidity aggregator and decentralized exchange (DEX), has witnessed a significant increase in trading volumes, as the platform prepares for the issuance of its native token, JUP.\n\nThe increase in volume suggests that traders are positioning themselves to benefit from the Jan. 31 JUP airdrop. An airdrop is a method commonly used in the cryptocurrency space to distribute tokens to users, often to encourage adoption and usage of a new platform or currency.\n\nThe Solana ecosystem competes with other blockchains like Ethereum for dominance in the decentralized finance (DeFi) space and non-fungible tokens (NFTs).\n\nSolana’s total value locked (TVL), or the amount of crypto assets deposited in DeFi platforms, stood at US$1.40 billion at the time of writing, making it the fifth-largest DeFi chain in the world, according to DeFiLlama data. Ethereum hosts the world’s largest DeFi ecosystem with US$31.4 billion in TVL.\n\nTrading activity on Jupiter has been comparable to that seen on established platforms like Ethereum-based Uniswap, currently ranked as the world’s largest DEX with US$4.1 billion in TVL.\n\nSolana is also the world’s second-most active blockchain for NFTs, with US$4.8 billion in all-time sales behind Ethereum’s US$42.4 billion.\n\nIn December, Solana’s US$365.48 million barely edged Ethereum’s NFT sales volume of US$363.45 million.\n\nSolana’s native token SOL is the world’s fifth-largest cryptocurrency by market capitalization with US$43.8 billion. SOL traded at US$100 at the time of writing, up 15.5% over the past seven days, according to CoinGecko data."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yOS90b3AtY3J5cHRvLXN0cmF0ZWdpc3QtcHJlZGljdHMtb3Zlci01MC1yYWxseS1mb3ItZXRoZXJldW0tcml2YWwtc2F5cy1vbmUtbG93LWNhcC1hbHRjb2luLWxvb2tzLWFtYXppbmcv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzI5L3RvcC1jcnlwdG8tc3RyYXRlZ2lzdC1wcmVkaWN0cy1vdmVyLTUwLXJhbGx5LWZvci1ldGhlcmV1bS1yaXZhbC1zYXlzLW9uZS1sb3ctY2FwLWFsdGNvaW4tbG9va3MtYW1hemluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Top Crypto Strategist Predicts Over 50% Rally for Ethereum Rival, Says One Low-Cap Altcoin Looks Amazing - The Daily Hodl",
        "content": "A trader who nailed Bitcoin’s (BTC) 2018 bear market bottom believes that one Ethereum (ETH) rival is poised for a big burst to the upside.\n\nPseudonymous analyst Bluntz tells his 238,500 followers on the social media platform X that Solana (SOL) appears to have completed an ABC corrective wave.\n\nBluntz says that he now expects Solana to start a new five-wave rally that could see SOL printing about 50% gains from current prices.\n\n“SOL reclaimed breakdown range, move up to $150+ now basically confirmed. Bears about to learn the true meaning of pain.”\n\nThe analyst practices the Elliott Wave theory, a technical analysis approach that attempts to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset often goes through an ABC correction before launching a five-wave move to the upside.\n\nAt time of writing, SOL is trading for $97.24, up nearly 4% in the last 24 hours.\n\nThe analyst is also keeping an eye on the native asset of Moonriver (MOVR), an Ethereum (ETH)-compatible parachain built on Kusama (KSM). According to Bluntz, MOVR looks bullish after completing an ABC corrective move.\n\n“MOVR looking amazing here, flying under the radar big-time.”\n\nBluntz previously predicted that MOVR could rally to as high as $50.\n\nAt time of writing, MOVR is worth $23.48, down 4.49% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/herryfaizal/Salamahin"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2lsbC1ldGhlcmV1bS1yZWFjaC0xMDAwMC1pbi0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will Ethereum reach $10,000 in 2024? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum, the cornerstone of decentralized finance and the second-largest coin by market cap, is currently trading above $2,250. To reach our Ethereum price prediction of $10,000, the price of ETH would need a 5x increase. Is this feasible in 2024? Let’s analyze 😉\n\nIs Ethereum a Good Investment in 2024?\n\nIn 2024, Ethereum remains a strong investment option. Its position as a leader in the DeFi space and its consistent performance, despite market fluctuations, make it a viable choice for long-term investors. The potential for growth, as indicated by various chart analyses, suggests a promising future for Ethereum.\n\nEthereum’s Merge was NOT Enough\n\nInterestingly, the price of ETH dropped post-Merge, an event that was technically significant but had a limited immediate impact on price. This underscores the importance of understanding market psychology and the difference between short-term trading and long-term investing in Ethereum.\n\nIs Ethereum a Good Buy?\n\nEthereum is considered a good buy, especially for those looking at long-term investments. Its robust fundamentals, coupled with a growing ecosystem, make it a standout in the crypto market. Investors should, however, be aware of market dynamics and invest wisely.\n\nEthereum Price Prediction: Will ETH Reach $10,000 in 2024?\n\nOur Ethereum price prediction analysis, based on charting techniques, suggests that while ETH reaching $10,000 in 2024 might be ambitious, it’s not out of the realm of possibility. The key price point to watch in 2024 is $3,300, as surpassing this level could signal the start of an accelerated uptrend towards our target.\n\nEthereum price history chart in USD – coinmarketcap\n\nHowever, the $10,000 looks like a far target as this means a 5x from current prices.. Since Ethereum is strongly correlated to Bitcoin, this means that Bitcoin would reach around $200,000, which is a target beyond 2024.\n\nWhere to Buy Ethereum in 2024?\n\nEthereum can be purchased on various exchanges, with Bitget being a notable option. Bitget offers a user-friendly platform with robust security measures, making it an excellent choice for buying and trading Ethereum. Additionally, Bitget fees are one of the lowest in the market, so you won’t have to worry about high fees if you trade regularly.\n\n–> CLICK HERE TO BUY ETH <–\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW1ha2VzLXN1cnByaXNpbmctdmlzaXQtdG8tYmluYW5jZS1uZXctY2VvLXJpY2hhcmQtdGVuZy1zaGFyZXPSAWtodHRwczovL3UudG9kYXkvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1tYWtlcy1zdXJwcmlzaW5nLXZpc2l0LXRvLWJpbmFuY2UtbmV3LWNlby1yaWNoYXJkLXRlbmctc2hhcmVzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 14:06:06 GMT",
        "title": "Ethereum's Vitalik Buterin Makes Surprising Visit to Binance, New CEO Richard Teng Shares - U.Today",
        "content": "In an unexpected turn of events, Ethereum (ETH) cofounder and prominent figure in the cryptocurrency industry, Vitalik Buterin, paid a surprise visit to the Binance office. The revelation came from the CEO of the world's largest cryptocurrency exchange, Richard Teng , who shared the news on his X page.\n\nAdvertisement\n\nTeng expressed his gratitude for the privilege of hosting Buterin.\n\nIt was a privilege to have @VitalikButerin visit the #Binance office!\n\n\n\nThanks for taking the time to connect and talk to our team in person 🙏 pic.twitter.com/PYrpX0HXsQ — Richard Teng (@_RichardTeng) January 29, 2024\n\nThe impromptu meeting sparked a flurry of speculation within the crypto community, as enthusiasts and experts alike pondered the potential collaboration between these two giants of the crypto market. Notably, Binance has been grappling with heightened regulatory scrutiny in recent months, leading to the legal predicament of its former CEO, Changpeng \"CZ\" Zhao.\n\nVitalik and Binance connections\n\nThis unexpected rendezvous holds significance, given Buterin and Binance's history of active collaboration, such as Buterin's contribution to the proof-of-reserves concept for centralized crypto exchanges just two years ago. Against the backdrop of Binance's $4 billion fine and ongoing regulatory challenges, the nature of the discussions between Buterin and the Binance team remains shrouded in mystery.\n\nVitalik Buterin's recent focus, as evident in his essay titled \"Make Ethereum Cypherpunk Again,\" centers on security, privacy and scalability. Notably, he addressed concerns about centralized exchanges and their vulnerability to hacking — a topic that adds fuel to the speculation of potential collaborative efforts between Buterin and Binance.\n\nAs the crypto community eagerly awaits further developments, the surprise visit has sparked intense discussions about the future direction of these industry heavyweights."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tbWFya2V0LXNoYWtlLTItY3J5cHRvcy0yMDM1MjY4MjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Crypto Market Shake-Up: 2 Cryptos to Buy and 1 to Sell - Yahoo Finance",
        "content": "The cryptocurrency market is continuing to evolve.\n\nIncredibly enough, Bitcoin (BTC-USD) is now 15 years old; the original digital currency kicked off back in 2009. And as the industry matures, change inevitably comes for the industry.\n\nThe big cryptocurrency investment strategy for this year is the rise of institutional capital. With the advent of exchange-traded funds (ETFs), large financial firms can now safely deploy capital into Bitcoin with the click of a button. ETFs also allow individual investors to readily access the Bitcoin market from their tax-sheltered retirement accounts. This change opens up a new frontier for digital assets.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCrypto to Buy: Bitcoin (BTC-USD)\n\nUp trend Technical graph of Bitcoin (BTC-USD) in futuristic concept, BITI ETF is a Bitcoin short fund for investors betting against Bitcoin.\n\nSource: Sittipong Phokawattana / Shutterstock.com\n\nEarlier this month, the SEC dramatically changed the cryptocurrency game. On January 11th, the SEC approved the trading of 11 different ETFs devoted to Bitcoin. Those included funds such as iShares Bitcoin Trust (NASDAQ:IBIT) and Invesco Galaxy Bitcoin ETF (NYSE:BTCO), which have attracted substantial amounts of investor capital since launching a few weeks ago.\n\nUp until January 2024, investors had much more limited access to Bitcoin on American stock exchanges. Grayscale Bitcoin Trust (NYSEARCA:GBTC) was operating as a trust but could only trade on the Pink Sheets. Previously, the SEC blocked Grayscale’s petition to convert itself into an ETF.\n\nNow, though, Grayscale has been able to become an ETF, and that fund conversion has ushered in the approval of all other sorts of digital asset ETFs as well. With Bitcoin being the oldest and most well-known crypto, it stands to gain the lion’s share of new capital flowing into the industry.\n\nCrypto to Buy: Ethereum (ETH-USD)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nEthereum (ETH-USD) should be the next cryptocurrency in line to benefit from this trend. The SEC is expected to rule on whether or not it will approve Ethereum ETFs later this spring. Some analysts are hopeful this could lead to a major rally in the price of ETH.\n\nStory continues\n\nBears might contend that cryptocurrency prices initially sold off in the wake of the Bitcoin ETF approvals, which is true. However, in that case, the Grayscale Bitcoin fund already had a large sum of capital in it, and once the ETFs were approved, a large chunk of money was transferred out of that GBTC product into other funds with lower expense ratios.\n\nWith that shift largely taken care of, future inflows into the Bitcoin ETFs should be a net positive for the ecosystem and support higher prices. In any case, there is not much money in Ethereum trusts; an Ethereum ETF would tap a more unclaimed market, potentially leading to significant upside later this year.\n\nCrypto to Sell: Floki Inu (FLOKI-USD)\n\nFloki Inu price predictions. An image of a corgi wearing a horned viking helmet above text saying Floki Inu on a black background.\n\nSource: Zie Project/ShutterStock.com\n\nThere is a flip side to the cryptocurrency investment strategy centered around capturing these institutional capital flows.\n\nThe arrival of all these big-name asset managers like BlackRock (NYSE:BLK) in the ETF space is that cryptocurrency is a more serious endeavor now. And in attracting this more professional class of investors, the overall digital asset landscape changes.\n\nWe’ve already seen more speculative parts of the crypto landscape, like non-fungible tokens (NFTs), lose popularity. Meme coins are likely to be another loser during this shift.\n\nTake Floki Inu (FLOKI-USD) for example. The coin is one of the various meme tokens to emerge riding off the popularity of Dogecoin (DOGE-USD). However, given Floki Inu’s high transaction tax, limited visibility and minimal utility, it seems Floki Inu will not have a promising future.\n\nIn the wild west days of crypto, meme coins with little more than social media support could enjoy significant popularity. With the rise of ETFs and institutional money in crypto, however, unproven oddities such as Floki Inu are likely to fall by the wayside as the smart money concentrates in the most promising tokens and projects.\n\nOn the date of publication, Ian Bezek did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Bezek has written more than 1,000 articles for InvestorPlace.com and Seeking Alpha. He also worked as a Junior Analyst for Kerrisdale Capital, a $300 million New York City-based hedge fund. You can reach him on Twitter at @irbezek.\n\nMore From InvestorPlace\n\nThe post Crypto Market Shake-Up: 2 Cryptos to Buy and 1 to Sell appeared first on InvestorPlace."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvLm5ld3MvY2hpbmVzZS1ldGhlcmV1bS1jb25mbHV4LWp1bXBzLTEzLWZvbGxvd2luZy1zdHJhdGVnaWMtZGVhbC13aXRoLXZlbnR1cmUtZmlybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "'Chinese Ethereum' Conflux jumps 13% following strategic deal with venture firm - crypto.news",
        "content": "Conflux Network’s CFX token gained over 13% amid a ‘strategic partnership’ agreement with Asia-based venture studio BlockBooster.\n\nIn an X thread, Conflux Network said the latest deal with the Asia-based venture studio will focus on identifying “web3 incubation opportunities within the Conflux ecosystem,” as the project wants to facilitate “major events for Conflux builders.”\n\n🤝 Conflux is excited to announce a strategic partnership with the emerging Asia-based venture studio @0xBlockBooster! pic.twitter.com/iqzBB3QWgW — Conflux Network Official (@Conflux_Network) January 26, 2024\n\nWhile no other details have been released, the news was enough to impact the CFX token, which gained over 13% surging to $0.24, according to CoinGecko data. BlockBooster, commenting on the agreement, expressed its intent to support web3 infrastructure, social initiatives, and gaming projects through the partnership with Conflux.\n\nCFX price in USD | Source: CoinGecko\n\nYou might also like: Conflux reports 16% losses following Bitcoin L2 announcement\n\nMeanwhile, the blockchain network is gearing up to introduce an Ethereum Virtual Machine (EVM)-compatible layer-2 solution that can interact with the Bitcoin network amid growing interest.\n\nConflux’s proposed layer-2 solution will allow users to move Bitcoin (BTC) and other inscription-powered assets between its blockchain and Bitcoin‘s ecosystem. The new layer-2 network is set to operate on top of the main Conflux chain, utilizing BTC for gas fees and supporting Ethereum-based smart contracts via the EVM standard.\n\nEstablished in 2018, Conflux Network positions itself as a blockchain platform, claiming to be the sole regulatory-compliant public blockchain in China. The project, often referred to as the “Chinese Ethereum,” is designed to offer a scalable and decentralized infrastructure for various applications.\n\nFollow Us on Google News"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8yMTQ2NTcvZXRoZXJldW0tbGF5ZXItMi1pbW11dGFibGUtemtldm0tbGF1bmNoZXMtaGVyZXMtd2hlbi1nYW1lcy1hcmUtY29taW5n0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzIxNDY1Ny9ldGhlcmV1bS1sYXllci0yLWltbXV0YWJsZS16a2V2bS1sYXVuY2hlcy1oZXJlcy13aGVuLWdhbWVzLWFyZS1jb21pbmc_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2 Immutable zkEVM Launches—Here's When Games Are Coming - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nImmutable zkEVM, a new gaming-centric Ethereum layer-2 network powered by Polygon’s zkEVM technology, has launched its mainnet in “early access,” offering a first opportunity for developers to begin building on the chain.\n\nAccording to Immutable, the firm behind the network and also the current Immutable X network, Immutable zkEVM will remain in a limited early access configuration for now, which means only approved developers can build on the network.\n\nA representative said that Immutable zkEVM hopes to open up access to all builders sometime in 2024, although nothing has been confirmed yet. In the meantime, the zkEVM testnet is available for studios to experiment and test on.\n\nAD\n\nAD\n\n\"The launch of Immutable zkEVM marks a major milestone in our mission to build the best end-to-end experience for Web3 games,” Immutable Head of Product Marketing Michael Powell told Decrypt’s GG. “The chain is uniquely positioned to empower game studios to grow their game’s economy, protect their communities, and create frictionless experiences for their users.”\n\n“It represents the next step in developing a gaming ecosystem that benefits players, studios, and developers,” he continued. “Most importantly, it makes it easier to build great games by offering gas-free functionality for players, turnkey product integrations and smart contract templates, and a secure gaming environment.\"\n\nAction role-playing game Guild of Guardians and card-based strategy game Shardbound, both published by Immutable itself, will launch on Immutable zkEVM sometime during the first half of 2024, a company representative told Decrypt’s GG.\n\nAnother game set to go live on Immutable zkEVM during the same span is MetalCore, a mech-battling action game that Decrypt’s GG tested in 2023 with promising results. Matt Candler, CEO of developer Studio369, said to expect “community missions and play test milestones” ahead for players in the run-up to the launch.\n\n\"By building on Immutable zkEVM, we can implement even more features that will leverage the collective development efforts of the entire Ethereum ecosystem,” he told Decrypt’s GG. “We're ready to leverage this breakthrough technology to deliver the next generation of blockchain games that are fun and show MetalCore players what the power of Web3 can deliver.”\n\nAD\n\nAD\n\nImmutable zkEVM was announced in March 2023 as a collaboration between Polygon and Immutable, two leaders in the Ethereum scaling space, as a way to combine their efforts to build a core destination for crypto and NFT games. Immutable co-founder and President Robbie Ferguson called the network “the endgame” for the company’s Web3 gaming plans at the time.\n\nImmutable’s IMX token has become the most valuable gaming token by market cap, according to data from CoinGecko, ranked 36th among all cryptocurrencies at a current price just above $2.00 as of this writing. IMX is up over 200% over the past year as the broader crypto market has emerged from the depths of a prolonged bear cycle.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi13aWxsLWV0aC1leGNlZWQtNDAwMC1tYXJrLWJlZm9yZS1mZWJydWFyeS1lbmQv0gFpaHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLXdpbGwtZXRoLWV4Y2VlZC00MDAwLW1hcmstYmVmb3JlLWZlYnJ1YXJ5LWVuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can $ETH Hit $4,000 by Q1 2024? - CoinGape",
        "content": "Ethereum price prediction: Over the past two weeks, the smart contract giant Ethereum has witnessed aggressive correction in its native token ETH. The coin price plunged from a $2714 high to a recent low of $2171, registering a 20% loss. However, as the broader market witnessed renewed buying pressure, the Ethereum price managed to hold its ground above $2200. As the development of ETH ETF gains attention from market participants, the Ethereum price could find an opportunity to return on a recovery trend.\n\nDuring the last week, Ethereum’s price fluctuated between $2,170 and $2,265, showcasing a tug-of-war between market bears and bulls. This pattern reflects a year of robust growth for Ethereum, with a notable 54% increase in value. This resilience is further underscored by a surge in trading volume, which reached a staggering $7.15 billion, reinforcing Ethereum’s position as the second-largest cryptocurrency with a market capitalization of $271 billion, according to Coinmarketcap.\n\nadvertisement\n\nEthereum Price Prediction: Recent Trends and Bullish Signals\n\nEthereum reached its peak value of $2,717 on January 12. Since then, it has mostly hovered around the $2,200 mark, indicative of a sideways movement in its price trend. These oscillations within a defined range suggest a mix of market strength and uncertainty. Crypto analysts are leaning towards a bullish short-term forecast for Ethereum, fueling optimism about its future performance in the market.\n\nCrypto analyst Crypto Tony has been closely monitoring Ethereum’s price movements. His analysis suggests a forthcoming surge in Ethereum’s market value. He notes a prevailing positive trend that could catalyze a substantial rally. According to Tony, should Ethereum maintain its crucial $2,100 support level, it may be on track for considerable financial growth.\n\nEthereum price analysis reveals a significant trend in its daily chart, marked by an ascending channel formation. This pattern has been a key indicator for investors. However, Ethereum’s recent downturn has led to a break below the channel’s support line. Additionally, Ethereum struggled against the resistance posed by the EMA 21 during its last uptrend, hinting at a potential short-term bearish scenario for the cryptocurrency.\n\nEthereum Price Prediction: Can ETH Sustain the Bullish Momentum?\n\nThe current support level at $2,200, reinforced by various technical indicators, forms a robust support zone. If Ethereum manages to sustain above this critical level, there’s potential for a bullish surge. This upward movement could target the $2,400 mark. Beyond this, sustained bullish momentum could see ETH challenging higher resistance levels, potentially reaching $3,000 and possibly escalating to $4,000 by the end of February 2024.\n\nConversely, a drop below the pivotal $2,200 support level could trigger a downward trend for Ethereum. Such a decline could steer the price toward the lower support line near $2,120. If bearish forces continue to exert pressure, Ethereum might find its next support level around $2,000, potentially leading to a market correction.\n\nThe technical indicators for Ethereum are showing promising signs, with the Relative Strength Index (RSI) currently positioned at 48. This figure, hovering just below the neutral 50 mark, suggests that buyers hold firm ground. The daily chart for Ethereum reflects a positive trend, particularly after it surpassed its 200-day moving average and moved out of a significant descending channel.\n\nMoreover, bullish signals are reinforced by the behavior of the Moving Average Convergence Divergence (MACD). The MACD line’s ascent above the signal line indicates growing bullish momentum, a sentiment echoed by the rising histogram. This bullishness is further bolstered by the upward movement of the 20-day Simple Moving Average (SMA) and the crossing of the 50-day SMA over the 200-day SMA. Additionally, the Chaikin Money Flow indicator, currently at 0.01, resides in the positive zone, providing further evidence of a bullish market outlook for Ethereum.\n\nRelated Articles"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tZXRmLXdpbGwtaGFwcGVuLXZlcnktZmFzdC1oZXJlLWFyZS10aGUtY29pbnMtdG8tYnV5LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Will Happen Very Fast -- Here Are The Coins to Buy Now - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nThe approval of Bitcoin ($BTC) Spot ETFs has created a new precedent for digital assets having ETF products, and the Ethereum ($ETH) ETF will happen very fast. An Ethereum Futures ETF product already uses spot price as its base, making any argument against an approval nonsensical. BlackRock knows what it is doing, and an Ether Spot will be available later this year.\n\n\n\nNow is the right time to be bullish on Ethereum and Ethereum betas- these are the top cryptos to buy right now. Betas are smaller cap tokens whose performance is linked to a leading asset. Regarding Ethereum, here are the coins to buy now: $ETH, $ARB, $SNX, $OP, and $GFOX.\n\n\n\nGalaxy Fox ($GFOX) Ethereum Presale Beta\n\nGalaxy Fox is a hybrid meme/ P2E token and is an excellent play for anybody who is bullish on GameFi, memecoins, and Ethereum. Its unique positioning in dual narratives gives it tremendous upside potential, and the protocol itself has an excellent user acquisition model.\n\n\n\nIts Web3 runner game pays out prizes to skilled players, and anybody can compete. A new dimension is added with NFTs boosting in-game stats, and the ability to earn real money is a perfect incentive for new users to enter this ecosystem. Users stay for the staking rewards, and the protocol’s token burn means they are earning yield on a deflationary asset.\n\n\n\nThis ICO launching in the Ethereum ecosystem while specualtive attention is focused here could easily produce a 100X run. $GFOX is a top crypto to buy now.\n\nEthereum ($ETH) Spot ETF Loading\n\nEthereum is the next narrative trade, and investors already have the playbook. Bitcoin was at $25,000 when Fink announced he had made an application for a Spot ETF. It rallied all the way to $48,000. Ethereum will do the exact same.\n\n\n\nBuying $ETH now has to be one of the most straightforward trades in the world. However, given $ETH’s large market cap upside potential is certainly capped compared to the beta plays.\n\n\n\nArbitrum ($ARB) Leading Layer 2\n\n\n\nArbitrum ($ARB) is the leading layer two and is an easy beta play. $ARB’s performance is heavily affected by $ETH’s price, and if Ethereum rallies 5%, Arbitrum typically rallies 15%+.\n\n\n\nSet to benefit from the Dencun upgrade and the introduction of a new type of transaction known as a blob. Blobs will massively reduce the cost for rollup providers and end users. $ARB is one of the top 5 cryptos to invest in for anybody bullish long-term on Ethereum and the future of rollups.\n\n\n\nSynthetix ($SNX) Liquidity Provision King\n\n\n\nSynthetix ($SNX) is another of the top cryptos to buy right now, and this liquidity provision protocol is a crucial pick-and-shovel play. It is the backend for multiple protocols on Ethereum and Optimism, and a massive percentage of trading activity taking place on-chain feeds value back to $SNX stakers.\n\n\n\nOptimism ($OP) Rise of the OP Stack\n\n\n\nOptimism ($OP) is the second-largest rollup, and the propagation of the OP Stack, a modular framework for building rollups, promises to feed an incredible amount of value to $OP token holders.\n\n\n\nThey will control governance rights for all rollups constructed using the OP Stack, and the growing adoption of this tech standard increases Optimism’s technological dominance. $OP is another top crypto to buy for anybody who is bullish on Ethereum and modular design.\n\n\n\nClosing Thoughts: Ethereum Uptrend Unlocks Huge Upside For Betas\n\n\n\nThe Ethereum Spot ETF will happen sooner than investors think, and beta plays are the top cryptos to buy now. As $ETH becomes dominant and starts to outperform Bitcoin, it gives these smaller caps riding on its coattails enormous upside potential.\n\n\n\nAs per raw ROI potential, Galaxy Fox is leaps and bounds beyond its competition, and $GFOX launching in the current conditions is a clear path to a 100X rally. Participate in the presale today!\n\nLearn more about $GFOX here:\n\nVisit Galaxy Fox Presale | Join the Community"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1ldGhlcmV1bS1wcmVkaWN0aW9ucy10dXJuLWJ1bGxpc2gtd2hhdHMtbmV4dC1mb3ItcHJpY2VzL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1ldGhlcmV1bS1wcmVkaWN0aW9ucy10dXJuLWJ1bGxpc2gtd2hhdHMtbmV4dC1mb3ItcHJpY2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "As Ethereum predictions turn bullish, what’s next for prices? - AMBCrypto News",
        "content": "Ethereum has a bullish structure on the weekly chart.\n\nThe two key range resistance levels overhead line up well with the liquidation heatmap.\n\nEthereum [ETH] bulls took over a month to breach the resistance at the $2.4k mark. The Bitcoin [BTC] spot ETF approval news took Ethereum to the local high at $2.7k, but was rejected from there.\n\nThis price action presented the idea of a range within a range, which AMBCrypto explores here. In the meantime, the weekly market structure remained bullish, with the $2.1k level being the higher low.\n\nThe $2370 resistance could rebuff ETH bulls\n\nThe one-week chart showed that the $2.5k to $2.7k zone was a resistance from May 2022. It had been a support zone in March 2022 but was later breached. In the past two weeks, it served as a supply zone.\n\nThe range (purple) for Ethereum extended from $2.1k to $2.6k, with the mid-range mark at $2370.\n\nThe lows of the range saw candlewicks on the daily chart venture below $2.2k, but these were quick to bounce upward. The past few days saw another such reaction.\n\nUntil the push above $2.4k, the mid-range could be considered a range by itself. The price action since then has shown that expanding the range highs made sense.\n\nTherefore, the $2.4k and $2.6k levels are likely to oppose ETH gains.\n\nThe RSI was below neutral 50 to reflect bearish momentum, but this could change. On the other hand, the OBV fell to the December highs.\n\nThe OBV appeared to move within a range, just like the price. This meant that the buyers and sellers had been equally strong over the past month.\n\nThe liquidation heatmap could give more clues\n\nThe one-day price action suggested that a bounce to $2.4k was likely. It also underlined that the $2150-$2200 region was a firm demand zone.\n\nData from Hyblock agreed with both these inferences that AMBCrypto drew from the price action chart.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe $2420-$2450 area was estimated to have close to $3 billion worth of liquidation levels.\n\nFurther north, the $2620-$2660 and $2750-$2800 regions were estimated to have $3.8 billion and $5 billion worth of liquidation levels respectively. This meant swing traders could book profits at these levels.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi93ZWVrbHktcmVjYXAtYml0Y29pbi1iaW5hbmNlLWV0aGVyZXVtLXNvbGFuYS1jcnlwdG8tbmV3cy15b3Utc2hvdWxkbnQtbWlzcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana, crypto news you shouldn't miss - Cointribune EN",
        "content": "Mon 29 Jan 2024 ▪ 9 min of reading ▪ by Luc Jose A.\n\nAt the intersection of cutting-edge technology and economic fluctuations, the world of cryptocurrencies never fails to astonish us. This week, we witnessed a series of events that not only redefine the value and function of digital currencies but also their impact on our society and global economy. From the depths of the Mt. Gox affair to the heights reached by Solana, not to mention the imminent challenges of Bitcoin and Ethereum, as well as the intrigues surrounding SHIB, each story is a thread in the complex labyrinth of crypto. Join us on this weekly journey as we unravel these threads to bring you a clear and precise understanding of the latest developments in this fascinating universe.\n\nBitcoin: The Storm Nears with the Distribution of 200,000 BTC from Mt. Gox\n\nIn 2014, the Bitcoin world was shaken by the hacking of Mt. Gox, one of the largest exchange platforms at the time. Today, after a decade of twists and turns, Mt. Gox is set to repay its creditors, marking a major turning point. This process will result in the release of 200,000 BTC into the crypto ecosystem. Recently, the mtgoxinsolvency subreddit has been buzzing following the receipt of emails requesting confirmation of identity and account details.\n\nThe announcement of the distribution by Mt. Gox comes at a time when Bitcoin, already below the $43,000 mark, seems to be on a tightrope. On the one hand, the threat of a crash induced by the massive sale of recovered BTC looms. On the other, a breeze of optimism is blowing thanks to the successful introduction of a Bitcoin ETF by BlackRock, signaling a new influx of capital. Investors remain suspended between hopes of gains and fears of losses, making the Mt. Gox distribution a potentially seminal event for Bitcoin’s recent history.\n\nBitcoin Halving 2024: Miners Soon to Go Bankrupt?\n\nThe Bitcoin halving scheduled for March 2024 will cut miner rewards in half, a situation that could be catastrophic for many mining players if not offset by a price increase. In 2024, Bitcoin mining requires colossal technological means, with professional miners investing massively in high-performance computing equipment and spending huge amounts on electricity to power their mining farms. According to Cantor Fitzgerald, the average cost to produce a single bitcoin currently sits around $8,500.\n\nSo far, the bitcoin reward awarded for each validated block allowed many miners to partially offset these deficits. But after the 2024 halving, this reward will be halved, potentially falling to 3.125 BTC. Such a drastic reduction in income, without an equivalent increase in price, could spell doom for most mining companies. Only those with the most aggressive production costs might hope to continue creating value. The Cantor Fitzgerald report warns that without a substantial rise in the price of bitcoin, the halving could trigger a “crypto winter” and a wave of bankruptcies, making mining economically unviable and threatening the decentralized integrity of the Bitcoin network.\n\nSolana Launches Token Extensions: A Sizeable Revolution!\n\nSolana recently announced the introduction of token extensions, heralding the dawn of a new era in the crypto space. These extensions are not mere additions but cornerstones of a structure aiming to revolutionize the SPL Token standard. They promise to turn security, compliance, and ease of use into tangible realities for businesses in the crypto sphere. Solana’s token extensions introduce innovations such as transfer hooks, adjustable transfer fees, and confidential transfers, offering secure and compliant navigation in the crypto space.\n\nAnatoly Yakovenko, the visionary behind Solana Labs, sees these extensions as the essence of what makes Solana unique. Their potential for massive adoption is particularly captivating, and the Solana Foundation envisions a future where crypto businesses dive into Web3 with assurance. Furthermore, despite recent volatility, the SOL crypto shows signs of underlying strength that is impressively resilient.\n\nEthereum Developers Announce Major Update\n\nEthereum developers have announced the deployment schedule for Dencun, a crucial update aimed at improving performance and reducing transaction fees. This update will first be activated on the Sepolia and Holesky testnets, on January 30 and February 7 respectively, before its deployment on the mainnet. These testnet activations are essential to ensure a smooth transition to this new version of Ethereum. Tim Beiko, one of the lead developers, emphasizes the importance of these tests to validate the robustness of Dencun and prepare for its official launch.\n\nDencun continues the revolutionary work started by Shapella in 2023, integrating the “EIP-4844” update, better known as “Protodanksharding.” This advancement is expected to lead to a dramatic decrease in transaction fees for Ethereum-based layer 2 solutions, with an estimated reduction of 90% for protocols like Optimism or Arbitrum. This radical drop in costs promises to increase the accessibility and usage of the Ethereum blockchain, thus stimulating the emergence of new layer 2 innovations.\n\nMysterious Transfer of 420 Billion SHIB: Is The Hype Back?\n\nA massive transfer of 420 billion Shiba Inu (SHIB) tokens, worth $3.87 million, has recently puzzled crypto investors. On January 21, an anonymous investor transferred this astronomical sum of SHIB between two unidentified Ethereum addresses. The origin of the tokens, initially stored in a wallet associated with Coinbase Prime Custody’s institutional custody solution, suggests possible involvement of professional investors. This transfer, of a rare magnitude, adds to the confusion and speculation surrounding the transaction.\n\nThis major movement of SHIB occurs shortly after a similar transaction was identified by Arkham Intelligence, involving large purchases of Shiba Inu by Robinhood. The SHIB price, which has recently dropped to its lowest level since early December 2023, shows signs of repurchase, hinting at a possible trend reversal. If the SHIB price manages to consolidate around its current level, some analysts estimate that a sustained crossing of the $0.00001 threshold could be feasible, potentially adding a bullish element to this scenario.\n\nOnly 5 Exchanges Control 98% of the Crypto Market in Euros\n\nA recent study by Kaiko reveals that only five exchange platforms control 98% of the total volume of crypto exchanges in euros. Among more than a dozen exchanges offering euro transaction services, Bitvavo, Kraken, Coinbase, Bitstamp, and Binance overwhelmingly dominate the market. This high concentration underlines the disparity in the distribution of market shares among crypto exchanges.\n\nEuropean traders have shown a marked preference for Bitcoin (BTC) in 2023, with exchange volumes exceeding 37 billion euros. In comparison, Ether (ETH) from Ethereum and Ripple’s XRP recorded respective volumes of 15 billion euros and 9.5 billion euros. This dynamic highlights Bitcoin’s preeminent crypto status.\n\nBitcoin Bonanza: Uncle Sam Prepares a Mega Sale of Silk Road’s Crypto Treasury\n\nThe U.S. government is set to conduct a sensational sale of $130 million worth of bitcoins, seized in the course of the infamous Silk Road scandal. Silk Road, a virtual black market specialized in money laundering and drug trafficking, was shut down in 2013, but the confiscated bitcoins continue to haunt auctions. This sale undoubtedly represents a unique opportunity for bidders.\n\nThe seizure of 69,000 BTC related to the Silk Road case by the United States and the announcement of their imminent sale raise questions about the possibility of laundering a criminal past through government auctions. This situation shines a light on the moral dilemma surrounding the sale of seized goods from illegal activities.\n\nThat’s the main news to remember for this week. But if you want a more detailed recap and in-depth analyses directly in your inbox, feel free to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMjkvdGQtY293ZW4tZm9yZWNhc3RzLXVzLXNwb3QtZXRoZXJldW0tZXRmLWFwcHJvdmFsLWJ5LTIwMjYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "TD Cowen Forecasts US Spot Ethereum ETF Approval by 2026 - Crypto Times",
        "content": "The American independent investment bank, TD Cowen predicts a U.S. spot Ethereum ETF approval by late 2025 or early 2026, shifting from its initial post-November 2024 forecast, as reported by The Block.\n\nThe bank attributes the delay to political considerations, suggesting SEC Chair Gary Gensler’s reluctance to upset progressive Democrats, who were displeased with the recent spot bitcoin ETF approval.\n\nTD Cowen asserts Gensler’s cautious approach to crypto, emphasizing the need for more experience with approved Bitcoin ETFs before endorsing an Ethereum counterpart.\n\nOver half a dozen firms, including BlackRock and Fidelity, have sought spot Ethereum ETF approval, but the SEC’s pace, coupled with potential rule rejections, could extend the process into 2026.\n\nTD Cowen’s prediction of a delayed U.S. spot Ethereum ETF approval, influenced by political dynamics and Gensler’s cautious crypto stance, reflects ongoing uncertainties in the regulatory landscape despite optimistic projections."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyLXByaWNlLXdpbGwtY3Jhc2gtaGFyZC1iZWxvdy0xMDAwLXNheXMtdGhpcy1wb3B1bGFyLWFuYWx5c3Qv0gFaaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXItcHJpY2Utd2lsbC1jcmFzaC1oYXJkLWJlbG93LTEwMDAtc2F5cy10aGlzLXBvcHVsYXItYW5hbHlzdC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 19:10:51 GMT",
        "title": "Ether Price Will Crash Hard Below $1,000, Says This Popular Analyst - ZyCrypto",
        "content": "Advertisement\n\nBenjamin Cowen, a popular cryptocurrency trader-cum-analyst, has suggested that the price of Ethereum’s native token ether (ETH) could experience further declines before finding a local bottom. Cowen expressed the possibility of ETH nosediving below the $1,000 level, attributing the potential dip to factors related to the asset’s historical patterns.\n\nWill ETH Really Fall Below $1K?\n\nInvestors and traders have been closely watching ether’s price in recent weeks since the approval of spot Bitcoin exchange-traded funds (ETFs) in the U.S. The second-largest crypto set a new year-to-date high of $2,720 after the approvals, but it has since turned soft alongside the broader crypto market.\n\nFrom a technical perspective, analyst Benjamin Cowen has suggested that ETH historically “tests the integrity” of its major cycle lows roughly two times before proceeding into a new bullish phase. Cowen specifically spotlights 2015, 2016, and 2020 and confirms that another low in 2022 is yet to be revisited.\n\nAccording to the trader, ether will first break down in its Bitcoin confluence (ETH/BTC) in the coming months before ETH/USD follows.\n\n“So at some point, I think Ethereum will test the integrity of that low, back down below $1,000. But, history would also suggest that it won’t test it until after ETH/BTC breaks down. And history also suggests that ETH/BTC probably won’t break down in January because normally January is a good month for Ethereum,” Bowen told his nearly 800,000 YouTube subscribers.\n\nAdvertisement\n\nHowever, the analyst noted that it could take some time before this scenario plays out amid increased speculation among investors about the possible introduction of a spot Ether ETF and Bitcoin’s April halving event. According to experts, now that there is clarity after the Bitcoin ETFs, spot ETH ETFs may come sooner than expected.\n\nSpot ETH ETFs Aren’t Far Away\n\nAs ZyCrypto previously covered, multiple companies including BlackRock, Fidelity, Grayscale, and Cathie Wood’s ARK Invest are seeking regulatory approval to set up spot ether exchange-traded funds. However, the SEC recently delayed the verdict for these investment products.\n\nAlthough such delays could subsequently delay a parabolic ETH rally, the SEC’s approval ultimately will propel the price of the asset to new heights. With spot ETH ETFs, U.S. investors will access a regulated, tax-advantaged way of gaining exposure to the industry’s second-biggest crypto.\n\nBesides the potential ETF, technical developments within the Ethereum ecosystem could also propel the ETH price. Notably, ETH devs recently set the timeline for the final Dencun testnet upgrades. Dencun will be run through the Sepolia test network on January 30, and on the Holesky testnet on Feb.7. This puts the upgrade on track to hit the mainnet in late February or early March."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy50aGVwb3J0dWdhbG5ld3MuY29tL25ld3MvMjAyNC0wMS0yOS9pcy1ldGhlcmV1bS1ldGgtMTBrLXN0aWxsLXBvc3NpYmxlLW9wdGlvbjJ0cmFkZS1vMnQtY291bGQtYmVhdC1ldGgtcm9pLWluLTIwMjQvODU0ODfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Is Ethereum (ETH) $10K Still Possible?, Option2Trade (O2T) Could Beat ETH ROI in 2024 - The Portugal News",
        "content": "Ethereum (ETH) and Option2Trade are two prominent players in the cryptocurrency market, with Ethereum's rise to $10,000 generating excitement. Option2Trade (O2T) offers a competitive alternative with its disruptive trading platform and innovative features. Investors should consider Ethereum (ETH)’s price factors and consider Option2Trade (O2T)’s unique advantages.\n\nBy Advertiser, in Crypto · 29 Jan 2024, 13:00 · 0 Comments\n\nDiversifying investment portfolios and exploring alternative options can lead to new opportunities and higher returns in the ever-changing finance world.\n\n\n\n\n\nEthereum's Journey to $10,000\n\nEthereum (ETH), the decentralized open-source blockchain system, has garnered significant attention and adoption since its inception. With its own cryptocurrency, Ether (ETH), Ethereum (ETH) has become a platform for numerous other cryptocurrencies and the execution of decentralized smart contracts. The question on many investors' minds is whether Ethereum (ETH) can reach the monumental price point of $10,000.\n\nEthereum's price is predicted to reach $10,000 due to the growth and acceptance of cryptocurrencies, its potential to become a global decentralized application platform, and its scarcity. With a total supply of 120,181,248 ETH, Ethereum's scarcity creates a sense of rarity and exclusivity, potentially pushing its price higher. Network upgrades, such as the London hard fork, enhance scalability, security, and functionality, making it a more robust platform. However, potential challenges include market volatility, regulatory uncertainties, competition from other blockchain platforms, and scalability issues.\n\n\n\n\n\nOption2Trade (O2T): A Promising Alternative\n\nAs investors evaluate the potential of Ethereum, another player is emerging in the trading and investment space: Option2Trade (O2T). Option2Trade (O2T) is a licensed global trading platform that aims to disrupt traditional exchange trading by introducing Web3 social trading and AI trading algorithms. Let's explore the unique features and advantages that make Option2Trade (O2T) a competitive alternative to Ethereum.\n\nOption2Trade's Web3 social trading feature allows traders to connect with a global community, promoting knowledge sharing and learning from experienced traders. The platform also uses AI trading algorithms to provide traders with advanced insights into market trends and data, enabling them to make informed decisions in the fast-paced financial market. This enables traders to succeed in the market.\n\n\n\n\n\nOption2Trade: Outperforming ETH ROI in 2024\n\nWhile Ethereum (ETH) has proven to be a lucrative investment, Option2Trade (O2T) presents a compelling opportunity for investors looking to maximize their ROI. With its innovative features and commitment to revolutionizing the trading landscape, Option2Trade (O2T) has the potential to outperform Ethereum (ETH) in terms of return on investment.\n\nOption2Trade's O2T token, available for $0.007 per token, is designed to enhance user engagement, democratize platform governance, and provide unique opportunities for traders and gaming enthusiasts. Its integration into the Option2Trade (O2T) ecosystem and beyond makes it a valuable asset in the evolving world of cryptocurrency and blockchain-based gaming.\n\n\n\n\n\nConclusion\n\nEthereum (ETH) and Option2Trade (O2T) are leading in the cryptocurrency and blockchain technology world. Ethereum (ETH) is expected to reach $10,000, while Option2Trade (O2T) is a disruptive force in trading and investment. This article explores Ethereum's potential and highlights Option2Trade (O2T) as a potential investment to outperform ETH ROI in 2024.\n\nFor more information on the Option2Trade (O2T) Presale:\n\n\n\n\n\nVisit Option2Trade\n\n\n\n\n\nJoin and become a community member:\n\n\n\n\n\nhttps://t.me/O2TOfficial\n\nhttps://twitter.com/Option2Trade\n\n\n\n"
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXN0YWtlZC1oaXRzLWFsbC10aW1lLWhpZ2gtZHdpbmRsaW5nLWV4Y2hhbmdlLXN1cHBseS1jb3VsZC1wdXNoLWV0aC1wcmljZS1oaWdoZXItMjAyNDAxMjkxMzI00gGYAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXN0YWtlZC1oaXRzLWFsbC10aW1lLWhpZ2gtZHdpbmRsaW5nLWV4Y2hhbmdlLXN1cHBseS1jb3VsZC1wdXNoLWV0aC1wcmljZS1oaWdoZXItMjAyNDAxMjkxMzI0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum staked hits all-time high, dwindling exchange supply could push ETH price higher - FXStreet",
        "content": "Share:\n\nEthereum staked in the deposit contract climbed to 29.37 million, hitting a new all-time high on January 28.\n\nEthereum in circulation is on a decline with dwindling exchange supply and rising volume of staked Ether.\n\nETH price observed an 8% decline in the past week.\n\nEthereum’s supply in circulation is on a decline as ETH staked in the deposit contract rises and on exchanges drops. Traders are likely holding on to their Ether, contributing to likely decrease in selling pressure.\n\nETH price could recover from its slump after 8% weekly losses for holders.\n\nAlso read: Bitcoin bull run is likely sustainable, BTC balance on exchanges declines by over 1 million since 2020\n\nA quarter of Ethereum’s supply is staked\n\nAccording to CryptoQuant data, staked Ethereum supply climbed to 29.37 million on January 28. This marks a new all-time high in terms of staked Ether supply since the launch of the deposit contract.\n\n\n\nEthereum: Total Value Staked. Source: CryptoQuant\n\nLeon Waidmann, editor and analyst at BTCEcho, notes that a quarter of Ethereum’s supply is staked. The analyst comments on how this metric supports the bullish potential of ETH. The analyst identified that Ethereum’s dwindling supply, strong base of holders and increasing trust could fuel the altcoin’s gains in the ongoing cycle.\n\nA QUARTER of all #Ethereum is now STAKED!\n\n\n\nThat's not just a number - it's a MASSIVE vote of confidence in the long-term potential of #ETH!\n\n\n\nWhy's it bullish?\n\n\n\nIt means:\n\nLess supply on the market\n\nStrong HODLer base\n\nGrowing trust in #ETH's ecosystem pic.twitter.com/VpanirslUh — Leon Waidmann | On-Chain Insights (@LeonWaidmann) January 29, 2024\n\nAccording to Santiment data, the supply on exchanges has nosedived to 10.32 million, close to its six-month low. Typically, a decrease in exchange supply is equated with reduced selling pressure on the asset and room for price gains.\n\nEthereum supply on exchanges. Sources: Santiment\n\nNetwork growth, another on-chain metric, shows bullish divergence. While ETH price dropped between January 16 and 29, network growth has increased, as seen in the chart below. The bullish divergence supports a bullish thesis for Ethereum price.\n\nEthereum network growth. Source: Santiment\n\nHistorically, January to May have been the best months for Ethereum in terms of returns. The altcoin has observed double-digit gains in these months, on average. If history repeats itself, combined with bullish on-chain metrics, Ethereum price could recover from its recent slump.\n\nEthereum monthly returns. Source: DaanCryptoTrader’s tweet on X\n\nAt the time of writing, ETH price is $2,255 on Binance."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMjkvc29sYW5hLXRyYWRpbmctYWdncmVnYXRvci1qdXBpdGVyLXNlZXMtdHJhZGluZy12b2x1bWVzLWp1bXAtYWhlYWQtb2YtanVwLWlzc3VhbmNlL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMjkvc29sYW5hLXRyYWRpbmctYWdncmVnYXRvci1qdXBpdGVyLXNlZXMtdHJhZGluZy12b2x1bWVzLWp1bXAtYWhlYWQtb2YtanVwLWlzc3VhbmNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Solana Trading Aggregator Jupiter Sees Trading Volumes Jump Ahead of JUP Issuance - CoinDesk",
        "content": "Traders expect the tokens to boost activity on Solana, just as a Jito airdrop preceded a meme-coin frenzy on the blockchain in December. The increased demand contributed to Solana’s SOL prices nearly doubling in that month, even leading Solana’s flagship Saga phone to announce a second device on the renewed hype."
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL3JhamF3YXN0aGk4MTE1Lm1lZGl1bS5jb20vaG93LWljcC1zdGVhbHMtdGhlLXNwb3RsaWdodC1mcm9tLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWEtYmlnLWlubm92YXRpb24taW4tYmxvY2tjaGFpbi1lMzE5YmNhNmFjN2E_c291cmNlPXJzcy0tLS0tLWFydGlmaWNpYWxfaW50ZWxsaWdlbmNlLTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "How ICP steals the spotlight from Bitcoin and Ethereum: A Big Innovation in Blockchain. - Medium",
        "content": "How ICP steals the spotlight from Bitcoin and Ethereum: A Big Innovation in Blockchain. Raj Awasthi · Follow 3 min read · Jan 30, 2024 -- Listen Share\n\nSince we have introduced blockchain technology, we have explored what Bitcoin and Ethereum are. Now we have another blockchain product (ICP) that surely takes charge of its unlimited possibilities.\n\nIn the Bitcoin ecosystem, the objective was to develop a decentralized digital currency that facilitates security and immutability. Apart from this, the Ethereum ecosystem was more like a decentralized platform for the installation of dApps (decentralized applications), focusing on smart contracts and programmability.\n\nIn 2021, the ICP (the internet computer) entered the blockchain industry as the third invention of the blockchain that brought the concept of infinite blockchain and redefined the development of everything.\n\nPhoto by Pierre Borthiry - Peiobty on Unsplash\n\nIn this article, we’re going to take a look at how ICP transforms the outlook of the Bitcoin and Ethereum ecosystems.\n\nHow does ICP affect the Bitcoin and Ethereum ecosystems?\n\nIntroducing Decentralized Identity (DID):\n\nWith the inclusion of a decentralized identity, it's now a much more secure approach to storing the data. Unlike traditional protocols, which have very few ways to provide identity and authentication,\n\nThis innovation provides the benefit of an extra identity layer to the users of Bitcoin and Ethereum for the sake of reducing fraud.\n\nSignificant evolution of smart contracts:\n\nAs the blockchain landscape is evolving, there is an important advancement in smart contracts. In ICP, canister smart contracts provide a reliable and secure alternative to Ethereum’s smart contracts.\n\nWith the advancement of smart canisters, it may be beneficial for developers who want to create innovative applications on ICP that interact with Bitcoin and Ethereum.\n\nEnabling remarkable interoperability:\n\nNot only Bitcoin integration but also ICP bridges the gap with Ethereum and fosters a seamless collaboration between the two ecosystems. This eliminates the need for bridges and achieves full decentralization.\n\nThis direct interface creates unparalleled opportunities for frictionless interactions between ICP and the Bitcoin blockchain, opening up new routes for decentralized applications.\n\nIncluding scaling capabilities and cost efficiency:\n\nUnlike Bitcoin and Ethereum, IPC comes with infinite scaling capabilities, as there are no limitations on transactions per second (TPS), which is 7 for Bitcoin and 15-20 for Ethereum. It's very important to have such an amazing scaling capacity, as it’s very important for the future growth of ICP.\n\nThe cost efficiency of storing 1GB of data on ICP is approximately $5 per year, which is around $350,000,000 for Ethereum. This cost-effectiveness is one of the biggest reasons for the inclination towards ICP.\n\nSeamless integration with Bitcoin and Ethereum:\n\nThe Internet Computer (ICP) is altering the decentralized environment with its distinct set of features and capabilities. Through direct integration with Bitcoin, smooth interaction with Ethereum, and the ability to offer interactive web content directly to consumers, ICP envisions a future in which blockchain technology fulfills its full potential. Whether you're a consumer looking for a more accessible and user-friendly blockchain experience or an investor looking for game-changing companies, ICP provides an attractive opportunity to investigate the possibilities of decentralized innovation. Embrace the power of the Internet and start on the road toward a decentralized future.\n\nFinal Thoughts:\n\nThe third invention of blockchain technology holds an amazing future for integrating with other blockchain platforms like Bitcoin and Ethereum. ICP takes an important step towards improving scalability, security, and, of course, transparency. With its optimum utilization, now we can build everything differently. As we all know, it's the era of the digital revolution, and blockchain is not an exception.\n\nHowever, it's also important to understand that ICP is still in the process of development, and with time, it will pave the way to building a whole different world along with proper governance of it.\n\nSo there you have it. If you have any suggestions for this post, feel free to join the discussion.\n\nThis is Raj Awasthi.\n\nSigning off!"
    },
    {
        "id": 99,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdGhlbWVya2xlLmNvbS9wdXNoZC1wdXNoZC1zdGFnZS00LWRyYXdzLWludmVzdG1lbnQtZnJvbS1iaWctYml0Y29pbi1jYXNoLWJjaC1ldGhlcmV1bS1ldGgtaG9sZGVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Pushd (PUSHD) stage 4 draws investment from big Bitcoin Cash (BCH) & Ethereum (ETH) holders - The Merkle Hash",
        "content": "About The Author\n\nNull Transaction PR is a cryptocurrency marketing group responsible for article distribution across a myriad of news sites. If you're looking to advertise with us, contact us by email at [email protected] or visit our website."
    }
]