[
    {
        "id": 6,
        "title": "Ethereum Spot ETFs Could Be Next, According to Bloomberg Analyst - Yahoo Finance",
        "summary": "  The article discusses the potential approval of spot Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) in 2024. According to Bloomberg ETF analyst Eric Balchunas, there is a 70% chance that spot Ether ETFs will be approved by May, the month the SEC must make a final decision for several applications. Balchunas believes that spot Ether ETFs are likely to be approved due to the close tie between Ether and Bitcoin spot markets. Several major asset managers, including BlackRock, VanEck, ARK Invest, and 21Shares, have filed applications for spot Ether ETFs. The SEC must make decisions on these applications by various dates ranging from May 23 to August 7. The article also mentions that Ethereum (ETH) has gained 8.5% in the past 24 hours and 15% in the past week, potentially due to investor speculation on the potential of a spot Ether ETF approval."
    },
    {
        "id": 11,
        "title": "Ethereum Whale Snaps up 4,677 ETH in Bold Bet: Details - U.Today",
        "summary": "  A large cryptocurrency holder, or \"whale,\" has purchased 4,677 Ethereum (ETH), valued at around $11 million, according to data from Lookonchain. This purchase suggests a bullish bet on the Ethereum price, as the whale appears to be bearish on Bitcoin (BTC) and expects the ETH price to rise. The move comes as Ethereum is outperforming Bitcoin in recent days, with ETH up 5.47% in the past 24 hours compared to BTC's 2.11% decline. However, some analysts, such as Matthew Hyland, expect the ETH price to continue to rise, while others, like Peter Brandt, remain bearish on the asset. It is important to note that past performance does not guarantee future results, and investors should conduct their own research and consult with financial experts before making any investment decisions."
    },
    {
        "id": 15,
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "summary": "  The article discusses the recent surge in the value of native tokens of Ethereum-based applications, including Lido DAO, Rocket Pool, and Arbitrum, ahead of the potential approval of an Ether exchange-traded fund (ETF) in the United States. According to CoinMarketCap, these tokens have seen significant gains, with Lido DAO leading the pack with a 16.1% increase in value. The article attributes this surge to trader optimism surrounding the potential approval of an Ether ETF, which may have its way paved by the approval of a Bitcoin ETF. The article also mentions that Stacks, Injective, and Internet Protocol are among the other top gainers in the crypto space. The article concludes by noting that investors are making big moves in the crypto space in response to significant volatility this week due to ETF updates."
    },
    {
        "id": 18,
        "title": "Ethereum Price Technical Setup Suggests Fresh Surge Above $2,400 - NewsBTC",
        "summary": "  The article discusses the current technical setup of the Ethereum (ETH) price, suggesting a potential surge above $2,400. Key points include:\n\n* ETH price climbed higher above $2,350 resistance, outpacing Bitcoin.\n* The pair could attempt a clear move above $2,400 resistance.\n* A fresh surge could face resistance near $2,380, with the next major resistance at $2,400.\n* A clear move above $2,400 could send ETH toward $2,440, and potentially higher to $2,550 and $2,720.\n* If ETH fails to clear $2,400 resistance, it could start a fresh decline, with initial support near $2,320 and further losses potentially extending to $2,240 and $2,150.\n* Technical indicators, such as MACD and RSI, are gaining momentum in the bullish zone.\n\nOverall, the article suggests that the ETH price is in a favorable technical setup for a potential increase"
    },
    {
        "id": 21,
        "title": "Ethereum's price surges despite the market-wide chaos - crypto.news",
        "summary": "  The article discusses the recent price surge of Ethereum (ETH) despite the bearish sentiment in the broader cryptocurrency market. ETH gained 3% in the past 24 hours and reached a high of $2,400, with its market capitalization holding strong above $286 billion. Whale activity consisting of transactions worth at least $100,000 increased by 7.9% over the past day, with 6,242 unique transactions observed. The Relative Strength Index (RSI) of ETH is currently around 59, indicating that the asset is in a good position for further potential rallies. However, if the RSI stays below 60, Ethereum could face potential price drops. The total open interest of ETH also increased by 4% over the past 24 hours, reaching $3.90 billion."
    },
    {
        "id": 23,
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "summary": "  The article discusses the potential for an increase in the price of Ethereum (ETH) due to whale accumulation and the potential approval of a spot Bitcoin ETF by the US Securities and Exchange Commission (SEC). Despite the lack of bullish momentum in ETH compared to Bitcoin, the article suggests that the accumulation of nearly $1 billion worth of ETH by whales could indicate a potential breakout and 10% rise in the ETH price. The article also highlights the dynamic support provided by an ascending trendline over the past two months, which could prevent a major correction in the asset. The Bollinger Band indicator and the Average Directional Index (ADX) are also mentioned as indicators of strengthening bullish momentum. Finally, the article includes related articles on the topic of ETH price prediction."
    },
    {
        "id": 27,
        "title": "Ready For Liftoff: Ethereum Eyes Breakthrough As Analyst Signals Upward Trend - NewsBTC",
        "summary": "  The article discusses the potential for Ethereum (ETH) to break out and experience a significant increase in value, based on the analysis of a well-known crypto analyst, Michaël van de Poppe. Van de Poppe believes that Ethereum is approaching a critical level of support and could be on the verge of a significant breakout if a spot Bitcoin exchange-traded fund (ETF) is approved in the US. He suggests that a bullish weekly divergence could occur, leading to a rotation of funds into Ethereum and a sharp increase in price.\n\nOther analysts, such as Crypto Tony, share a similar bullish outlook on Ethereum, with a focus on the importance of maintaining above a key level of $2,130. If Ethereum can push above this level and reach the $2,500 mark, it could significantly bolster its bullish momentum.\n\nThe article highlights the potential approval of a spot Bitcoin ETF in the US as a critical factor in the bullish outlook on Ethereum. The market is on edge, with major players submitting updated"
    },
    {
        "id": 28,
        "title": "Ethereum Price Forecast – Ethereum Show Signs of Strength on Wednesday - FX Empire",
        "summary": "  The article from FX Empire discusses the recent price movements of Ethereum and provides a price forecast for the cryptocurrency. According to the article, Ethereum showed signs of strength on Wednesday, with its price increasing by 3%. The article attributes this price increase to the growing interest in decentralized finance (DeFi) and the increasing adoption of Ethereum-based stablecoins.\n\nThe article also provides a price forecast for Ethereum, suggesting that the cryptocurrency could reach $200 by the end of the year. The forecast is based on the assumption that the current trend of growth in DeFi and stablecoin adoption will continue, leading to increased demand for Ethereum and higher prices.\n\nHowever, the article also notes that the cryptocurrency market is highly volatile and subject to significant fluctuations, and therefore, the price forecast should be taken with caution. The article advises readers to perform their own research and due diligence before making any investment decisions.\n\nIn summary, the article from FX Empire provides an overview of the current price movements and forecast for Ethereum, highlighting"
    },
    {
        "id": 29,
        "title": "Ethereum vs Bitcoin: Will ETH Price outperform BTC After ETF Approval? - crypto.news",
        "summary": "  The article discusses the potential for Ethereum (ETH) to outperform Bitcoin (BTC) after the approval of a Bitcoin ETF. The article highlights that ETH has maintained a steady uptrend, with a 10% increase in the past week, while BTC has experienced volatility after a false ETF approval from the U.S. Securities and Exchange Commission (SEC). The article also notes that derivative market metrics suggest increased demand for long positions in the ETH derivatives market, which could reflect a more optimistic sentiment. Specifically, the funding rate for ETH is currently higher than that of BTC, and the open interest in ETH has grown faster than that of BTC. The article concludes that if the SEC issues a timely positive verdict on Bitcoin Spot ETFs, ETH could reach $3,000, but if the holders of the $2,475 range break-even point book profits, the price could drop to $2,200."
    },
    {
        "id": 33,
        "title": "Spot Ethereum ETFs now have a straight shot for approval — Analysts - Cointelegraph",
        "summary": "  The article discusses the potential approval of spot Ethereum (ETH) exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC). Following the approval of 11 spot Bitcoin (BTC) ETFs on January 10, analysts are optimistic about the chances of spot ETH ETFs being approved in 2024, with some predicting a 70% chance of approval by May.\n\nEric Balchunas, an ETF analyst at Bloomberg, believes that the SEC's approval of spot Bitcoin ETFs sets a precedent for the approval of spot Ether ETFs. He also notes that the price of Ether spiked around 3% after the approvals, reaching over $2500, and is currently trading at $2533, up 7% in the past 24 hours.\n\nOther analysts, such as Joe Carlasare, a digital asset lawyer, believe that spot Ether ETFs will be approved but will take longer than expected to launch. Carlasare"
    },
    {
        "id": 36,
        "title": "Ethereum's changing narrative, spot ETF and altcoin beta hype back ETH rally - Cointelegraph",
        "summary": "  The article discusses the recent price surge of Ethereum (ETH) and the potential reasons behind it. After breaking the resistance at $2,400 for the first time since May 2022, ETH price rose sharply, with a bullish bias seen in the minutes following an incorrect tweet from the SEC regarding the approval of a spot Bitcoin (BTC) ETF. The article attributes the price increase to the possibility of an Ethereum exchange-traded fund (ETF) approval, which could provide professional investors in the US with indirect exposure to ETH. The article also mentions the growth of layer 2 networks such as Mantle and Optimism, which are built on the Ethereum network but operate as independent blockchains, allowing for faster and cheaper transactions. Additionally, the article highlights the liquidation of short positions worth $31.7 million in ETH over the last 24 hours, with the tally still increasing at the time of writing. Finally, the article notes that the SEC is expected to make its decision on all spot Bitcoin ETF applications on January 10, with market participants confident of"
    },
    {
        "id": 44,
        "title": "After the Bitcoin ETF Fakeout: Ethereum ETH Price Soars - Blockonomi",
        "summary": "  The article discusses the recent surge in the price of Ether (ETH), the second-largest cryptocurrency by market capitalization, which rallied past $2,400 this week. The price increase is attributed to speculation of an Ethereum exchange-traded fund (ETF) approval, which could bring in fresh institutional capital from pension funds, endowments, and traditional finance players. BlackRock, the world's largest asset manager, has filed paperwork with the U.S. Securities and Exchange Commission (SEC) for an Ethereum Trust ETF, adding credibility to hopes for an Ether product.\n\nThe article highlights that Ether's bullish chart signals and strong fundamentals, including on-chain data, have reinforced the positive outlook for the cryptocurrency. The number of large \"whale\" transactions on Ethereum has increased, suggesting that deep-pocketed investors still have an appetite to accumulate more ETH at these levels.\n\nDespite the wider crypto market reeling from fake news of a Bitcoin ETF approval, E"
    },
    {
        "id": 46,
        "title": "Arbitrum Dominates with Nearly 50% of Ethereum Layer 2 Total Value Locked - Cryptonews",
        "summary": "  Arbitrum, an Ethereum-based layer 2 network, has shown significant strength in the market, with a near 50% market share of total value locked (TVL) among layer 2 networks built on top of Ethereum. Its native token, ARB, has outperformed other smart contract tokens, including Optimism’s OP token, Solana’s SOL, and BNB, with a 75% increase in value over the past 30 days. Arbitrum’s TVL has consistently increased since October last year, rising from $1.66 billion to the current value of $2.51 billion, according to DefiLlama. The upcoming Ethereum Dencun upgrade is expected to reduce rollup transaction costs, benefiting layer 2 solutions like Arbitrum. On the charts, ARB has formed a potential bull flag formation, indicating a continuation pattern with price expected to resume its previous bullish trend once it breaks out of the pattern. As of Wednesday, ARB traded at $1.95, up 11.7% in the past 24 hours and 3"
    },
    {
        "id": 56,
        "title": "Bitcoin Dips, Then Bounces After ETF Approval While Ethereum Tops $2,500 - Decrypt",
        "summary": "  The article discusses the recent approval of a Bitcoin exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC), and how the cryptocurrency market has reacted to the news. The price of Bitcoin (BTC) has been choppy since the approval, but is currently trading around $45,800. Ethereum (ETH) has seen a significant increase, reaching over $2,500 for the first time since May 2022, and is currently trading at around $2,550, up 11% over the past day. Other scaling network tokens, such as Arbitrum (ARB) and Optimism (OP), have also seen gains, with Arbitrum setting an all-time high price after the Bitcoin ETF approval. Overall, the cryptocurrency market is up about 2% over the past 24 hours."
    },
    {
        "id": 61,
        "title": "Can Ethereum Dust Itself Off? - Real Vision",
        "summary": "  The article discusses the current state of Ethereum, a popular cryptocurrency, and its potential for recovery. The author suggests that Ethereum may be able to \"dust itself off\" and recover from recent price drops, but notes that this will require significant improvements to the platform's scalability and usability. The article highlights the ongoing efforts of the Ethereum community to address these issues, including the development of new technologies and the implementation of new governance structures. While the author acknowledges that the road to recovery will be challenging, they express optimism about the potential for Ethereum to emerge stronger and more resilient in the long term."
    },
    {
        "id": 68,
        "title": "Ethereum’s Bullish Breakout: Analysts Predict Surge To $3,500 – Here’s Why - NewsBTC",
        "summary": "  The article discusses the potential for Ethereum (ETH) to surge to $3,500 based on technical analysis and market sentiment. Two analysts, World Of Charts and Skew, have identified a bullish pennant pattern in Ethereum's chart, which could indicate an upward trend continuation. Additionally, the article mentions that Ethereum has shown resilience amid recent market turbulence and could receive an additional boost from the potential approval of a Spot BTC ETF. The analysts cited in the article, including Michaël van de Poppe, believe that Ethereum's current positioning near last year's low could be crucial in absorbing liquidity and fueling a bullish breakout. However, it is important to note that investing in cryptocurrencies carries risks and investors should conduct their own research before making any investment decisions."
    },
    {
        "id": 70,
        "title": "Ethereum (ETH) Primed To Collapse Against Bitcoin (BTC) to Multi-Year Lows, According to Benjamin Cowen - The Daily Hodl",
        "summary": "  Crypto analyst Benjamin Cowen believes that the Ethereum (ETH) price is likely to collapse against Bitcoin (BTC) and reach multi-year lows. According to Cowen, the ETH/BTC ratio is repeating a historical pattern and may soon lose a key support level. He suggests that the ETH/BTC pair could drop to around 0.037 BTC, then bottom out and trade sideways for a while before potentially starting to trend back up. However, Cowen acknowledges that the pair's higher lows and higher lows in the weekly time frame make it difficult to predict its direction. He notes that the lower highs in the pair could be a concerning sign, but he is unsure of the ultimate outcome.\n\nAt the time of writing, the ETH/BTC pair is trading at 0.049 BTC ($2,298). The article encourages readers to follow The Daily Hodl on Twitter, Facebook, and Telegram for the latest updates and to subscribe to receive email alerts. The disclaimer at the end of the article notes that opinions expressed are not investment advice, and"
    },
    {
        "id": 72,
        "title": "Ether Jumps Over $2.4K as Traders Bet on Possible Ether ETF Next - CoinDesk",
        "summary": "  The price of Ether (ETH) has surged above $2,400 as traders speculate on the possibility of an Ether Exchange-Traded Fund (ETF) being approved. While some believe that the price of Ether could continue to rise in the coming days, others are predicting that select tokens within the Ethereum ecosystem, such as LIDO, ENS, and MKR, could see sharp gains. According to Jack Tan, co-founder of crypto exchange WOO X, these tokens are likely to attract attention away from Bitcoin as traders prepare for the potential approval of an ETH ETF."
    },
    {
        "id": 76,
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "summary": "  The article discusses the potential price forecast of Ethereum Classic (ETC) based on a double-top reversal pattern observed on the 4-hour chart. The pattern suggests a possible 21% correction in the price of ETC, but the article notes that the pattern may be invalidated by bullish market momentum and broader market cues. The article also mentions the anticipated approval of spot Bitcoin ETFs, which could have a bullish impact on altcoins like ETC.\n\nThe article highlights that ETC is bouncing back from a crucial support level of $19.33, which could indicate a potential trend reversal. However, the article notes that the double-top pattern has not been successfully surpassed, which could suggest a potential decline in the price of ETC.\n\nThe article also provides technical analysis indicators such as the Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) to support the potential price forecast. The RSI is still in the bearish zone, while the MACD is showing a bullish crossover, which"
    },
    {
        "id": 81,
        "title": "Ethereum Price & Bitcoin Minetrix Rise Despite Other Altcoins Falling - CryptoPotato",
        "summary": "  The article discusses the current state of the altcoin market, where most coins are experiencing a downturn, while Ethereum (ETH) and Bitcoin Minetrix (BTCMTX) are bucking the trend and showing resilience. ETH has posted two bullish daily closes in a row and is potentially poised to break out of its current range. The recent bounce from the 50-day exponential moving average (EMA) on the daily time frame suggests that the token could make a run back to December’s yearly high in the coming days. Bitcoin Minetrix, on the other hand, is in its presale phase and has just passed the $8 million funding milestone. The project's groundbreaking Stake-to-Mine feature has gained significant traction, with over 16,500 people now following the project on Twitter. However, the altcoin market has been impacted by confusion around the launch of a spot Bitcoin ETF in the US, which has led to a sell-off in major coins and tokens."
    },
    {
        "id": 84,
        "title": "U.S. Mike Collins Discloses $110,000 Ethereum Investment - Crypto Times",
        "summary": "  U.S. Representative Mike Collins has disclosed an $110,000 investment in Ethereum in his recent financial reports to Congress. Collins made two Ethereum purchases in early 2024, totaling $65,000, and previously declared an investment of up to $45,000 in Ether in 2023. His recent transactions include purchasing $15,000 worth of Ethereum on January 3 and an additional $50,000 on January 8. This investment aligns with an 11% rise in Ethereum's market value over the past week, which may be linked to expectations about the U.S. SEC's decision on a Bitcoin ETF."
    },
    {
        "id": 87,
        "title": "Ethereum Price Prediction as Inflows Surge to $29 Million – Can ETH Hit $5,000 This Month? - Cryptonews",
        "summary": "  The article discusses the potential for the Ethereum price to reach $5,000 this month, driven by inflows of $29 million into ETH funds and the growing popularity of the coin among investors. The article highlights Ethereum's strong fundamentals, including its dominance in the cryptocurrency market and its potential to benefit from the approval of Bitcoin ETFs. The article also mentions other high-potential altcoins, such as Bitcoin ETF Token, which has raised over $5 million in its presale and has a deflationary tokenomics that could make it a highly sought-after asset.\n\nThe article emphasizes that crypto is a high-risk asset class and that investors should be aware of the potential for losses. It is important to conduct thorough research and due diligence before investing in any cryptocurrency.\n\nOverall, the article provides a positive outlook on the Ethereum price and suggests that it could continue to rise in value in the coming months, driven by increasing investor interest and the growing popularity of the coin."
    },
    {
        "id": 90,
        "title": "Ethereum Co-Founder Joseph Lubin Says ‘Giant Amount of Money’ on Sidelines Waiting for Crypto ETFs - The Daily Hodl",
        "summary": "  In an interview with CNBC, Joseph Lubin, co-founder of Ethereum and CEO of Consensys, discussed the large amount of sidelined capital waiting for the approval of crypto exchange-traded funds (ETFs). Lubin stated that there are hundreds of billions of dollars managed by professionals in the traditional finance industry, including registered investment advisors (RIAs), that are waiting for easier and regulated exposure to digital assets through an ETF. He believes that Ethereum is the most mature ecosystem and is likely to be the next best candidate for a spot ETF approval from the SEC, after Bitcoin. However, Lubin noted that the SEC does not directly reveal its plans or intentions to the Ethereum Foundation. The article concludes by stating that investors should do their own due diligence before making any high-risk investments in Bitcoin, cryptocurrency, or digital assets, and that The Daily Hodl does not provide investment advice."
    },
    {
        "id": 92,
        "title": "10 Ethereum Apps to Watch in 2024 - Part 2 - Reviews - Altcoin Buzz",
        "summary": "  The article highlights 10 Ethereum apps that are expected to be popular in 2024, each serving a different purpose. The apps are:\n\n1. Daylight - an API that provides recommendations for NFTs, wallets, and tools based on user transaction data.\n2. Dookey Dash - an NFT game developed by Yuga Labs, the creators of Bored Ape Yacht Club and CryptoPunks.\n3. Unlonely - a live streaming platform that allows users to participate in prediction markets and watch live streams with others.\n4. Hypersub - an NFT subscription platform that allows creators to set an expiration date for their NFTs.\n5. Spinamp - a music streaming platform that plays good music and has a great app, with a pipeline of artists launching their work.\n\nThe article concludes by emphasizing that it's important to try out an app after watching it to contribute to the Web 3 ecosystem and find one that suits your needs. It's important to note that the information provided is for educational and entertainment purposes only, and should not be taken as financial advice"
    },
    {
        "id": 93,
        "title": "US lawmaker reports ETH purchases up to $65K in 2024 - Cointelegraph",
        "summary": "  US Representative Mike Collins has disclosed purchasing up to $65,000 worth of Ether (ETH) in 2024, according to financial disclosure documents filed with the US House of Representatives. Collins has been trading ETH since at least 2023, with total purchases up to $110,000. The disclosure comes as ETH's price surged over 11% in the past week, with some experts speculating that the token could rally in response to the potential approval of a spot Bitcoin (BTC) exchange-traded fund. The disclosure also comes amid a potential government shutdown on January 19 if Congress fails to pass a spending bill. Meanwhile, Republican Party candidates for the 2024 US Presidential Election will face off in Iowa on January 10 for the first debate of the election season, with pro-crypto candidate Vivek Ramaswamy not appearing on the debate stage."
    },
    {
        "id": 95,
        "title": "Valkyrie CIO Says Market May See Ripple, Ethereum ETFs Next - Cryptonews",
        "summary": "  Steven McClurg, the Chief Investment Officer of Valkyrie Funds, believes that Ripple and Ethereum spot exchange-traded funds (ETFs) may be approved by the US Securities and Exchange Commission (SEC) in the near future. McClurg bases this belief on Grayscale's recent addition of XRP to their publicly traded fund, which indicates growing interest in the space. Additionally, McClurg predicts that the SEC will approve spot Bitcoin ETFs on Wednesday, with several issuers already revising their fee structures or offering temporary waivers in an effort to stand out and secure approval. However, earlier in the day, the SEC's X account was hacked and a false tweet suggesting the approval of a spot Bitcoin ETF was posted, causing a brief but notable dip in the cryptocurrency market."
    },
    {
        "id": 96,
        "title": "Fake ETF Approval: Ethereum OI Soars As Fake ETF Approval Sends Bitcoin Futures Diving - CoinGape",
        "summary": "  The article discusses the impact of a fake approval post from the SEC on the cryptocurrency market. A post on the SEC's official Twitter handle falsely claimed approval for a Spot Bitcoin ETF, leading to a surge in Bitcoin Futures Open Interest. However, this misinformation was quickly clarified by SEC Chair Gary Gensler, and the market reacted negatively, with Bitcoin Futures Open Interest plummeting by 3.29%. In contrast, Ethereum Futures Open Interest saw a significant surge of 12.08%, reaching $8.05 billion. The article attributes this contrasting performance to a shift in investor sentiment, with Ethereum gaining momentum and attracting renewed interest and investment in the crypto space."
    },
    {
        "id": 99,
        "title": "Experts set a date for Ethereum to reach $10k, are you ready? - Crypto Reporter",
        "summary": "  The article discusses the potential of Ethereum (ETH) to reach $10,000, based on the opinions of crypto analyst Chris Burniske and other experts in the field. Burniske predicts that ETH could reach $10,000 by 2025, driven by its growing adoption and use cases in decentralized applications (DApps), smart contracts, and other areas. The article also introduces Retik Finance (RETIK), a promising DeFi project that is gaining traction in the crypto space.\n\nThe article highlights several factors that could contribute to Ethereum's growth and potential journey to $10,000, including:\n\n1. Smart contracts and DApps: Ethereum's smart contract capabilities are at the heart of its appeal, enabling developers to create decentralized applications that are driving growth and adoption.\n2. Ethereum upgrade: The Ethereum Cancun upgrade, expected in Q1 of 2024, will increase the scalability, security, and efficiency of the Ethereum network, reducing gas fees and optim"
    }
]