[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY3J5cHRvLm5ld3Mvc2VjLWRlbGF5cy1ncmF5c2NhbGUtc3BvdC1ldGhlcmV1bS1ldGYtdG8tbWF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Grayscale spot Ethereum ETF to May - crypto.news",
        "content": "The U.S. Securities and Exchange Commission (SEC) has again delayed issuing a decision on Grayscale’s application to launch a spot Ethereum (ETH) ETF.\n\nAccording to a message on the regulator’s website, the Commission requested public comments on how the regulator should handle Grayscale’s application. The SEC is interested in whether the ETH algorithm – Proof-of-Stake (PoS) and the concentration of a large volume of Ethereum in the hands of several individuals could make the fund vulnerable to fraud and manipulation.\n\nThe next application deadline is in May. The company first applied to launch a spot Ethereum ETF in October 2023. The SEC published its first decision on the application on Dec. 5, 2023. The deadline was January 25, 2024.\n\nIn addition to the application for a spot Ethereum ETF from Grayscale, the Commission previously extended the consideration of applications from Fidelity and BlackRock. The new deadline for the other two applications will be in March.\n\nAt the same time, journalists predict the adoption of spot Ethereum-ETFs by the summer of 2024. This will be preceded by a decision by the CFTC and the SEC to recognize that the second-largest cryptocurrency by capitalization does not comply with a security status.\n\nReporting on the timeline for a potential $ETH ETF approval has turned up a plethora of different takes from ETF issuers, investment management firms and sources close to the @SECGov.\n\n\n\n✨One $BTC Spot ETF issuer with an ETH Spot ETF application says they’re confident the… — Eleanor Terrett (@EleanorTerrett) January 23, 2024\n\nJournalists suggested that such certainty could arise during the trial with Binance. They referred to the previous meeting, noting that DAO tokens can be considered securities.\n\nFollow Us on Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3VsZC1jb3JyZWN0aW9uLTIyNDAv0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvdWxkLWNvcnJlY3Rpb24tMjI0MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Could See Technical Correction But Upsides Might Be Limited - NewsBTC",
        "content": "Ethereum price is attempting a recovery wave above the $2,200 zone. ETH could start a decent increase if it settles above the $2,240 resistance.\n\nEthereum started an upside correction from the $2,165 zone.\n\nThe price is trading below $2,250 and the 100-hourly Simple Moving Average.\n\nThere is a short-term bearish trend line forming with resistance near $2,225 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair might start a decent increase if it clears the $2,240 resistance zone.\n\nEthereum Price Eyes Recovery\n\nEthereum price managed to form a support base above the $2,165 level. ETH seems to be consolidating losses near the $2,200 level and might aim for a recovery wave, like Bitcoin.\n\nThere was a minor upside correction above the $2,200 level, but the bears are still active near the $2,240 resistance zone. There is also a short-term bearish trend line forming with resistance near $2,225 on the hourly chart of ETH/USD.\n\nEthereum is now trading below $2,250 and the 100-hourly Simple Moving Average. On the upside, the first major resistance is near the $2,240 level. It is close to the 23.6% Fib retracement level of the key drop from the $2,480 swing high to the $2,165 low.\n\nThe next major resistance is near the $2,280 or the 100-hourly Simple Moving Average, above which the price might rise and test the 50% Fib retracement level of the key drop from the $2,480 swing high to the $2,165 low. If the bulls push the price above the $2,320 resistance, they could aim for $2,360.\n\nSource: ETHUSD on TradingView.com\n\nA clear move above the $2,360 level might start a decent increase. In the stated case, the price could rise toward the $2,420 level. Any more gains might send the price toward the $2,500 zone.\n\nAnother Failure in ETH?\n\nIf Ethereum fails to clear the $2,240 resistance, it could start another decline. Initial support on the downside is near the $2,200 level.\n\nThe next key support could be the $2,165 zone. A daily close below the $2,165 support might start another major decline. In the stated case, Ether could test the $2,080 support. Any more losses might send the price toward the $2,000 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,165\n\nMajor Resistance Level – $2,240\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9zdHVkeS1zaG93cy1wcmljZS1vZi1ldGhlci1pbmNyZWFzZXMtYmVmb3JlLWVpcHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Could a forthcoming Ethereum upgrade boost Ether's price? A recent study says yes - DLNews",
        "content": "The price of Ether is seen to increase in the weeks before major upgrades.\n\nA small group of contributors holds significant influence over key decisions regarding Ethereum Improvement Proposals.\n\nThe increase in Ether's price is most significant in the weeks before final discussions regarding EIPs.\n\nEthereum’s governance decisions have emerged as an underappreciated influence on prices of Ether.\n\nA recent study by a trio of academics shed light on this relationship, particularly regarding EIPs, or Ethereum Improvement Proposals.\n\nAn Ethereum Improvement Proposal is a formal document suggesting new features or changes to the Ethereum blockchain that serves as a guideline for community consensus.\n\nThe study, focusing on Ethereum’s decision-making process, uncovered a striking trend. In the periods leading up to final discussions of Core EIPs, Ether’s price increased about 18%, and relative to Bitcoin it increased 12%.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nThe research also examined the concentration of power in Ethereum’s governance, and found that a small group of developers and influencers hold significant sway over the EIP process.\n\nThe next major Ethereum upgrade, Dencun, which is expected to reduce the cost of transactions on layer 2s, is on track to launch in late February.\n\nEthereum developers will run through tests for Dencun on the Sepolia and Holesky testnets on January 30 and February 7.\n\nThe authors of the study were Cesare Fracassi and Moazzam Khoja at the University of Texas at Austin, and Fabian Schär at the University of Basel. The paper has yet to go through the academic peer-review process.\n\nJoin the community to get our latest stories and updates\n\nData speaks volumes\n\nThe study analysed Ether’s price trends during the final discussions and approvals of successful Core EIPs, looking at hourly price data from May 2016 to November 2023.\n\nOne of the most important findings was the 18% increase in Ether prices in the weeks preceding the last AllCoreDevs call before a major EIP.\n\nAn AllCoreDevs call is a regular meeting when Ethereum’s core developers discuss and make decisions on EIPs.\n\nThis surge in prices was seen to reflect investors’ evolving expectations about the likelihood of a proposal’s approval, and its potential impact on the token’s value.\n\nTo ensure an accurate analysis, the researchers focused on a specific period of 80 days, split equally before and after these meetings.\n\nEther’s price began to increase, the study found, about 30 days before the crucial discussions.\n\nA clear pattern was also seen when comparing Ether with Bitcoin.\n\nIn the 25 days leading up to the approval of a Core EIP, Ether’s price against Bitcoin typically increased by about 12%, showing that Ether’s price does tend to increase significantly in anticipation of major changes to the Ethereum network.\n\nSuch increases are particularly significant considering the concentrated governance structure where a small group holds substantial influence over key decisions.\n\nFor example, an average of 10 people per client implementation — each client being a different version of software that runs the Ethereum protocol — are responsible for 80% of all software changes.\n\nWhen comparing Ether’s performance with the S&P 500, its price movements didn’t always align with the stock market trends, showing that factors influencing Ether are different from those driving the markets.\n\nFor market participants, from casual investors to institutional traders, these insights may offer some potentially valuable perspectives on how governance-related events can be crucial indicators for investment strategies.\n\nFor the Ethereum community and developers, the data highlights the impact their decisions have, not just on the network’s technical trajectory, but on its financial ecosystem as well.\n\nEther's price performance for the last 30 days.\n\nEther’s price is $2,270, up 3.7% on the day, after falling 16% from its yearly high of $2,700 on January 12.\n\nThe Dencun upgrade is about one month away from being finalised, which according to the study, should coincide with an increase in Ether’s price."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1mb3JlY2FzdHMvd2hlbi13aWxsLW91ci1mb3JlY2FzdGVkLXByaWNlLW9mLWV0aC10by0xMDAwMC1iZS1oaXQv0gFmaHR0cHM6Ly9pbnZlc3RpbmdoYXZlbi5jb20vY3J5cHRvLWZvcmVjYXN0cy93aGVuLXdpbGwtb3VyLWZvcmVjYXN0ZWQtcHJpY2Utb2YtZXRoLXRvLTEwMDAwLWJlLWhpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "When Will Our Forecasted Price Of $10,000 Ethereum Be Hit? - Investing Haven",
        "content": "Ethereum is the cornerstone of decentralized finance and the second-largest coin by market cap. Currently trading above $2,000, the price of ETH would need 5x before it hits $10,000.\n\nSee Related: 2024 Is A Hidden Crypto Bull Market\n\nIt’s important to understand that our ETH to $10,000 forecast is based on charting analysis and not minor news, that is often irrelevant to price increases. Such news is usually helpful when taken into account with other information to provide a more accurate context/backdrop.\n\nWe use charts to back up all statements, separating us from typical crypto media and online headlines.\n\nWelcome in the magic world of price forecasting. We will guide you in how we think about our Ethereum price prediction, particularly how we get to an answer to the when can ETH go to $10,000 question.\n\nMaking accurate forecasts on the price of ETH\n\nTime and time again, it has been proven that fundamental news information is not correlated to short or even medium-term price increases in the Web3 space. It does not matter how many partnerships a network signs or what upgrades have taken place – the token will rise or fall along with the wider market.\n\nSuch information is useful mainly in terms of project longevity – it’s less likely to go out of business with strong fundamentals. It’s relevant primarily when taken in a much broader context of charting analysis and the wider crypto economy. However, many “analysts” will use standalone fundamental news to make unsubstantiated claims about the price of ETH. A classic example would be Ethereum’s Merge, which did next to nothing regarding its price:\n\nETH to $10,000 after the Merge? Discounted cash flow models are estimating this. If you're stacking ETH for the Merge, you should be earning passively from it too. Top 5 ETH yield strategies 🧵👇 — Ross Booth (@therossbooth) March 31, 2022\n\nEthereum’s ‘buy the rumor, sell the news’ moment\n\nThe price of ETH actually dropped after the Merge. While the upgrade was undoubtedly an excellent technical advance for Ethereum‘s ecosystem, this will only have a long-term price effect. But the financial trading markets, driven by those looking to make huge returns in a short space of time, are often not concerned with long-term rewards.\n\nIt’s quite simple. Just like in other markets, fundamental news is great for long-term investors who can wait for longer time horizons (2 – 5 years). Executing a trade based on fundamental news and expecting price increases in the near term makes little sense. And regarding Ethereum, we already know it has rock-solid fundamentals, as the home of DeFi. The skill lies in knowing if the fundamentals are already priced into the token.\n\nEthereum charts to the rescue\n\nWhile fundamental information is useful to a degree, it’s the charts that really help when dealing with accurate price predictions. Fundamental news information can also be useful because it indicates where people will be misled. For instance, with all eyes on BTC spot approval pushing up the price of BTC, we knew it was practically exhausted, and placed our attention on ETH.\n\nStated differently, fundamentals alone will not help in understanding whether ETH can go to $10,000. Moreover, the question WHEN can ETH go to $10,000 cannot be answered without decent chart analysis.\n\nWe have 3 ETH charts that paint a clear picture, and tell a great story.\n\nETH daily price chart\n\nFirst, the daily ETH chart which exhibits retracement levels. These retracement levels, represented by different colors on our chart, are important because they create one logic structure. The structure we are talking about is the the big drop (correction) since ETH hit its ATH.\n\nThe point with this retracement analysis is that it helps you understand when the long consolidation, otherwise boring, is entering a bullish period.\n\nAs seen below, in this long and boring consolidation, price is moving above the critical 50% retracement level. This is critical. Why? Because readings above the 50% retracement level are turning the consolidation into a bullish setup (more confirmation is needed before getting very bullish but it’s getting potentially very interesting for investors).\n\nA similar but very different ETH daily chart\n\nNow here is some magic that comes from our top charting team. We take the exact same chart, switch from a horizontal chart view (retracement levels) to a chart pattern view. Suddenly, the colored chart above turns into a dynamic chart exhibiting trends, see below.\n\nThis view of the ETH chart looks extremely promising, to say the least. Suddenly, the $10,000 price forecast for ETH is not such a crazy idea, on the contrary. What clearly stands out from the chart shown below is that $3,525.50 plays a pivotal role in Ethereum’s price evolution. That’s because $3,525.50 is a pivotal price point on ETH’s chart: once above this level, an accelerated uptrend should start. Stated differently, below $3,525.50 the uptrend will be rather soft. In that case, we should not expect those big rallies we have seen in 2017 or 2020.\n\nWeekly ETH chart confirms $10,000 target\n\nAs an investor it is important to take a top-down view. In practical terms, it means that we always should check both the weekly and the daily charts, always. This certainly applies when forecasting the price of a token.\n\nIf we want to know whether ETH can go to $10,000, we must check daily and weekly timeframes.\n\nWhile the daily charts, above, painted a very bullish picture, we must seek confirmation on the longer timeframe.\n\nLuckily, the weekly chart indicates a bullish pattern: a rounded reversal. That’s a bullish pattern provided key support levels hold.\n\nWhat may sound counter-intuitive, especially to the ‘instant pump’ crowd, is that this consolidation needs to continue for a lot longer before getting strongly bullish.\n\nWhat we are saying is that serious ETH investors would hope for the following to occur:\n\nSupport levels to hold (think 2022 and 2023 lows).\n\nThe rounded pattern to further mature below $3,525.50 in 2024.\n\nIn doing so, create a W-structure.\n\nThis, ultimately, would make for the perfect setup on this weekly ETH chart to move to our forecasted $10,000 ETH target in 2025. In other words, the longer the consolidation, the better, as the result on the weekly timeframe would result in a stronger bullish reversal.\n\nETH to $10,000 – chart conclusion\n\nThe good news from our charting analysis team is that the acceleration of the uptrend will start around $3525. We expect this to occur in 2025. When it does, it’s a more reasonable 3x increase to $10,000.\n\nThe weekly view also confirms a price rise acceleration to $10,000 in 2025 is perfectly possible, consistent with the daily chart.\n\nMUST READ – Crypto Markets Almost Ready For Alt Season 2024. Are You?\n\nThe price of ETH in 2024\n\nThis year, the price of ETH could hit between $3,000 – $4,000, with $3,000 the more realistic estimate. Despite a current freefall in the markets and the rising popularity of Solana-based coins, we’re still very bullish on Ethereum throughout the course of the year. We accurately predicted the current Bitcoin price fall after the overhyped Bitcoin ETF approval and significant bullish momentum.\n\nWe can stick with our estimate that Bitcoin, and Ethereum, could hit all-time highs in 2024. The market is simply clearing house of those who bought at the high and will now sell at the low. There are many discounted coins available at the present time.\n\nOur premium charting service can instantly reveal which ones offer the best ROI. We called many winners in 2023 such as Fetch.ai, Ocean, Render Token, Stargate Finance, Metis Dao, and more.\n\nEthereum price of $10,000 still stands\n\nIn sum, the price of Ethereum could easily rise to $10,000. This will most likely occur in 2025. The level to reach is $3,525. Throughout 2024, the price of ETH will likely move to $3,000 – $4,000. First, we have to get out of the current bear cycle, consolidate, and push upwards.\n\nThe only point of concern would be a black swan event that pushed ETH below $1,300, in which case estimates would need to be revised. But this is a low-probability event.\n\nEthereum is still up 35% on a yearly basis at the time of this writing, trading around $1,600 at the beginning of 2023.\n\nDisclaimer: This is not financial advice. Please consult with a licensed financial advisor prior to making any investments.\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXJhaXNlcy1jb25jZXJucy1vdmVyLXByaXZhY3ktaW4tbW9kZXJuLWNhcnPSAVlodHRwczovL3UudG9kYXkvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1yYWlzZXMtY29uY2VybnMtb3Zlci1wcml2YWN5LWluLW1vZGVybi1jYXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Raises Concerns Over Privacy in Modern Cars - U.Today",
        "content": "Advertisement\n\nEthereum co-founder Vitalik Buterin has voiced concerns about the privacy implications of modern cars, drawing attention to the often overlooked aspects of automotive technology.\n\nButerin's comments follow a detailed report by researchers Jen Caltrider, Misha Rykov, and Zoë MacDonald, which showcases the significant privacy issues in today's vehicles.\n\nRising privacy concerns in networked vehicles\n\nThe report mentioned by Buterin states that all 25 car brands evaluated received a \"Privacy Not Included\" warning label, indicating serious privacy shortcomings.\n\nModern vehicles, often described as \"computers on wheels,\" collect an excessive amount of personal data, ranging from location to driving habits, and even inferring personal characteristics.\n\nThis data is not only used for vehicle operations but also for marketing and other business purposes. Furthermore, 84% of these brands are reported to share or sell this personal data, with 56% potentially sharing it with government agencies upon request.\n\nThis alarming level of data collection and sharing has raised significant privacy concerns among experts and consumers alike.\n\nTechnology and privacy\n\nButerin's post has sparked a discussion on social media about the balance between technological advancements and privacy.\n\nSome users express interest in retrofitting classic cars to avoid modern privacy issues while others accuse Buterin of being a technology denier.\n\nHowever, Buterin clarifies his stance, stating that he supports various modern technologies, including certain AI applications, but he maintains a critical view of specific technologies that pose privacy risks. \"There's a small-but-important subset of things I worry about!\" he stressed."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS13ZWVrbHktcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tY29udGludWVzLXRvLXNob3ctc2lnbnMtb2YtbGlmZS0xNDA1MjE00gFraHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLXdlZWtseS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tc2hvdy1zaWducy1vZi1saWZlLzE0MDUyMTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Weekly Price Forecast – Ethereum Continues to Show Signs of Life - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyLWV0Zi1zZWMtdXBjb21pbmctZGF0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Roughly '60% chance' of spot ETH ETF approval in May: Seyffart - Blockworks",
        "content": "Spot ether ETFs have roughly a 60% chance of being approved in May, according to Bloomberg Intelligence analyst James Seyffart.\n\nEarlier this week, the Securities and Exchange Commission delayed decisions on the potential BlackRock and Grayscale ether ETFs. Alongside BlackRock and Grayscale, Ark 21Shares and VanEck are also in the running for a spot ether ETF.\n\nThe delays were not surprising, according to experts who expect the SEC to put off a decision on the ETFs until later this year. The SEC, earlier this month, approved a slew of bitcoin ETFs.\n\nRead more: Race for a spot ether ETF begins with bid from Ark Invest, 21Shares\n\nSeyffart is eyeing May 23 as the next date to watch in the spot ether saga. May 23 marks the 240-day window for the SEC to decide on proposals from Ark/21Shares and VanEck.\n\n“My base case is still probably around 60-ish percent that they’ll approve them” around that date, he told Blockworks. “But there’s plenty of ways they can delay.”\n\n“So if the SEC wants to get geared up and ready to go and wants everyone to go at the same time, they’ll likely do it on May 23 unless they can figure out some way to deny or delay this whole process and do what they want,” he continued.\n\nIf a May approval doesn’t pan out, then Seyffart plans to watch 2025.\n\nGrayscale is taking a similar approach to its bitcoin ETF by trying to convert the Grayscale Ethereum Trust (ETHE) into an ETF.\n\nThe company’s Chief Legal Officer Craig Salm said in a radio interview that the firm is looking at summer 2024 for an SEC decision.\n\n“That clock will come due sometime this summer,” he said.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\nIts application for a bitcoin ETF was initially denied which led the firm to file an appeal. Back in August, a panel of judges sided with Grayscale, leaving the SEC to reconsider the application.\n\n“This ruling opened the floodgates for BTC, so to speak. And also put the SEC in a logical pretzel,” Van Buren Capital general partner Scott Johnsson said.\n\nFast forward to January, and Grayscale was one of nearly a dozen firms approved to launch. It is also the fund with the highest number of outflows since the ETFs went live earlier this month.\n\nJohnsson further gave his insights on the possible ETH ETF roadmap in a post on X Thursday.\n\nLoading Tweet..\n\nHe noted that there’s a lot of “nuance right now,” but he expects that, in the long term, “ETH spot is almost guaranteed.”\n\nHowever, the SEC can choose to ask potential issuers to pull their applications or issue denials when the May deadlines come around. If the SEC were to ask Ark/21Shares or VanEck to withdraw then it’s a “good indication that the SEC is going to approve these,” Seyffart said.\n\n“The SEC might just need more time to get up to speed with Ethereum versus Bitcoin,” he added, noting how different the two are.\n\nCaution, Johnsson said, “is warranted in assuming spot ETF approval.”\n\nLoading Tweet..\n\nJohnsson believes that the existence of ether futures ETFs is a bright spot for the potential green light, having seen that the SEC approved the bitcoin ETFs partially on that basis.\n\nSeyffart added that the SEC could say that the futures market isn’t “large enough or liquid enough or impactful enough” when looking at spot ether ETFs.\n\nBut, as May approaches, there should be clues that “inform” the public as to what the SEC is thinking.\n\n“There’s a few different things that we can look to to get a feel for what’s going on that we don’t have yet, and I wouldn’t expect us to have it for some time. Perhaps another month or two,” Seyffart said. These things include filings and responses from both the issuers and the SEC.\n\n“It would certainly not surprise me if the SEC decided to avoid the [DC Circuit] at all costs and simply issued approval,” Johnsson said in a post on X.\n\nSEC Commissioner Hester Peirce, in an interview earlier this week, said that the SEC “shouldn’t need a court to tell us that our approach is arbitrary and capricious in order for us to get it right.”\n\nShe added that the SEC will “apply precedent” to spot ether decisions.\n\nCurrently, Seyffart told Blockworks, the process for spot ETH approval reminds him of July of last year. Around that time, BlackRock and other issuers were about a month into the spot bitcoin ETF race and the Grayscale decision had yet to be issued.\n\n“I know the timeline isn’t exactly lining up that way, but what we know and what we don’t know are kind of in the same boat,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcGF0aC10by1yZWNvdmVyeS1hbmFseXN0LWhpZ2hsaWdodHMv0gFXaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1wYXRoLXRvLXJlY292ZXJ5LWFuYWx5c3QtaGlnaGxpZ2h0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Path To Recovery: Analyst Highlights 3 Key Factors Pointing To A Price Boom - NewsBTC",
        "content": "Michael van de Poppe, a prominent crypto analyst, recently outlined three key factors that could herald a bullish phase for Ethereum, the second-largest crypto by market capitalization. One crucial factor he identifies is Bitcoin’s current behavior.\n\nThe analyst pointed out that as the market leader, Bitcoin’s recent signs of bottoming out tend to precede altcoin rallies, hinting at a potential upswing for Ethereum. Moreover, Van de Poppe highlights the growing anticipation surrounding spot Ethereum exchange-traded funds (ETFs).\n\nAccording to Van de Poppe, the increasing buzz about these spot ETFs is a significant catalyst that could drive Ethereum’s value over the coming weeks.\n\nAdditionally, Ethereum is on the cusp of rolling out critical network upgrades. These updates, aimed at reducing transaction costs by up to 90%, are expected to improve the network’s efficiency and scalability significantly.\n\nThe momentum towards $ETH is probably going to come in the next few weeks. Arguments:\n\n– #Bitcoin bottoming out is a trigger for altcoins to make a new run.\n\n– Ethereum Spot ETF hype.\n\n– Ethereum launching new upgrades to reduce 90% of the costs. pic.twitter.com/N8bDi52F8M — Michaël van de Poppe (@CryptoMichNL) January 25, 2024\n\nLatest Update On Ethereum Deacon Upgrade\n\nRegarding updates, Ethereum’s development team is making strides with the upcoming Dencun upgrade, a significant “hard fork” that aims to enhance the blockchain’s efficiency.\n\nTim Beiko, a core Ethereum developer, updated the community earlier today on the progress. Dencun, which incorporates “proto-danksharding,” is set to reduce transaction costs on layer 2 solutions, making Ethereum more accessible and affordable for users.\n\nAccording to the developer, the upgrade is scheduled to activate on the Sepolia testnet on January 30 and the Holesky testnet on February 7, with mainnet implementation following if these tests succeed.\n\nMore testnet blobs on the way .oO Dencun will activate on Sepolia Jan 30, and on Holesky Feb 7. If running a node on either network, now’s the time to update it! Assuming both of these go smoothly, mainnet is next ✅https://t.co/QbEUACix2S — timbeiko.eth ☀️ (@TimBeiko) January 25, 2024\n\nBrighter Future Ahead\n\nDespite these positive developments, Ethereum’s market performance mirrors the overall bearish sentiment in the crypto market, led by Bitcoin. ETH has seen a 13.7% decline in the past week, currently trading at $2,216.\n\nHowever, analysts like Van de Poppe urge caution, particularly regarding the impact of the Bitcoin spot ETF. While there may be short-term selling pressure, Van de Poppe remains optimistic about the long-term prospects.\n\nThe analyst suggests that the influx of new capital from diverse market participants could propel Bitcoin, and by extension, Ethereum, to new heights.\n\nThe markets need to be more accurate with the impact of the ETF. There’s some selling pressure in the short term, but in the long term, a massive amount of new money flows into the markets from new participants. As a result, #Bitcoin might push higher this cycle than we think. — Michaël van de Poppe (@CryptoMichNL) January 25, 2024\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGYtYXBwcm92YWwtb2Rkcy1xdWVzdGlvbmVkLWJ5LWFuYWx5c3TSAURodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRmLWFwcHJvdmFsLW9kZHMtcXVlc3Rpb25lZC1ieS1hbmFseXN0P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Questioned by Analyst - U.Today",
        "content": "Advertisement\n\nThe deadline for the U.S. Securities and Exchange Commission (SEC) to approve a spot ether (ETH) exchange-traded fund (ETF) is just months away, and analysts are divided on the odds of the regulator greenlighting such a product.\n\nLegal experts Jake Chervinsky and Scott Johnsson have cast doubt on the likelihood of a positive outcome.\n\n\"Many people seem to assume that because the SEC gave up fighting against the spot BTC ETF, they’ll do the same on ETH. I’m not sure,\" Chervinsky said on the X social media platform.\n\nRegulatory hurdles\n\nScott Johnsson cautioned investors to prepare for the possibility of the ETF's disapproval.\n\nAccording to Johnsson, the SEC might require consistent correlation across the entire 2.5-year sample period to satisfy the requirements of section 6(b)(5) of the Securities Exchange Act.\n\nThis stance, while potentially frustrating for proponents of the ETF, is not seen as unreasonable or capricious by Johnsson.\n\nHe also argues that approval is more likely in the following year, making an appeal less attractive and portraying the SEC in a constructive light. \"And more importantly, why would someone appeal such a tough argument when they know with high certainty it will be approved before their appeal is decided,\" he wrote.\n\nThis perspective was further discussed on X, with users debating the arbitrariness of the 2.5-year period and the prospects of an eventual approval.\n\nEarlier this week, the SEC postponed its decision on the approval of a spot Bitcoin ETF until March.\n\nDiverging views on approval odds\n\nContrasting opinions have emerged regarding the approval odds for the spot ether ETF. A recent report by JPMorgan gave the ETF no more than a 50% chance of approval by May, citing ongoing lawsuits against crypto exchanges offering staking services for proof-of-stake blockchains, including Ethereum.\n\nThis legal uncertainty adds complexity to the SEC’s decision-making process. On the other hand, Bloomberg Intelligence Senior ETF analyst Eric Balchunas initially estimated a 70% chance of approval this year, with his colleague James Seyffart offering a slightly more cautious outlook of 60-65%.\n\nSeyffart acknowledges the existence of strong arguments both for and against the ETF's approval, indicating a less confident stance compared to previous Bitcoin ETF approvals."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvLm5ld3MvZmxpcHNpZGUtc2Vlcy1yaXNpbmctZXZtLWFkb3B0aW9uLWluLTIwMjQtZm9yLWNvc3QtZWZmZWN0aXZlLWV0aGVyZXVtLWFsdGVybmF0aXZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Flipside sees rising EVM adoption in 2024 for cost-effective Ethereum alternatives - crypto.news",
        "content": "Flipsides say the ongoing demand for economical alternatives to Ethereum, will drive more layer-2 projects to prioritize reducing end-user costs this year.\n\nEthereum is set to confront heightened competition in the blockchain space in 2024, driven by the persistent demand for cost-effective alternatives and the proliferation of Ethereum Virtual Machine (EVM)-compatible layer-2 networks, Flipside, a blockchain data platform, said in a recent research report.\n\nIs the bull is really here? How can we tell?\n\n\n\nData.\n\n\n\nSentiment isn't the only thing that's changed lately. According to the data, user behavior is shifting — and with it, crypto markets.\n\n\n\nWe cover it all in The Onchain Crypto User Report 🧵📊👇 pic.twitter.com/IsclNOZhJk — Flipside 📊 (@flipsidecrypto) January 25, 2024\n\nAs per analysts, a substantial portion of EVM users are now actively exploring alternative options to Ethereum due to the allure of lower fees and faster transactions offered by emerging layer-2 solutions. The significance of this shift is underscored by historical patterns, where past bull runs fueled by Ethereum-based protocols resulted in soaring transaction costs.\n\n“The continued need for cost-effective alternatives to Ethereum, plus the growing number of EVM-compatible layer-2s, will pressure more layer-2 projects to focus on lowering end user costs.” Flipside\n\nYou might also like: SEC delays Grayscale spot Ethereum ETF to May\n\nThe competitive landscape is further shaped by a growing number of EVM-compatible layer-2 networks, compelling layer-2 projects to pivot towards prioritizing cost reduction for end users. As part of this evolution, governance tokens of layer-2 networks such as Optimism (OP), Arbitrum (ARB), and Polygon (POL) are gaining renewed attention.\n\n“The ability of these governance tokens to impact each network’s competitive advantage will play a central role in the layer-2 narrative.” Flipside\n\nAdding to the dynamics, Ethereum’s planned Dencun upgrade, featuring a new feature known as “blobs” that will allow storing large pieces of data on Ethereum blocks through EIP-4844, is anticipated to amplify the competition. Flipside says blobs will enhance block space on the mainnet and boost throughput for layer-2 networks, further challenging Ethereum’s dominant position.\n\nAnalysts at Mike Novogratz’s crypto bank, Galaxy Digital, echo a parallel sentiment, foreseeing a pivotal 2024 for Ethereum amid increasing stakes raised by other layer-1 blockchains.\n\nGalaxy Digital highlights Ethereum’s modular architecture, specifically diverse rollup types, as a source of potential challenges and technological risks due to their early developmental stage. Singling out Solana as the primary contender with its distinctive monolithic architecture, Galaxy Digital positions it as the main competitor against Ethereum this year.\n\nFollow Us on Google News"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXhwbG9kZS0xNTAwMC1mYXZvcmFibGUtdGVjaG5pY2FsLWZvcm1hdGlvbi_SAV9odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWV4cGxvZGUtMTUwMDAtZmF2b3JhYmxlLXRlY2huaWNhbC1mb3JtYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst Thinks Ethereum Will Explode To $15,000, Cites Favorable Technical Formation - NewsBTC",
        "content": "A crypto analyst, Elja on X, predicts that Ethereum (ETH) will reach a staggering $15,000 by 2025 based on technical analysis. The analyst argues that the current bearish sentiment in the crypto market is “temporary.”\n\nMoreover, Elja notes that the second most valuable coin by market cap follows a similar fractal pattern that fueled its previous major price rally in 2021.\n\nIs Ethereum Ready To Rip Despite The Current Consolidation?\n\nSharing a screen grab of the current ETH price action, Elja says most people in crypto are “short-sighted” and only focus on immediate price movements. In the analyst’s assessment, traders should look at the long-term to understand the overall price pattern.\n\nThus far, Ethereum, like Bitcoin (BTC), remains under pressure and struggling to break above immediate resistance levels. Looking at the development in the daily chart, ETH is back at a critical support level of around $2,200. Notably, the coin is down 20% from January 2024 highs of about $2,700.\n\nETH is under pressure, at least in the short to medium term. As it is, the coin follows the technical candlestick arrangement visible in Bitcoin.\n\nThe altcoin downtrend appears to have been triggered by events following the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC). As an illustration, Bitcoin fell from around $47,000 to below $40,000 this week, weighing down altcoins, including Ethereum.\n\nOn-chain data shows that Grayscale Investments has been unloading thousands of coins behind Grayscale Bitcoin Trust (GBTC). Subsequently, there has been a sell-off in Bitcoin and across the altcoin scene. The situation has been made worse for Ethereum following the United States SEC’s decision to postpone the approval of spot Ethereum ETFs.\n\nWhile these developments have negatively impacted sentiment, Elja believes they will not derail Ethereum’s long-term growth trajectory. Specifically, the analyst notes that ETH is consolidating, a “healthy sign.”\n\nETH To $15,000: Will Fundamental And Technical Factors Help?\n\nElja added that when crypto prices consolidate, it could suggest that whales are accumulating their position. Once this ends, ETH prices could trend higher. From the analyst’s chart, the coin will break above $5,000 to $15,000 in the coming sessions.\n\nWhen making this prediction, the analyst compared the Ethereum price action to the fractal pattern that propelled ETH from around $200 to $4,800 in 15 months from 2019 to 2021. Extrapolating from past price action, Elja believes Ethereum is on a similar path. Based on analysis, the coin will likely break above November 2021 peaks.\n\nBeyond technical factors, ETH supporters cite the decreasing issuance rate. According to Ultrasound Money data, the network has been burning thousands of ETH, reducing supply. Additionally, Larry Fink, the CEO of BlackRock, believes Ethereum will be the choice network for tokenizing real-world assets (RWAs) in the years ahead.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdS50b2RheS9iaXRjb2luLWFuZC1ldGhlcmV1bS1idWxscy10YWtpbmctY29udHJvbC02MC1taWxsaW9uLW9mLXNob3J0cy1saXF1aWRhdGVkLWFoZWFkLW9mLXdlZWtlbmTSAW5odHRwczovL3UudG9kYXkvYml0Y29pbi1hbmQtZXRoZXJldW0tYnVsbHMtdGFraW5nLWNvbnRyb2wtNjAtbWlsbGlvbi1vZi1zaG9ydHMtbGlxdWlkYXRlZC1haGVhZC1vZi13ZWVrZW5kP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Bulls Taking Control: $60 Million of Shorts Liquidated Ahead of Weekend - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market is witnessing a strong bullish momentum as Bitcoin and Ethereum bulls start to assert control. In a significant development, shorts worth approximately $60 million have been liquidated, signaling a potential shift in market sentiment as we approach the weekend.\n\nAdvertisement\n\nAnalyzing the current charts, Bitcoin has demonstrated resilience, managing to sustain above the crucial support level of $40,000. The coin has recently experienced a rebound from this level, which has historically acted as a strong psychological barrier for both bulls and bears.\n\nIf BTC maintains its position above this support, the next key resistance to watch will be around $42,000, a level where we might expect some consolidation before a further push. On the downside, if the $40,000 level fails to hold, traders should look for potential support near the $38,500 region.\n\nEthereum, on the other hand, is also showing signs of recovery after a recent sell-off. The coin has found support near the $2,100 mark, just above the 200-day exponential moving average, which is often considered a significant indicator of long-term trends.\n\nIf ETH can sustain this rebound, the immediate resistance is expected at $2,400. A breakthrough above this could open the path toward $2,500, a level that previously acted as both support and resistance. A fall below the current support level could see the price testing the next support zone around $2,000.\n\nThe liquidation heatmap provides additional context, illustrating the pressure on short sellers as the market moves against their positions. This liquidation is particularly evident in the case of Bitcoin and Ethereum, which have seen a significant number of short positions being closed in a short span of time. Overall, the market is currently displaying bullish signs, with strong support levels holding up."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZm9ydHVuZS5jb20vMjAyNC8wMS8yNi9jcnlwdG8tYnVsbC10cmFwLTIwMjQtYnRjLWV0aC1ldGYtaGFsdmluZy1vdXRsb29rLWZpbmFuY2UtcmFjaGVsLWxpbi_SAWhodHRwczovL2ZvcnR1bmUuY29tLzIwMjQvMDEvMjYvY3J5cHRvLWJ1bGwtdHJhcC0yMDI0LWJ0Yy1ldGgtZXRmLWhhbHZpbmctb3V0bG9vay1maW5hbmNlLXJhY2hlbC1saW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Beware the crypto bull run predictions in 2024 - Fortune",
        "content": "Aside from the high-profile court cases, much of 2023 was a fairly lackluster year for crypto. Market activity remained mostly flat compared to the historical average. Major cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH) traded sideways all year, and total volume locked (TVL) in decentralized finance ecosystems drifted within a narrow range, far below all-time highs. This lack of dramatic volatility was far from the norm we usually associate with crypto assets. The minor pricing pump in Q4 closed out the year on a positive note.\n\nIt wasn’t a year for making money. But the recent green light from the Securities and Exchange Commission for 11 Bitcoin spot exchange-traded funds (ETFs) applications, featuring heavyweight players such as BlackRock, Ark Investments/21Shares, Fidelity, Invesco, and VanEck has led to a notable upswing in the crypto market, expressing optimistic outlook. Speculation is rife that a sustained bull run will replace this latest crypto winter.\n\nWhile I remain bullish on digital assets and the wider crypto industry on a long-term horizon, there’s reason to remain cautious going into 2024. Investors face mixed signals, and it’s possible the good news regarding Bitcoin ETF approval–which has been leading crypto headlines for some months–has already been priced in.\n\nWhile markets didn’t skyrocket last year, they also didn’t crater. There has been sufficient optimism to maintain pricing stability. That optimism is largely related to two major events in 2024: the recent approval of spot Bitcoin ETF and the potential approval of Ethereum exchange-traded funds (ETFs) in the U.S., as well as the upcoming Bitcoin halving. The ETF approvals are expected to bring improved trading volumes and liquidity to crypto markets in general, and the halving will prevent BTC deflation and thus support prices.\n\nMany pundits have attributed the Q4 pricing pump to these factors, and that’s been coupled with bullish activity in the derivatives market as well. Investors overall appear to believe that central bank rate hikes are mostly behind us and that there’s enough weight to these optimistic murmurings to look forward to a breakout bull run in 2024.\n\nDespite the undeniably positive impact of institutional endorsements and the market sentiment reflected by the recent pricing upswing, I believe there is some truth to the Wall Street saying “buy the rumor, sell the news” here. The crypto market is forward-looking, and traders who have already bought the rumor might be waiting to sell regardless of what the news is.\n\nAfter the initial surge on the back of the highly anticipated news, markets may quickly pare those gains as wider adoption fails to keep pace. A subsequent correction could take place before an actual bull run begins. ETFs are a big step–but not nearly enough to declare we’ve achieved mass crypto adoption. While the approval of Bitcoin spot ETFs is a big win, I won’t be holding my breath for new all-time highs for crypto asset prices or total value locked (TVL) in the short run.\n\nAs for BTC’s halving in Q2, it will support markets but it’s unlikely to drive a full-fledged bull run. This anti-inflationary measure makes mining new BTC more difficult, restricting supply. In the absence of significant crypto adoption, this alone isn’t enough to take us back to BTC’s peak of nearly $69,000, let alone surpass it.\n\nOn the other hand, an additional reason for optimism is the fact that 2024 is an election year in the U.S. We can expect U.S. regulators to tone down their headline-seeking activities in this high-stakes year. As such, there ought to be less bad news on the horizon for crypto that has the potential to dent investors’ enthusiasm. This can possibly set the stage for the next bullish trend.\n\nAll in all (and Black Swan events aside), 2024 is shaping up to be more of the same for crypto asset prices. My base case scenario is that the market will bottom out and begin recovering more meaningfully by Q4 2024. In the meantime, we can expect some minor volatility as investors whiplash from heady anticipation to mild disappointment.\n\nHowever, the overall relative lack of volatility indicates that the crypto finance market is maturing, and thus our investment and trading strategies must mature as well.\n\nRachel Lin is a co-founder and CEO of SynFutures, a decentralized derivatives trading platform.\n\nMore must-read commentary published by Fortune:\n\nThe opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1uZWFycy1tYWlubmV0LWRlYnV0LXdpbGwtZXRoLXJhbGx5L9IBVWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1uZWFycy1tYWlubmV0LWRlYnV0LXdpbGwtZXRoLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade Nears Debut: Will ETH Rally? - CoinGape",
        "content": "Ethereum’s blockchain is on the brink of a transformation with the impending Dencun upgrade. Scheduled for a late February or early March release on the mainnet, this upgrade is poised to revolutionize Ethereum’s transaction framework. Developers have scheduled critical tests on the Sepolia and Holesky testnets on January 30 and February 7, respectively, marking the final steps before the upgrade goes live.\n\nPrevious Testnet Hiccups and Forward Momentum\n\nDespite experiencing minor setbacks during its implementation on the Goerli testnet, the Dencun upgrade showed resilience. A bug in Prysm nodes caused a delay in finalization but was swiftly rectified. This hiccup did not deter the progress, as the Ethereum community remains focused on enhancing the blockchain’s efficiency and scalability.\n\nadvertisement\n\nProto-Danksharding\n\nAt the core of Dencun lies the proto-danksharding feature, a technical innovation designed to drastically lower transaction costs on layer 2s and provide more affordable data storage on the blockchain. This development is not just a step forward for Ethereum but a potential game-changer for the entire blockchain ecosystem.\n\nThe Dencun upgrade, as a result, is a technical milestone and a potential catalyst for Ethereum’s market performance. Historically, significant upgrades have led to notable shifts in Ether’s (ETH) market value. For instance, following the Shapella upgrade last March, ETH’s price saw a substantial uptick.\n\nEthereum’s Market Response to Upgrade Developments\n\nIn anticipation of the Dencun upgrade, Ethereum’s market behavior has exhibited noteworthy trends. The cryptocurrency has seen a fluctuating trajectory, with its price rallying significantly before the approval of spot Bitcoin ETFs in the United States, only to soften in the subsequent weeks. However, Ethereum has outperformed Bitcoin in several key aspects, as on-chain analytics firm Glassnode reported.\n\nGlassnode’s analysis reveals that Ethereum has surpassed Bitcoin in quarterly, monthly, and weekly performance. The firm, moreover, points to a more than 20% increase in Ether’s value against Bitcoin, coinciding with heightened activity in the ETH derivatives market. This outperformance, in addition, is underscored by Ethereum’s growing market cap dominance, which has gained 2.9% compared to Bitcoin since the ETF approval.\n\nHowever, ETH traded at $2,211, a 0.34% at press time decline from the intraday high of $2,242.\n\nRead Also: Is It A Good Time To Buy Terra Luna Classic (LUNC) 30% Dip In A Month?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZWxzaXVzLW1vdmVzLWJpbGxpb24taW4tZXRoZXJldW0tdG8tY29pbmJhc2UtcGF4b3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Celsius moves a massive $1B in Ethereum to CEXs: Repayments incoming? - Cointelegraph",
        "content": "The defunct crypto lending platform Celsius has moved large amounts of Ether (ETH) to centralized exchanges amid expectations that the firm will start repaying creditors in liquid crypto in mid-February.\n\nOn Jan. 26, there were several large transactions of Ether from the Celsius Network wallet to deposit wallets for Paxos and Coinbase Prime.\n\nThe largest transaction was for 443,961 ETH worth $984 million at the time of the transfer from Celsius to another network-controlled wallet in preparation for moving.\n\nA total of 13 transactions followed over the next hour, moving this huge tranche of ETH to Coinbase and Paxos wallets, according to blockchain intelligence firm Arkham.\n\nRecent ETH transfers from Celsius Network. Source: Arkham\n\nSpotonchain reported that “most of the 297,454 ETH sent to Coinbase was distributed to 12 fresh wallets, probably as part of an OTC deal.”\n\nOnly two days earlier, Celsius moved 575,081 ETH on Jan. 24 using addresses labeled Celsius Network: Staked ETH and Celsius Network: Eth2 Depositor in an internal transaction.\n\nOverall, Celsius has moved 757,626 ETH to FalconX, Coinbase, OKX and Paxos since Nov. 13, 2023, it stated, adding that currently, Celsius still holds 62,469 ETH valued at $138.8 million at current prices.\n\nThe exact reasons for the recent Ether transactions are not immediately clear. However, according to a Celsius asset distribution FAQ updated on Jan. 12, a limited number of corporate accounts will be able to receive cryptocurrency through Coinbase.\n\nFor non-corporate accounts, distributions to creditors residing in the United States will be made via PayPal, and distributions to creditors outside of the U.S. will be made by Coinbase, it stated.\n\nA community of Celsius creditors on X (formerly Twitter), named “Celsius NewCo Community,” said they expect the distribution of liquid crypto to creditors to start in mid-February, adding that the distribution window will be open for one year.\n\nCelsius is aiming for an Effective Date of January 31st.\n\n\n\n️ We expect the distribution of liquid crypto to Earn Creditors to start in mid-February.\n\n\n\n⏳ The distribution window will be open for one year. pic.twitter.com/TznON0ddBV — Celsius NewCo Community (@CelsiusNewCo) January 25, 2024\n\nMeanwhile, Celsius user “TheHawk” reported that they had officially been able to remove all of their ETH from Celsius, adding that funds were in the custody account, not the Earn account.\n\nBetween Jan. 8 and 12, Celsius transferred another $95.5 million to Coinbase, while $29.7 million was transferred to FalconX, according to data from Arkham Intelligence.\n\nRelated: Celsius transfers $125M of ETH to exchanges as FTX and Alameda dump\n\nEarlier in the month, the bankrupt lending firm stated that it had begun shifting assets to “ensure ample liquidity” in preparation for any asset distributions.\n\nCelsius said it will unstake its existing Ether holdings to “offset certain costs incurred throughout the restructuring process” and “unlock ETH to ensure timely distributions to creditors.” It no longer has any ETH pending staking withdrawal, according to Nansen.\n\nOn Jan. 9, Celsius bankruptcy administrators filed an intent to notify its creditors that account holders who withdrew more than $100,000 in the 90 days before the date of the firm’s bankruptcy declaration on July 13, 2022, may be required to return them by Jan. 31, 2024.\n\nETH prices have yet to react, remaining flat on the day at $2,225 at the time of writing.\n\nMagazine: Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWV0Zi1ieS1ncmF5c2NhbGUtZGVsYXllZC1hcy1zZWMtYXdhaXRzLXB1YmxpYy1pbnB1dC_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1ldGYtYnktZ3JheXNjYWxlLWRlbGF5ZWQtYXMtc2VjLWF3YWl0cy1wdWJsaWMtaW5wdXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF by Grayscale Delayed as SEC Awaits Public Input - CoinGape",
        "content": "The Securities and Exchange Commission (SEC) has extended its review period for the Ethereum exchange-traded fund (ETF) proposal submitted by Grayscale Investments. This move comes amidst similar delays for other proposed spot Ethereum funds from major players like BlackRock and Fidelity. The SEC’s decision to seek further public input marks a significant moment in the ongoing debate over cryptocurrency-based investment products.\n\nConcerns Over Ethereum’s Proof of Stake\n\nThe SEC’s focus in this latest delay centers around Ethereum’s transition to a proof of stake mechanism. The regulator is keen to understand whether this change could lead to potential issues of fraud and manipulation within the proposed fund.\n\nadvertisement\n\nThe agency has openly questioned the concentration of control or influence by a few entities or individuals in Ethereum’s network and its impact on the overall stability and security of the proposed ETF. These concerns underline the SEC’s cautious approach to the rapidly evolving cryptocurrency market.\n\nWith the SEC setting a 21-day deadline for public comments and an additional 35 days for rebuttals, the crypto community is keenly awaiting further developments.\n\nThe prolonged timeline for a decision, extending beyond previous deadlines, has sparked varied reactions from industry experts. Some remain hopeful for a positive outcome, especially following the recent approval of spot bitcoin ETFs. However, SEC Chair Gary Gensler’s recent comments suggest a more measured approach towards other crypto-linked exchange-traded products.\n\nExpert Opinions on Ethereum ETF\n\nAs the market anticipates the SEC’s decision, opinions among crypto experts vary. Some are optimistic about a potential approval by May, drawing parallels with the recent approvals of spot bitcoin ETFs.\n\nOthers, however, remain skeptical, given the unique challenges and regulatory concerns surrounding Ethereum and its underlying technology. The consensus is a cautious optimism, with a recognition of the hurdles that lie ahead in gaining regulatory approval for such a novel financial product.\n\nRead Also: Ethereum’s Dencun Upgrade Nears Mainnet Debut: Will ETH Rally?"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXRyYW5zYWN0aW9uLXZvbHVtZS1zdXJnZXMtdG8tZm91ci1tb250aC1wZWFrLWFzLWV0aC1wcmljZS1yaXNrcy1kZWNsaW5lLXRvLTItMDAwLTIwMjQwMTI2MDgwONIBmQFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS10cmFuc2FjdGlvbi12b2x1bWUtc3VyZ2VzLXRvLWZvdXItbW9udGgtcGVhay1hcy1ldGgtcHJpY2Utcmlza3MtZGVjbGluZS10by0yLTAwMC0yMDI0MDEyNjA4MDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum transaction volume surges to four month peak as ETH price risks decline to $2,000 - FXStreet",
        "content": "Share:\n\nEthereum noted a massive surge in transaction volume on Thursday, at a four-month peak of 4.37 million.\n\nEthereum whales are engaged in profit-taking and Ether is at risk of correcting lower.\n\nETH price could nosedive to its psychologically important level of $2,000, in the event of a sell-off.\n\nEthereum transaction volume noted a surge on January 25, according to Santiment data. This increase in transactions indicates that there was a large volume exchange of Ether between market participants on exchange platforms. Typically this can be a bullish or bearish indicator depending on whether traders are realizing profits or losses, and the asset’s price trend.\n\nAt the time of writing, Ethereum price is $2,217.\n\nAlso read: Ethereum traders realize nearly $33 million in losses as overheated futures market cools\n\nEthereum on-chain metrics signal risk of price decline\n\nEthereum’s on-chain metric, Transaction Volume, has hit a four-month peak on January 25. Santiment data reveals that there was a surge in transactions as market participants witnessed large volume transfers by institutions like bankrupt crypto lender Celsius.\n\nEthereum Transaction Volume. Source: Santiment\n\nLarge wallet addresses in the Ethereum network have engaged in profit-taking, as seen in the chart below. When the Whale Transaction Count, valued at $100,000 and higher, is combined with Network Realized Profit/Loss, the data reveals that whales are realizing profits.\n\nSantiment data therefore supports the likelihood of a correction in ETH price.\n\nWhale Transaction Count and Network Realized Profit/ Loss. Source: Santiment\n\nEthereum price at risk of decline\n\nEthereum price is in a downward trend that started on January 12. Since then, the altcoin has formed lower highs and lower lows, and broken below a key trendline. Ethereum price is currently below two key Exponential Moving Averages (EMAs), the 10-day and 50-day, at $2,325, and $2,308.\n\nIf Ethereum price continues correcting, it is likely to find support at $2,165, a level that has acted as support for the altcoin since December 3. If ETH price fails to hold above this level, the altcoin could nosedive to its psychologically important level of $2,000, as seen in the chart below.\n\nETH/USDT 1-day chart\n\nA daily candlestick close above the $2,232 level could invalidate the bearish thesis for Ethereum price."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvLm5ld3MvYW5hbHlzdC1wcm9qZWN0cy1ldGhlcmV1bS1wb3RlbnRpYWxseS10by0yay1hbWlkLW1hcmtldC1jb25zb2xpZGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst projects Ethereum potentially to $2k amid market consolidation - crypto.news",
        "content": "FxPro senior analyst Alex Kuptsikevicha projects Ethereum’s price could further dip towards $2,000, as the altcoin is down by over 8% weekly.\n\nThe crypto market is experiencing a period of subdued volatility, with the total market capitalization hovering around $1.6 trillion for the third consecutive day. Simultaneously, equity indices in the stock market have also significantly declined in the past 24 hours.\n\nHowever, the impact on cryptocurrency investors has been minimal. Kuptsikevich thinks that the fall in stock values is seen more as a result of individual corporate stories rather than an indication of a global shift in market sentiment.\n\nBitcoin is benefiting from this consolidation phase, with its market share exceeding 50% once again. On the other hand, Ethereum has found itself at the lower end of the consolidation range, which it has been in for most of December. Kuptsikevich predicts that Ethereum is showing signs of possibly dropping to the $2,100 area, a level that marked the upper end of its November consolidation phase.\n\nETH 7-day market performance | Source: CoinMarketCap\n\nYou might also like: OKX shuts down mining pools after five years of operation\n\nKuptsikevich suggests that a further decline towards the $2,000 mark is possible, citing the cryptocurrency market’s inherent volatility. This potential dip could mirror a similar retracement in Bitcoin to the $37,500 level.\n\nThe SEC has also delayed its decision on BlackRock’s application for a spot Ethereum ETF until March 10. While some experts remain optimistic about the ETF’s approval by May, with a probability of 50-to-70%, others are wary of regulatory resistance.\n\nThe introduction of spot Bitcoin ETFs in the U.S. has broadened the appeal of cryptocurrencies to a wider audience. According to the head of institutional at Coinbase, this marks a potential shift towards mainstream adoption of digital currencies.\n\nHowever, the influx of new capital into new cryptocurrencies is expected to be a gradual process, unfolding over months or even years.\n\nFollow Us on Google News"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93ZWVrbHktcmVjYXAtc2VjLXF1ZXN0aW9uZWQtZXRoZXJldW0tc3BvdC1ldGYtZGVsYXllZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Weekly Recap: SEC Questioned, Ethereum Spot ETF Delayed - Unchained - Unchained",
        "content": "SUBSCRIBE TO GET THE LATEST EPISODE\n\nGet the hottest takes from Laura, her guests, and The Chopping Block crew on all the news in crypto!\n\nApple PodcastsYoutubeSpotifyGoogle Podcasts"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWphbnVhcnktMjbSAT5odHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLWZvci1qYW51YXJ5LTI2P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for January 26 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBulls are not going to give up so easily, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has risen by almost 2% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly time frame, the price of ETH is looking bullish as it is trading near the resistance level of $2,258. If the situation does not change by the end of the day, one can expect a blast to the $2,300 area tomorrow.\n\nImage by TradingView\n\nOn the daily chart, the rate of ETH has almost touched the interim resistance of $2,264.\n\nIn this case, there is a possibility of a breakout, followed by further growth to the $2,300-$2,350 zone.\n\nImage by TradingView\n\nA less positive picture can be seen on the weekly time frame. If the drop continues to the nearest support level of $2,115, the correction may lead to a test of the vital area of $2,000 soon.\n\nEthereum is trading at $2,249 at press time."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdGhlZGVmaWFudC5pby90cmFuc2FjdGlvbi1mZWVzLW9uLWV0aGVyZXVtLWxheWVyLTJzLXN1cmdlZC00MDAtbGFzdC15ZWFyLXJlcG9ydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 18:08:28 GMT",
        "title": "Transaction Fees on Ethereum Layer 2s Surged 400% Last Year: Report - The Defiant - DeFi News",
        "content": "Ethereum mainnet fees dropped 44% in 2023, signaling increased migration to cheaper Layer 2 scaling solutions.\n\nBy: Pedro Solimano • Loading...\n\nDeFi News\n\nEthereum’s Layer 2s are enjoying widespread usage from users after last year’s Merge, according to a report by P2P lending protocol PWN.\n\nLed by Arbitrum and Optimism, which witnessed a 190% and 103% surge in network fees, respectively, the overall Layer 2 ecosystem saw fees increase 400% from 2022 to 2023.\n\nLayer 2 Fees\n\nAlong with soaring fees on Layer 2s come reduced costs for users on Ethereum’s mainnet, PWN reports. The network witnessed a 44% decline in generated fees, more than double the average for all Layer 1s.\n\nIt seems users are migrating in droves to Layer 2 solutions, with the move to Proof-of-Stake accelerating the transition.\n\nBitcoin, turbocharged by the Ordinals ecosystem, registered the highest growth among Layer 1s with a 461% surge in fees generated.\n\nDeFi and NFTs Take A Dive\n\nDecentralized exchanges suffered a 51% drop in total fees generated last year. Led by Uniswap, which commands 64% of the entire fee market, the DEX sector generated $871M in 2023.\n\nDespite suffering a threatening hack in late November, KyberSwap was the only DEX that saw growth in its fee market, jumping 73%.\n\nLending platforms highlight a mixed bag in terms of the concentration of value and fees generated. The entire sector saw fees decline 36%, with market leader Aave mirroring that number. However, half the category dropped – with some, such as Maple Finance, dropping 99% – whereas the other 50% increased. Radiant was the top performer, generating 479% more fees over 2022.\n\nLending platform fees and volume\n\nThe NFT marketplace sector was hit hard by last year’s grueling crypto winter. Fees plummeted by 87% despite Blur’s meteoric 2,718% rise.\n\nStablecoins are widely poised for growth this year, with USDC set for a comeback after a dismal 2023. It registered its first net supply increase since the collapse of Silicon Valley Bank last year – totalling a $1.23B rise on the year."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8yMTQzNjgvYml0Y29pbi1hbmQtZXRoZXJldW0tZmxhdC1hcy1zb2xhbmEtbWVtZS1jb2luLWJvbmstYm91bmNlcy02LTnSAV5odHRwczovL2RlY3J5cHQuY28vMjE0MzY4L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWZsYXQtYXMtc29sYW5hLW1lbWUtY29pbi1ib25rLWJvdW5jZXMtNi05P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Flat as Solana Meme Coin BONK Bounces 6.9% - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin, Ethereum, and Solana were all flat on Friday morning after a rough start to the week.\n\nAt the time of writing, Bitcoin was changing hands for $40,444—a 1% gain from this time yesterday and down 2.2% from last Friday. Trading volume has fallen off from earlier in the week, from $31.2 billion on Tuesday to $18 billion worth of BTC moving in the past day, according to CoinGecko data.\n\nMeanwhile, Ethereum was trading for $2,221.47 at the time of writing—virtually unchanged from its price the same time yesterday, according to CoinGecko. Although BTC has made up some ground from its slide earlier this week, Ethereum is down over 10% in the last seven days.\n\nAD\n\nAD\n\nThe Ethereum community is currently preparing for its next big network update. The upgrade, which promises to make transactions on the network faster and cheaper, will next roll out on two more testnets in early February. The goal is to have Dencun on Ethereum mainnet by March, developers confirmed on Wednesday.\n\nOne of the standouts on Friday is Solana meme coin BONK. The dog-themed token has gained 6.9% since this time yesterday and is currently trading for $0.00001133. It has managed to hold onto its place in the top 100 crypto assets by market capitalization this week, but just barely. Its $688 million market cap makes it the 98th largest asset, as ranked by CoinGecko.\n\nEarly this week, the BONK community announced that it would be one of the sponsors for a Solana Hacker House event in New York in March.\n\nMeanwhile, Solana has made a modest 1.7% gain since yesterday, currently changing hands for $88.90. The Solana Foundation announced earlier this week tokens minted on the network would get new features, like issuer-determined transfer fees, confidential transfers, and metadata requirements. They're all aimed at making the blockchain a more attractive destination for stablecoins and real world assets, the foundation said.\n\n4/ In total, the 13 token extensions include: - Confidential Transfers\n\n- Transfer Fees\n\n- Transfer Hooks\n\n- Permanent Delegate Authority\n\n- Metadata\n\n- Metadata Pointer\n\n- Default Account State\n\n- Non-transferability\n\n- Mint Close Authority\n\n- Immutable Owner\n\n- Interest Bearing Tokens\n\n-… — Solana (@solana) January 24, 2024\n\nAD\n\nAD"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy10ZXNsYS1zdGlsbC1ob2xkcy0zODAtbWlsbGlvbi1idGMtYW5kLWFub3RoZXItZXRoLWV0Zi1nZXRzLWRlbGF5ZWQuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Prediction as Tesla Still Holds $380 Million BTC and Another ETH ETF Gets Delayed - Cryptonews",
        "content": "Bitcoin and Ethereum Price Prediction as Tesla Still Holds $380 Million BTC and Another ETH ETF Gets Delayed\n\nIn the ever-evolving landscape of cryptocurrency, Bitcoin (BTC) has recently reversed its downward trend, surpassing the significant $41,000 mark. This resurgence not only bolsters confidence in Bitcoin but also paves the way for other major cryptocurrencies like Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC), all of which have witnessed modest gains.\n\nThe overall crypto market cap now stands at an impressive $1.56 trillion, marking over 0.30% increase in the last 24 hours. This positive momentum in the crypto world is partly attributed to the burgeoning interest in Bitcoin ETFs, a development that underscores the cryptocurrency’s growing acceptance in mainstream finance.\n\nConcurrently, Tesla’s unwavering hold on $380 million worth of Bitcoin through Q4 2023 plays a critical role in shaping market sentiment, while the SEC’s postponement of Grayscale and BlackRock’s Ethereum ETFs introduces a layer of uncertainty in the ETH market.\n\nTesla’s Q4 2023 Bitcoin Holdings: Influence on BTC Prices\n\n\n\nIn Q4 2023, Tesla’s Bitcoin (BTC) holdings remained steady, as indicated in their recent earnings report released on Wednesday. The report didn’t mention any Bitcoin transactions, suggesting no buying or selling during the quarter.\n\nCurrently valued at $387 million, Tesla owns approximately 9,720 BTC, ranking as the third-largest public holder after MicroStrategy and Marathon. Tesla initially invested $1.5 billion in Bitcoin in February 2021, acquiring around 43,000 BTC.\n\n🚗🔒 Tesla's #Bitcoin holdings stand strong at $184 million since Dec 2022, according to the Q4 2023 earnings report. 📊 No new purchases or sales, marking a period of inactivity in their #Crypto journey.#Tesla currently ranks fourth among public companies with 10,500 $BTC. 🌐… — Bitcoinbsc (@Bitcoinbsctoken) January 25, 2024\n\nDespite selling 75% of their holdings in Q2 2022 amid COVID uncertainties, the electric car giant continues to maintain a substantial Bitcoin reserve.\n\n$BTC holdings of Elon Musk's Tesla, worth nearly $387 million at current prices, remained unchanged in Q4 2023.https://t.co/lPfhWkK8jj — David odeyale (@odeyale_david) January 26, 2024\n\nTherefore, Tesla maintaining its Bitcoin holdings in Q4 2023 signals stability, impacting BTC price sentiment positively. With Tesla holding a significant amount, investor confidence in Bitcoin could strengthen, potentially contributing to sustained or increased value.\n\nSEC Postpones Grayscale, BlackRock Ethereum ETFs: ETH Market Impact\n\n\n\nThe U.S. Securities and Exchange Commission (SEC) has postponed a decision on Grayscale Investments’ request to convert its Ethereum trust product (ETHE) into an exchange-traded fund (ETF).\n\nHowever, BlackRock’s similar application also faced a delay. The SEC has been cautious about spot crypto ETFs, recently allowing only spot bitcoin ETFs in January. Therefore, the delay in deciding on Grayscale and BlackRock’s applications is not unexpected.\n\nIn no surprise, the @SECgov has delayed decisions on spot #etherETF applications from Grayscale and BlackRock.https://t.co/hLt54lbv7m — CoinDesk (@CoinDesk) January 26, 2024\n\nThe filings raise questions about the similarities between spot Ethereum and spot bitcoin ETFs, addressing concerns like market manipulation and the size of the CME futures market. So, this echoes the SEC’s previous inquiries about bitcoin.\n\nConsequently, the SEC’s delay in approving spot ether ETFs from Grayscale and BlackRock has introduced uncertainty, potentially impacting Ethereum’s price. Market participants keenly await regulatory decisions, as approval could positively influence ETH’s value, while continued delays may introduce volatility.\n\nBitcoin Price Prediction"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS90aGUtYmxhY2stc3dhbi1ldmVudC10aGF0LWNvdWxkLWNhdXNlLWEtZm9yay1pbi1ldGhlcmV1bS1hZ2Fpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "The Black Swan Event That Could Cause a Fork in Ethereum (Again) - Unchained - Unchained",
        "content": "Episode 600\n\nListen to the episode on Apple Podcasts, Spotify, Fountain, Overcast, Podcast Addict, Pocket Casts, Pandora, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\n\n\nThis week a major potential risk to Ethereum was highlighted by a bug that surfaced in Nethermind, a minority execution client. While the bug was fixed quickly, it raised the question of what would happen to the blockchain if Geth, which is used by more than two-thirds of validators and so is considered a “supermajority client,” had a bug. The situation could potentially result in a catastrophic fork of Ethereum.\n\nEthereum developer Lefteris Karapetsas joined Unchained to discuss the different scenarios of what could happen, the potential impact of a supermajority client issue on staking services such as Lido, why he feels the incentive system is poorly designed, and what other solutions are out there to address the lack of client diversity.\n\nShow highlights:\n\nWhat a consensus issue is in Ethereum and what happened with Nethermind last weekend\n\nWhy it would be a big problem if a supermajority client had a bug\n\nThe potential impact on staking services such as Lido\n\nWhy Lefteris feels like he is reliving the historic Ethereum DAO hack all over again\n\nWhether the largest entities running nodes will start pursuing client diversity\n\nHow the data on the prevalence of specific Ethereum execution clients is not verifiable or programmatic, making it less transparent and difficult to analyze\n\nWhy Lefteris believes that the incentive system is not designed to achieve client diversity\n\nWhether there are developments in the works to try to solve the lack of client diversity\n\nThank you to our sponsors!\n\nGuest\n\nLinks"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1mb2xsb3dzLWJpdGNvaW4taGlnaGVyLW9uLWZyaWRheS0xNDA1MTgx0gFlaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLXByaWNlLWZvcmVjYXN0LWV0aGVyZXVtLWZvbGxvd3MtYml0Y29pbi1oaWdoZXItb24tZnJpZGF5LzE0MDUxODE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Follows Bitcoin Higher on Friday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4temVyby1rbm93bGVkZ2UtZW5oYW5jZWQtcHJpdmFjeS1tb2Rlcm4tY2Fycy1wcml2YWN5LW5pZ2h0bWFyZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Calls for Zero-Knowledge Enhanced Privacy Measures, Highlights Modern Cars as Privacy ... - CCN.com",
        "content": "Key Takeaways\n\nVitalik Buterin has recently voiced apprehensions about the privacy risks inherent in modern automotive technologies.\n\nA new report discloses alarming privacy issues in modern cars, termed “computers on wheels”.\n\nThe study reveals that most brands may share personal data, and a majority could even sell it.\n\nButerin supports modern technologies, including AI, but remains cautious about technologies posing privacy risks.\n\nVitalik Buterin, co-founder of Ethereum, has recently expressed concerns about the privacy risks associated with modern automotive technologies.\n\nHis remarks come in the wake of a comprehensive report by researchers Jen Caltrider, Misha Rykov, and Zoë MacDonald, highlighting the substantial privacy challenges present in contemporary vehicles.\n\nAlarming Privacy Gaps in Modern Cars Revealed\n\nThe recent report, highlighted by Ethereum co-founder Vitalik Buterin, reveals serious privacy concerns in modern vehicles, often referred to as “computers on wheels.”\n\nReminder: modern cars are highly networked computers and are a privacy nightmare. Very under-explored sector for privacy improvements. Some \"fancy ZK\" but also some plain boring \"collect and track less stuff please\".https://t.co/dWOga6SMcI — vitalik.eth (@VitalikButerin) January 26, 2024\n\nThe study evaluated 25 car brands, all of which received a “Privacy Not Included” warning, indicating notable privacy deficiencies.\n\nThe study claims :\n\n“All but two of the 25 car brands we reviewed earned our “ding” for data control, meaning only two car brands, Renault and Dacia (which are owned by the same parent company) say that all drivers have the right to have their personal data deleted.”\n\nModern computerized vehicles are gathering extensive user data , from personal traits and location to driving habits, which goes beyond vehicle operation and is crucial for business activities like marketing.\n\nThe study also found that 56% of these brands share data with government authorities upon request, and 86% reportedly sell or share this information. Alarmingly, 92% of drivers in modern vehicles have no control over the data collected.\n\nThe report stated :\n\n“It’s bad enough for the behemoth corporations that own the car brands to have all that personal information in their possession, to use for their own research, marketing, or the ultra-vague “business purposes.” But then, most (84%) of the car brands we researched say they can share your personal data — with service providers, data brokers, and other businesses we know little or nothing about. Worse, nineteen (76%) say they can sell your personal data.”\n\nWhat are ZK-Rollups? We researched it, so you don't have to. 🎯 ZK stands for Zero-Knowledge. A kind of proof that mathematically validates the correctness of transactions without revealing their exact details. So, in one word, Privacy. 🎯 Rollup is a kind of Layer 2 (chain… pic.twitter.com/wON1730b5p — Dexifier (@DexifierX) January 22, 2024\n\nButerin’s Stance Sparks Social Media Debate\n\nVitalik Buterin’s recent comments on the privacy implications of modern cars have ignited a debate on social media regarding the trade-off between technological progress and privacy.\n\nDiscussions range from enthusiasts considering retrofitting classic cars to bypass contemporary privacy issues, to accusations of Buterin being anti-technology. In response, Buterin has clarified his position, affirming his support for various modern technologies, including certain AI applications.\n\nI embrace life extension, human genetic enhancement, artificial wombs, mind uploading, many kinds of modern AI (eg. I use it to make many pictures in my blog posts), geoengineering, ZK privacy, going to Mars… There's a small-but-important subset of things I worry about! — vitalik.eth (@VitalikButerin) January 26, 2024\n\nHe emphasizes, however, his critical perspective on specific technologies that jeopardize privacy, underlining, “There’s a small-but-important subset of things I worry about!”\n\nAlarming Privacy Implications in the Modern Automotive Industry\n\nThe research has unveiled a troubling landscape in automotive data privacy. Each brand examined has been collecting more personal data than necessary, utilizing it for purposes beyond vehicle operation and customer relationship management. This issue isn’t isolated to the automotive sector; it’s reminiscent of the privacy challenges in mental health apps, yet the potential for data collection in cars is even more expansive. Vehicles can amass personal information through various channels, ranging from in-car interactions and connected services to external data sources like Sirius XM or Google Maps.\n\n.@WTKR3 ’s #CoastLive hosts discuss how cars are collecting and selling your data back to automakers for profit. Hey @CherylNelsonTV & @1AprilWoodard , we don’t like that, either. Sign our petition to demand access & control of your car’s data (via @Change ): https://t.co/ljAZJcDV9r pic.twitter.com/O8CuUBXFu0 — Auto Care Association (@AutoCareOrg) November 28, 2018\n\nDisturbingly, majority of these brands admit to sharing or selling this data. The depth and complexity of this data collection, including sensitive personal details, raise profound privacy concerns.\n\nThis trend suggests that car companies will exploit data privacy to the extent permissible by law. The modern automotive industry, therefore, not only represents a significant privacy risk but also highlights the urgent need for robust privacy regulations to protect consumers in an increasingly data-driven world."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdGhlbWVya2xlLmNvbS9ldGhlcmV1bS1zdHJ1Z2dsZXMtdG8tYnJlYWstMjIwMC16b25lLWFzLWdyYXlzY2FsZXMtZXRmLWFwcGxpY2F0aW9uLXBvc3Rwb25lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Struggles To Break $2200 Zone As Grayscale's ETF Application Postponed - The Merkle Hash",
        "content": "About The Author\n\nWill is a News/Content Writer and SEO Expert with years of active experience. He has a good history of writing credible articles and trending topics ranging from News Articles to Constructive Writings all around the Cryptocurrency and Blockchain Industry."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90di91bmNoYWluZWQvdGhlLWJsYWNrLXN3YW4tZXZlbnQtdGhhdC1jb3VsZC1jYXVzZS1hLWZvcmstaW4tZXRoZXJldW0tYWdhaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "The Black Swan Event That Could Cause a Fork in Ethereum (Again) - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1sZWFkcy13ZWVrbHktYWx0Y29pbi1sb3NzZXMtYXMtd2lkZXItbWFya2V0LXNlbGwtb2ZmLWNvbnRpbnVlcy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Leads Weekly Altcoin Losses as Wider Market Sell-Off Continues - Cryptonews",
        "content": "Ethereum Leads Weekly Altcoin Losses as Wider Market Sell-Off Continues\n\nThe crypto market remains in the red zone with altcoins and pack leader Ethereum (ETH) posting losses two weeks after the approval of spot Bitcoin (BTC) ETF by the United States Securities and Exchange Commission (SEC).\n\nOn-chain data shows the price of several crypto assets trading at monthly lows. This comes in contrast to the uptick in prices towards the end of last year.\n\nThe recent sell-off can be seen across Bitcoin and a slew of altcoins as daily trading volumes of cryptocurrency plunge.\n\nIn the last 24 hours, daily trading volumes stood at $46.27 billion, a 6.61% decline from the previous day. This brings the total crypto market capitalization to $1.56 trillion.\n\nWith asset prices down, decentralized finance (DeFi) volumes have also plummeted and remain at $3.6 billion. At 7% of the entire crypto market, this shows reduced activity and sell-offs.\n\nEthereum Leads The Pack\n\n\n\nEthereum has recorded the biggest loss among altcoins in the top 20 ranked assets across the last seven days with its decline entering double figures.\n\nETH is down by 10.7% in a week at the time of writing and exchanges hands at $2,212, a 0.4% slight slump in the past 24 hours.\n\nLike most assets, Ethereum gained momentum in Q4 2023 after a slow start to the year coming off the 2022 bear market. The altcoin giant recorded 90% profits throughout the year notching institutional inflows and impressive DeFi numbers.\n\nHowever, gains posted in December have been wiped off amid the recent market correction. Bears are currently predicting a slightly lower price in the upcoming weeks. Solana (SOL) and Ripple (XRP) had 6.69% and 6.4% losses in the past week to trade at $87.83 and $0.51 respectively.\n\nLike ETH, massive December gains recorded by SOL have been wiped out as the asset posts a monthly decline of 23.22%. XRP’s monthly losses are at 17.63%. Cardano (ADA) and Avalanche (AVAX) have plunged 5.54% and 7.5% respectively in the past week with a larger 22% and 15.29% in the last 30 days.\n\nBitcoin Is Still in The Sell-off Mix\n\n\n\nAs the altcoin market remains in the red zone, Bitcoin’s correction after the approval of spot ETFs has drawn opinions from several commentators with some stating that this was simply a sell-the-news event.\n\nThe months leading up to the approval were marked with an improved institutional investor appetite as the asset’s price surged to levels not seen in months.\n\nThis was followed by predictions from analysts of a massive price gain after the approval as it became a new window for investors to increase their exposure to the top assets.\n\nMatrixport projected a $50,000 price for the asset in December and with the recent price correction, a new report has been released on a potential price decline to $36,739 before a rebound."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb2x5Z29uLWFjcXVpcmVkLXVzZXJzLTIwMjMtbmVhcmx5LW1hdGNoZXMtZXRoZXJldW0tcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Polygon almost acquired as many users in 2023 as Ethereum: Report - Cointelegraph",
        "content": "Layer-2 scaling network Polygon almost acquired as many crypto users as Ethereum in 2023, according to blockchain analytics firm Flipside.\n\nPolygon, an Ethereum scaling solution, boasted 15.24 million acquired users in 2023, approximately 160,000 short of Ethereum’s 15.4 million.\n\nFlipside defined an acquired user as one who conducted at least two transactions on a particular blockchain, with at least one taking place in 2023.\n\nInterestingly, Polygon led the tally for the first half of 2023 but was ultimately overtaken by Ethereum, which kept the lead throughout the second half of the year.\n\nIs the bull is really here? How can we tell?\n\n\n\nData.\n\n\n\nSentiment isn't the only thing that's changed lately. According to the data, user behavior is shifting — and with it, crypto markets.\n\n\n\nWe cover it all in The Onchain Crypto User Report pic.twitter.com/IsclNOZhJk — Flipside (@flipsidecrypto) January 25, 2024\n\n“Polygon kicked off the year with an impressive 2.8MM acquired users in January — accounting for over 40% of the network’s total acquired users in 2023,” Flipside explained.\n\n“From there, Polygon experienced the most consistent decline in monthly user acquisition over the year in relative terms, but still compared favorably with more other networks.”\n\nBitcoin came in third with 10.65 million acquired users, while Solana and Arbitrum rounded out the top five.\n\nA total of 62 million acquired users were recorded from the eight tracked blockchains, including Optimism, Avalanche and Base. Flipside noted that user acquisition peaked in May before acquired users gradually declined.\n\nAcquired users from various blockchain networks in 2023. Source: Flipside\n\n“The acquired user increase began in March, coinciding with the collapse of Silicon Valley Bank, which may have shaken confidence in centralized entities and ignited a flee to decentralized custody alternatives,” wrote the firm.\n\nRelated: Polygon AggLayer to make multiple blockchains feel like ’a single chain’\n\nFlipside said Base started strong following its launch in August 2023, but its user volume “tampered off” in the final months of 2023.\n\n“Renewed enthusiasm across more established chains near the end of the year may have contributed to the decline in Base’s user growth, given that these networks had more robust, diverse app ecosystems to engage with,” the firm explained.\n\n“However the next bull run may bode well for Base’s user growth, given Coinbase’s efforts to serve as a crypto gateway for new users.”\n\nMagazine: Slumdog billionaire — Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS10by1ob2xkLTJrLXN1cHBvcnQtYXMtd2hhbGVzLWJ1eS1ldGgtZXRmLXJ1bW9yLTE0MDUwODjSAWFodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtdG8taG9sZC0yay1zdXBwb3J0LWFzLXdoYWxlcy1idXktZXRoLWV0Zi1ydW1vci8xNDA1MDg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price to Hold $2k Support as Whales Buy ETH ETF Rumor - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NlbHNpdXMtYmlsbGlvbi1kb2xsYXItZXRoZXJldW0tc2hpZnQtc3RpcnMtc3BlY3VsYXRpb24tb24tY3JlZGl0b3ItcGF5YmFjay1wbGFucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Celsius billion-dollar Ethereum shift stirs speculation on creditor payback plans - CryptoSlate",
        "content": "Bankrupt crypto lending platform Celsius has shifted 459,561 Ethereum (ETH), valued at over $1 billion, to centralized exchanges, including Coinbase, Paxos, and FalconX, in the past 24 hours, per on-chain data.\n\nIn detail, more than 300,000 ETH, equivalent to $673 million, was sent to Coinbase Prime. The firm also moved 146,507 ETH, valued at around $323.3 million, to Paxos, and another 7,800 ETH, worth $17.2 million, were transferred to FalconX.\n\nThis latest transfer follows a series of similar fund movements by Celsius in recent days. On Jan. 24, blockchain investigator Lookonchain reported that the firm deposited 18,000 ETH, worth $40 million, to Coinbase.\n\nMeanwhile, the crypto analytical platform Spot on Chain provided a more in-depth analysis of the transfers. According to the firm, Celsius has deposited 740,321 ETH, worth an estimated $1.69 billion, to centralized exchanges, including FalconX, Coinbase, OKX, and Paxos, since November 2023.\n\nHowever, despite these transactions, the firm still holds a sizeable amount of ETH. Its address retains 62,468 ETH, approximately $139 million as of press time.\n\nWhy is Celsius making these transfers?\n\nSpot On Chain’s analysis suggests the possibility of an over-the-counter (OTC) transaction, as around 97.2% of the total deposited funds to Coinbase were withdrawn to 12 newly created wallets.\n\n“We noticed that 12 fresh wallets have withdrawn 296,835 $ETH (660M) from Coinbase shortly after Celsius deposited $ETH to the CEX, accounting for ~97.2% of the total deposited amount. This is probably an OTC deal,” the firm said.\n\nMeanwhile, the motive behind the transfer remains undisclosed. But it coincides with creditors’ anticipation of a potential repayment launch in February.\n\nOn Jan. 25, the Celsius Newco Community suggested that the firm had an effective date of Jan. 31, with expectations of distributing liquid crypto to Earn Creditors starting mid-February.\n\nA Celsius distribution FAQ hints at Coinbase being the platform of choice for creditor repayments in specific countries. Eighty-nine countries (excluding the United States) are eligible for the Coinbase distribution.\n\nThe Celsius Creditors Community group on social media platform X (formerly Twitter) also includes several creditors of the failed firm, who reveal that they received instructions to prepare for their Celsius distribution via Coinbase."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL3BvbHlnb24vcG9seWdvbi11c2Vycy1ldGhlcmV1bS0yMDIzL9IBQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL3BvbHlnb24vcG9seWdvbi11c2Vycy1ldGhlcmV1bS0yMDIzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Report Shows Polygon Users Rivaled Ethereum In 2023, But Why Has Price Failed To Clear $1? - NewsBTC",
        "content": "Layer-2 network Polygon is reported to have competed with Ethereum in 2023, as both networks saw the most influx of new users. This development has once again raised concerns about MATIC’s price, considering that such an achievement should potentially mean that new money moved into the ecosystem last year.\n\nPolygon and Ethereum Acquired The Most Users In 2023\n\nAccording to a report by Blockchain analytics firm Flipside, Polygon and Ethereum led the pack with 30.6 million acquired users in 2023. Giving a further breakdown, Polygon is said to have acquired 15,24 million users, while Ethereum attracted 15.4 million users. Meanwhile, these users are defined as persons who performed at least two transactions on the networks.\n\nDespite falling about 160,000 short of Ethereum’s numbers, Polygon’s numbers are still impressive, considering that it ranked ahead of other networks like Bitcoin and Solana. The layer-2 network also outperformed other Ethereum L2 networks like Arbitrum, Optimism, and Base, which recorded 7.3 million, 3.3 million, and 1.9 million acquired users, respectively.\n\nNotably, Polygon hit the ground running as soon as 2023 began, setting the record for monthly acquired users with 2 million in January. Interestingly, January 2023 was the first time MATIC rose above $1 in a very long while. It held above that level until the end of April 2023. After that, MATIC traded below that level for most of the year, only rising above $1 towards the end of December 2023.\n\nMATIC price at $0.74 | Source: MATICUSDT on Tradingview.com\n\nWhy Has MATIC Failed To Rise And Hold Above $1\n\nA recent analysis by Blockchain intelligence firm ChainArgos suggested that the Polygon team has been secretly selling off MATIC tokens, something which could have accounted for the significant sell pressures that have risen at different times for the crypto token. This could also serve as a plausible explanation for why MATIC has struggled to hold above $1 despite enjoying great utility.\n\nThe Polygon team was accused of not executing its token allocations in line with the publicly stated plan, with part of the allocated funds accounting for some of the tokens that were sold. These secret sales, which have for long gone under the radar, are said to be circumvented through wallets linked to the crypto exchange Binance.\n\nSo far, about 767 million MATIC have apparently been offloaded in these secret transactions. ChainArgos hinted at how these transactions have no doubt affected MATIC’s price on different occasions, as they noted that the outflows are a “good indicator for an upcoming top and subsequent move lower.”\n\nAt the time of writing, MATIC is trading at around $0.73, up in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image from CoinGape, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9wb2x5Z29uLW5lYXJseS1tYXRjaGVzLWV0aGVyZXVtLWluLWNyeXB0by11c2VyLWFjcXVpc2l0aW9uLWluLTIwMjMuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Polygon Nearly Matches Ethereum in Crypto User Acquisition in 2023 - Cryptonews",
        "content": "Polygon Nearly Matches Ethereum in Crypto User Acquisition in 2023\n\nLayer-2 scaling network Polygon (MATIC) came close to matching Ethereum (ETH) in terms of crypto user acquisition in 2023.\n\nAccording to blockchain analytics firm Flipside, Polygon acquired an impressive 15.24 million users during the year, falling just shy of Ethereum’s 15.4 million users.\n\nTo define an “acquired” user, Flipside considered individuals who conducted at least two transactions on a specific blockchain, with at least one transaction occurring in 2023.\n\nIs the bull is really here? How can we tell? Data. Sentiment isn't the only thing that's changed lately. According to the data, user behavior is shifting — and with it, crypto markets. We cover it all in The Onchain Crypto User Report 🧵📊👇 pic.twitter.com/IsclNOZhJk — Flipside 📊 (@flipsidecrypto) January 25, 2024\n\nPolygon Exceeded Ethereum in User Acquisition in First Half\n\n\n\nNotably, Polygon took the lead in user acquisition during the first half of the year but was eventually surpassed by Ethereum, which maintained its lead throughout the second half.\n\nFlipside highlighted Polygon’s strong start to the year, with 2.8 million acquired users in January alone, accounting for over 40% of the network’s total acquired users for 2023.\n\n“From there, Polygon experienced the most consistent decline in monthly user acquisition over the year in relative terms, but still compared favorably with more other networks,” the report added.\n\nWhile Polygon experienced a relatively consistent decline in monthly user acquisition throughout the year, it still fared favorably compared to other networks.\n\nBitcoin secured the third position with 10.65 million acquired users, while Solana and Arbitrum rounded out the top five.\n\nIn total, the eight tracked blockchains recorded 62 million acquired users, which included Optimism, Avalanche, and Base.\n\nFlipside observed that user acquisition peaked in May before gradually declining.\n\nFlipside noted a possible connection between the increase in acquired users and the collapse of Silicon Valley Bank in March, which may have led to a loss of confidence in centralized entities, prompting a shift towards decentralized custody alternatives.\n\n“The acquired user increase began in March, coinciding with the collapse of Silicon Valley Bank, which may have shaken confidence in centralized entities and ignited a flee to decentralized custody alternatives.”\n\nBase Saw a Decline in User Base after Strong Growth\n\n\n\nRegarding Base, which launched in August, Flipside stated that it enjoyed a strong start but experienced a tapering off in user volume towards the end of 2023.\n\nThe firm attributed this decline to renewed enthusiasm for more established chains with robust and diverse app ecosystems.\n\nHowever, Flipside believes that Base’s user growth could benefit from the next bull run, especially considering Coinbase’s efforts to serve as a gateway for new users in the crypto space.\n\nAs reported, Ethereum-based layer 2 network Arbitrum now has a market share of 49.17% among layer 2 networks, far surpassing number two on the list, Optimism Mainnet, with its 28.85% market share.\n\nThe network has also seen a consistent increase in its TVL at least since October last year, rising about 50% from $1.66 billion in October to the current value of $2.51 billion, data from DeFi tracking site DefiLlama showed.\n\nThe upcoming Ethereum Dencun upgrade, incorporating changes proposed by EIP-4844, is expected to reduce rollup transaction costs, benefiting layer 2 solutions like Arbitrum by lowering gas fees and improving network capacity."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9hZnRlci1ibGFja3JvY2stZ3JheXNjYWxlLWRlbGF5ZWQtZGVjaXNpb24tc2VjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "After Blackrock Comes Grayscale, Another Delayed Decision by the SEC - CCN.com",
        "content": "Key Takeaways\n\nThe SEC has delayed its decision on an application by Grayscale Investments to convert its ETHE into an ETF.\n\nThe regulator asked for public input on whether a spot Ethereum ETF would bear similarities to its BTC counterpart.\n\nSome experts predict that spot Ethereum-ETFs could be approved by the summer of 2024.\n\nThe U.S. Securities and Exchange Commission (SEC) has deferred its decision on an application by Grayscale Investments to transform its Ethereum trust product (ETHE) into an exchange-traded fund (ETF).\n\nThis move comes just a day after the SEC delayed a decision on BlackRock’s application for a comparable ETF.\n\nPostponed Decision on Grayscale’s Ethereum Trust ETF Conversion\n\nHistorically, the SEC has been hesitant to approve spot crypto ETF products, having only recently allowed the launch of a series of spot Bitcoin ETFs in the U.S. earlier in January.\n\nSpot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd https://t.co/2zBBvHkrVk — James Seyffart (@JSeyff) January 24, 2024\n\nAs the SEC recently approved spot Bitcoin ETF applications, issuers, and exchanges responded by filing updated documents to address the regulator’s queries. The current status of the spot Ethereum ETF applications in this regard remains uncertain.\n\nThis week’s developments include the SEC inviting public input on several questions related to these applications. A key query for consideration is whether a spot Ethereum ETF would bear similarities to its Bitcoin counterpart, indicating a new phase of scrutiny and public engagement in the process of evaluating Ethereum-based ETFs.\n\nThe filing asked :\n\n“Do commenters agree that arguments to support the listing of Bitcoin ETPs apply equally to the Shares? Are there particular features related to ETH and its ecosystem, including its proof of stake consensus mechanism and concentration of control or influence by a few individuals or entities, that raise unique concerns about ETH’s susceptibility to fraud and manipulation?”\n\nKey Queries on Ethereum ETFs Mirror Bitcoin Concerns\n\nIn its review of the spot Ethereum ETF applications, the SEC is posing questions similar to those asked during the evaluation of Bitcoin ETFs. These inquiries delve into issues of market manipulation, the correlation between spot and futures markets, and whether the CME futures market for Ethereum is sufficiently large.\n\nThe final deadline for the Spot #Ethereum ETF is in 124 days! pic.twitter.com/vjSpzGWsUG — Crypto Rover (@rovercrc) January 22, 2024\n\nAmid regulatory deliberations, optimists are predicting that spot Ethereum-ETFs could be adopted by the summer of 2024. This optimistic outlook hinges on a forthcoming decision by the CFTC and the SEC, which is expected to clarify whether Ethereum, the second-largest cryptocurrency by capitalization, does not meet the criteria of a security.\n\nReporting on the timeline for a potential $ETH ETF approval has turned up a plethora of different takes from ETF issuers, investment management firms and sources close to the @SECGov . ✨One $BTC Spot ETF issuer with an ETH Spot ETF application says they’re confident the… — Eleanor Terrett (@EleanorTerrett) January 23, 2024\n\nExperts suggest that the ongoing trial involving Binance could provide much-needed clarity regarding Ethereum’s status in terms of securities law.\n\nSEC Commissioner Talks Ethereum ETF Approval\n\nHester Peirce, often called “Crypto Mom” for her positive stance on cryptocurrencies, has highlighted the correlation between futures and spot markets in cryptocurrencies, which could influence the SEC’s decision-making process. Her… — guardando user (@notouchbitch) January 26, 2024\n\nBinance’s Challenges Signal a Path to Mainstream Crypto Adoption\n\nThis anticipation stems from discussions in previous meetings, particularly the reference to DAO tokens being considered securities. The outcome of the Binance trial is seen as potentially pivotal in establishing a clearer regulatory framework for Ethereum and similar cryptocurrencies.\n\nBinance’s regulatory challenges are indicative of a broader trend affecting the crypto industry, with global regulators increasingly demanding transparency from crypto exchanges. This heightened scrutiny isn’t limited to regulatory bodies; major banks have also limited Binance’s access, reflecting a broader reevaluation of their stance on crypto.\n\nThe primary concerns cited are risks related to money laundering. However, this intensified regulatory focus on Binance and other crypto firms doesn’t signal an end for the industry. Instead, it suggests the onset of a more regulated and potentially mainstream future for crypto assets and exchanges."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3Mvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1ibGFja3JvY2tzLXNwb3QtZXRoZXJldW0tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays Decision on BlackRock's Spot Ethereum ETF - - Altcoin Buzz",
        "content": "The SEC has reportedly pushed back on deciding on BlackRock’s proposal for a spot in Ethereum ETF. The US regulator said it needed more time to review the proposal.\n\nThe SEC explained in its filing, “The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.”\n\nSEC Postpones Ruling on BlackRock’s Proposed Spot Ethereum ETF\n\nWednesday’s delay is the first of many delays the SEC could use during a 250-day window. BlackRock applied for its spot Ethereum ETF, known as the iShares Ethereum Trust, late last year, joining other institutions with similar interests.\n\nSpot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd https://t.co/2zBBvHkrVk — James Seyffart (@JSeyff) January 24, 2024\n\nBloomberg Intelligence ETF analyst, James Seyffart, took to X to share his views on the spot Ethereum ETF applications. Seyffart expects the SEC to continue its delay tactics, as it did with bitcoin ETFs last year.\n\nHowever, another Bloomberg analyst, Bloomberg Eric Balchunas, believes the regulator could likely make a final decision for all applications in May, as most of the applicants have a deadline of May, June, and August.\n\nFor those wondering.. the SEC isn't in a legal position to deny. Why? Because they approved a commodities futures ETH ETF just months ago. They've literally already consented to Ethereum being a commodity by way of approval. This is not opinion or emotion.. this is fact. — Etherean Maximus ⚔️ (@EthereanMaximus) January 24, 2024\n\nBlackRock and other institutions faced an uphill battle in securing the SEC’s approval for a spot Bitcoin ETF. However, Hester Pierce, an SEC Commissioner, assured applicants that a legal battle won’t be necessary to get the SEC to approve a spot Ethereum ETF.\n\nShe wrote, “We shouldn’t need a court to tell us that our approach is ‘arbitrary and capricious’ for us to get it right.”\n\nCrypto Enthusiasts Express Mixed Feelings\n\nCrypto experts have expressed mixed feelings about the prospect of a spot ether ETF. Some believe approval may come during the second quarter of the year. However, Gary Gensler, the chair of the SEC, in a recent media briefing, shot down the concept of other cryptocurrency-linked exchange-traded products.\n\nHe said, “As I said two weeks ago, that which we did about bitcoin exchange-traded products is cabined to this one commodity non-security and shouldn’t be read to be anything other than that.”\n\nThe SEC delays the approval of BlackRock Ethereum spot ETF. You and I know it can be delayed multiple times but it’s invevitable. Solana ETFs would be next😮‍💨 pic.twitter.com/kEigMNmMTI — Loretta Crypto (@LorettaKrypto) January 24, 2024\n\nInterestingly, the president and COO of ARK Invest, Tom Staudt, is optimistic about the possibility of Ethereum ETFs. Staudt believes the progressive communication with regulators is a positive sign, noting that “this is not the same place where we were on the timeline with Bitcoin at this stage.”\n\nStaudt also points out that the successful approval of spot Bitcoin ETFs has contributed to the increased legal, operational, and philosophical knowledge of potential issuers.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. Copyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXdlYjMtY3J5cHRvcy1wb3RlbnRpYWwtbWFqb3ItMTc1ODQ0MzU1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "3 Web3 Cryptos With the Potential for Major Metaverse Moves - Yahoo Finance",
        "content": "The metaverse hype train veered sharply off the tracks in late-2021 as crypto markets soured. This left many virtual worlds feeling more like ghost towns. But while metaverse mania has cooled considerably, I believe the long-term growth narrative for Web3 and immersive digital environments remains intact. Cyclical downturns are par for the course in crypto, and today’s laggards can spearhead gains when the next bull run begins.\n\nSeveral catalysts on the horizon could re-ignite “meta mania” and crypto bullishness more broadly in 2024 and beyond. More Bitcoin (BTC-USD) ETF approvals, block reward halvings, and potential Fed rate cuts could all fuel digital assets. We’ll look at some top projects today instead of small-cap cryptos. Here are three to consider based on their ties to Web3 and the metaverse.\n\nEthereum (ETH-USD)\n\nA coin with the Ethreum logo on top of a financial document\n\nSource: shutterstock\n\nEthereum (ETH-USD) remains the go-to cryptocurrency for anyone seeking major exposure to the Web 3.0 ecosystem. Even if the recent metaverse and NFT frenzies have cooled, Ethereum still stands as the leading blockchain underpinning countless decentralized apps and services.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nEthereum’s key edge over Bitcoin relates to its support for smart contracts and advanced functionality beyond payments. As the dominant Web3 blockchain, most projects being built in areas like DeFi, NFTs, and the metaverse, increasingly rely on Ethereum’s global computing network. Users of these apps must pay gas fees in Ethereum, creating perpetual demand even during bear markets.\n\nThis wide utility and role as the “fuel” of Web3 is why Ethereum has massively outperformed Bitcoin in previous bull runs. And with the major Dencon upgrade slated to launch by mid-2024, I expect Ethereum’s advantage over Bitcoin to widen further in the next cycle. Dencon aims to slash Ethereum gas fees by up to 90% while accelerating layer-2 scaling solutions.\n\nSo, if we do get an influx of new crypto buyers and restore Web3 hype, I anticipate Ethereum providing major upside. We could see surging decentralized application usage, NFT sales volume growth, and higher gas consumption pushing Ethereum prices significantly higher, perhaps even to new highs. For broad exposure to a potential Web3 resurgence, Ethereum remains the leading crypto to consider.\n\nStory continues\n\nSolana (SOL-USD)\n\nAbstract 3d rendered coin solana (SOL-USD)\n\nSource: solvertv / Shutterstock.com\n\nEven if the upcoming Dencon cuts Ethereum fees and enhances layer-2 capabilities, transacting and building on Ethereum will likely remain pricier and more cumbersome than alternatives like Solana (SOL-USD).\n\nWith lightning-fast speeds and rock-bottom fees, Solana presents a compelling Web3 option for both developers and users. It has already successfully peeled off market share from Ethereum in NFT trading volume and other areas like DeFi.\n\nI expect the network effects and composability benefits of building on a high-activity chain like Solana to help it gain additional traction if we enter a fresh bull cycle, particularly if congestion and high gas fees resurface on Ethereum amid surging usage.\n\nOf course, Solana still has progress to make, notably in improving its network reliability and uptime. However, the Solana team has made big strides in optimizing stability and mitigating outages over the past year.\n\nGiven the immense room for adoption and growth, I think Solana’s price levels around $90 per token seem attractive. Despite its early-stage flaws, Solana remains one of my top altcoin picks for mega returns if the Web3 and metaverse themes catch fire again.\n\nRender Token (RNDR-USD)\n\nThe Render (RNDR) crypto logo displayed on a smartphone screen.\n\nSource: Maurice NORBERT / Shutterstock.com\n\nUnlike Ethereum and Solana, which are essentially generalized Web3 blockchains, Render Token (RNDR-USD) and the Render Network target a specific niche – GPU graphics processing power.\n\nRender operates a network that lets users easily buy and sell excess graphics and compute resources for rendering 3D visuals, animations, models, and more. This on-demand access allows smaller creators to tap into strong GPU performance without substantial up-front investment.\n\nAs metaverse and Web3 content creation pick back up, Render stands to see surging demand from various verticals like architectural and product visualization, special effects, advertisements, video game development, and VR/AR experiences.\n\nIn fact, Render’s native token RNDR has already rocketed higher in recent months – surging from around 40 cents to current levels approaching $4. I expect this momentum to continue over 2023 and 2024 if the overall environment improves for cryptos and its futuristic applications.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Web3 Cryptos With the Potential for Major Metaverse Moves appeared first on InvestorPlace."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNi9jcnlwdG8tdHJhZGVyLW1pY2hhZWwtdmFuLWRlLXBvcHBlLXByZWRpY3RzLXRvcC1ldGhlcmV1bS1yaXZhbC10by1zdXJnZS1ieS1vdmVyLTE2MC11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMjYvY3J5cHRvLXRyYWRlci1taWNoYWVsLXZhbi1kZS1wb3BwZS1wcmVkaWN0cy10b3AtZXRoZXJldW0tcml2YWwtdG8tc3VyZ2UtYnktb3Zlci0xNjAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Crypto Trader Michaël van de Poppe Predicts Top Ethereum Rival Will Surge by Over 160%, Updates Outlook on Bitcoin - The Daily Hodl",
        "content": "The widely followed cryptocurrency analyst and trader Michaël van de Poppe believes that one of the major competitors of Ethereum (ETH) could more than double its price from the current level.\n\nVan de Poppe tells his 685,900 followers on the social media platform X that a correction in the crypto market has presented many opportunities, one of them being Polkadot (DOT).\n\nAccording to the widely followed analyst, Polkadot could rally by about 164% from the current level to $17.\n\nBased on Van de Poppe’s chart, the analyst sees DOT facing “crucial resistance” at around $9.39 after retesting the support level at around $5.50 to $6.00.\n\nPolkadot is trading at $6.45 at time of writing.\n\nNext up is Bitcoin (BTC). According to Van de Poppe, the flagship crypto asset is inching towards the final stages of a correction. According to the widely followed crypto analyst, Bitcoin is in a range that spans from a low of between $36,000 to $39,000. Based on Van de Poppe’s chart, the range’s high is just above $51,200, a level last reached in December of 2021.\n\nBitcoin is trading at $39,890 at time of writing.\n\nTurning to altcoins, Van de Poppe says that there’s an opportunity amid the negative sentiment and a double-digit correction.\n\n“Altcoins going into a 30% – 50% correction.\n\nPeople start to lose faith after the approval of the spot Bitcoin exchange-traded funds (ETFs).\n\nNegative news is getting into the spotlight.\n\nTime to load on the positions.\n\nThis is a great, and possibly final dip, to get yourself in.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tcmVjb3ZlcmluZy1wdXNoZC1hbmQtcG9sa2Fkb3QtdmllLWZvci10b3AtY3J5cHRvLXBvc2l0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum recovering, Pushd and Polkadot vie for top crypto position - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nThe crypto market constantly evolves, with new and innovative projects emerging daily. Some popular platforms include Polkadot (DOT) and Ethereum (ETH), each with unique strategies to redefine the market.\n\nAmong them is Pushd (PUSHD), a crypto project currently conducting its presale.\n\nEthereum staking platform secures $17m, sparks positive sentiment\n\nEthereum has a robust ecosystem for creating and implementing decentralized apps (dapps) and smart contracts.\n\nAs a result, its decentralized finance (defi) has a total value locked (TVL) of over $30.7 billion.\n\nKiln, a staking platform on Ethereum, recently announced a successful $17 million funding round to democratize value creation.\n\nYou might also like: Ethereum whales spotted buying dips: Bullish price signal?\n\nThis development has improved Ethereum’s outlook, a net positive as the market recovers.\n\nEthereum is trading at $2,208, up 43% in the past year, and may recover after the recent retracement.\n\nPolkadot remains under pressure\n\nPolkadot promotes blockchain interoperability.\n\nIt seeks to provide a secure and efficient platform for different blockchains to exchange data.\n\nHowever, DOT, its native currency, has been under pressure, fluctuating between $6.04 and $7.46.\n\nAs per the Directional Movement Index (DMI) indicator, DOT remains under pressure at spot rates.\n\nCrypto enthusiasts exploring Pushd\n\nThe eCommerce market may reach $8 trillion by 2024.\n\nPushd, a new marketplace, has already shown strong demand before its official launch.\n\nIts unique selling point is that it is built on a web3 platform. It offers a decentralized online marketplace that allows for peer-to-peer (P2P) commerce without intermediaries and excessive fees.\n\nYou might also like: Pushd picks up pace as Bitcoin and Litecoin holders flow\n\nMarket analysts predict PUSHD will rise above $3, buoyed by improving buyer sentiment.\n\nThere are over 22,000 sign-ups in the ongoing presale as PUSHD changes hands at $0.075 in the current stage.\n\nConclusion\n\nThe crypto market is fluctuating, with ETH likely to recover. Pushd and Polkadot will likely emerge stronger in the upcoming bull run. For this reason, more investors appear to be exploring Pushd, whose presale is ongoing.\n\nRead more: Chainlink and Litecoin investors examining Pushd presale\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yNi91LXMtc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1ncmF5c2NhbGUtYW5kLWJsYWNrcm9jay1zcG90LWV0aGVyZXVtLWV4Y2hhbmdlLXRyYWRlZC1mdW5kLWFwcGxpY2F0aW9ucy_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMjYvdS1zLXNlYy1kZWxheXMtZGVjaXNpb24tb24tZ3JheXNjYWxlLWFuZC1ibGFja3JvY2stc3BvdC1ldGhlcmV1bS1leGNoYW5nZS10cmFkZWQtZnVuZC1hcHBsaWNhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "U.S. SEC Delays Decision on Grayscale and BlackRock Spot Ethereum Exchange-Traded Fund Applications - The Daily Hodl",
        "content": "Federal securities regulators say they need a longer period to consider asset managers Grayscale Investments and BlackRock’s applications for an Ethereum (ETH) exchange-traded fund (ETF).\n\nIn an order dated January 24th, the U.S. Securities and Exchange Commission (SEC) says it is extending the period to decide on a proposed rule change to convert the Grayscale Ethereum Trust (ETHE) product into an ETF.\n\n“On December 5, 2023, pursuant to Section 19(b)(2) of the Act, the Commission designated a longer period within which to approve the proposed rule change, disapprove the proposed rule change, or institute proceedings to determine whether to disapprove the proposed rule change. This order institutes proceedings under Section 19(b)(2)(B) of the Act to determine whether to approve or disapprove the proposed rule change.”\n\nThe SEC is also postponing the issuance of its decision on an application filed by the Nasdaq Stock Market in November to list and trade BlackRock’s iShares Ethereum Trust. The securities watchdog says it will decide on the proposal by March 10th instead of January 25th.\n\n“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.”\n\nLast week, the SEC also issued a notice saying it needs more time to consider approving banking giant Fidelity’s spot market Ethereum ETF. The agency says it is postponing its decision until March 5th.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM3MDY5L2RhaWx5LW1hcmtldC11cGRhdGUtZm9yLWphbnVhcnktMjYtMjAyNC_SAU9odHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8zNzA2OS9kYWlseS1tYXJrZXQtdXBkYXRlLWZvci1qYW51YXJ5LTI2LTIwMjQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "ENS up +12.95%, BTC +0.58%, Ethereum Name Service is The Coin of The Day - Daily Market Update for Jan 26, 2024 - CoinCodex",
        "content": "ENS up +12.95%, BTC +0.58%, Ethereum Name Service is The Coin of The Day - Daily Market Update for Jan 26, 2024\n\nKey highlights:\n\nThe total cryptocurrency market cap decreased from $ 1.57T to $ 1.56T in the past 24 hours, representing a -0.41% change\n\nchange The Bitcoin price at press time is $ 40,106 after growing by 0.58% in the last 24 hours\n\nin the last 24 hours The total crypto trading volume decreased by -0.41% in the past 24 hours, and is currently at $ 157.44B\n\nin the past 24 hours, and is currently at $ 157.44B All prices and changes are presented at the time of publication: January 26, 2024, at 06:00 UTC\n\nMarket Overview\n\nThe total cryptocurrency market cap is currently $ 1.56T after a -0.41% decrease on the day. The total crypto trading volume declined by -0.41% in the same time frame.\n\nBitcoin is trading at $ 40,106 after seeing a 0.58% gain in the last 24 hours. The Bitcoin dominance grew by 0.22% and BTC currently represents 50.32% of the cryptocurrency market.\n\nTop Coins By Market Cap\n\nAt press time, Bitcoin has a market capitalization of $ 786.43B after gaining 0.58% in the last 24 hours. According to our forecast, the value of Bitcoin will drop by -1.58% and reach $ 39,471 by January 31, 2024. To learn more about how the price of Bitcoin could change over the next 7 days, visit our Bitcoin price prediction page.\n\nEthereum, which is the second-largest cryptocurrency by market cap, is priced at $ 2,226.93 and has a market capitalization of $ 267.63B. ETH increased by 0.50% in the last 24 hours. If you're interested in where the price of Ethereum could head next, check out the Ethereum price prediction.\n\nBears Dominate the Market Today\n\nThe bears dominated the market today as 79% of coins lost value in the last 24 hours.\n\nToday's Top Gainers are Ethereum Name Service, Dogwifhat, and Chromia\n\nThanks to a 12.95% price increase, Ethereum Name Service was the biggest gainer of the day among the top 200 cryptocurrencies by market cap. Dogwifhat came in second place, with 24-hour gains of 10.35%. Chromia, Optimism and Lido DAO Token complete today's list of the top cryptocurrency gainers.\n\nToday's Top Losers are NEM, Huobi Token, and Sui Crypto\n\nUnfortunately, not all coins performed well today. The worst performer in the cryptocurrency top 200 was NEM, which saw a loss of -19.08%. Huobi Token also didn't perform well, as its price declined by -6.46% in the last 24 hours. Sui Crypto, Helium Mobile and Kadena round out today's top 5 worst performers.\n\nPendle reached new All-Time High after gaining +126.96% in the last month\n\nThe following coins in the cryptocurrency top 200 hit new all-time high prices today:\n\nPendle's new ATH is $ 2.59\n\nCongratulations to the HODLers!\n\nCoin of the Day is Ethereum Name Service\n\nThanks to its impressive 12.95% performance, Ethereum Name Service is today's coin of the day! Ethereum Name Service is currently trading at $ 19.60. Learn more about Ethereum Name Service and its position in the market on our Ethereum Name Service price prediction page.\n\nOur technical indicators show that the current Ethereum Name Service sentiment is Bullish.\n\nBuy/Sell Ethereum Name Service"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL2V0aGVyZXVtLWxheWVyLTJzLWluY3JlYXNpbmdseS1jb21wZXRpdGl2ZS1sYW5kc2NhcGUtMjAyNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum layer-2's will face an increasingly competitive landscape in 2024: Flipside - Crypto Briefing",
        "content": "Share this article URL Copied\n\nEthereum layer-2 blockchains (L2) could start a war on which one of them offers the lowest cost fees in 2024, according to a Jan. 25 report by on-chain data platform Flipside. This dispute could happen if a bull run starts in 2024, raising transaction costs for Ethereum and making users look for alternatives.\n\nMoreover, a more competitive environment for L2s could result in smaller margins for the projects, better user experience, and renewed interest in those chains’ governance tokens, such as OP, ARB, and POL. Ultimately, Flipside analysts believe that this war will accelerate the adoption of EVM-compatible blockchains.\n\nEVM stands for Ethereum Virtual Machine, which can be simply understood as the software translating and executing smart contracts commands. Thus, the existence of a decentralized application like Uniswap or Aave needs an EVM to process the information sent from their smart contracts.\n\nAnother catalyst for a wider Ethereum L2 adoption is the upgrade Dencun, set to happen in 2024’s first semester, which will introduce ‘blobs’. Blobs are transactions capable of handling large amounts of data and can be attached to Ethereum’s blocks. As a result, L2 will be able to use those blobs to store transaction data, freeing up more space in Ethereum’s blocks and raising L2’s throughput.\n\nNew market participants\n\nFlipside’s report also mentions expectations around more blockchains being launched in 2024 than during the previous year. This could mean that more blockchains with specific use cases will capitalize on each network’s advantages.\n\nThose new chains will emerge to meet new and existing demand, and Ethereum L2s might have to fight for users’ interest, since there’s still an appetite for new blockchains, according to Flipside.\n\nBesides, the report underscores that new blockchains were still relatively new during the bull run seen between 2020 and 2021. However, those chains have made significant developments in the last two years regarding cross-chain interactions and transfers, making it easier for Web3 users to interact with multiple chains.\n\nWhile most crypto users will continue to engage with one single chain, the report points out, “the overall crypto community will become more mobile, flexible, and willing to move across different chains to capitalize on various opportunities”. Therefore, on top of their war on Ethereum’s ecosystem, L2s may face more external competition this year."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tZXRoLWFuZC1wYW5kb3NoaS1wYW1iby1wb3NpdGlvbmVkLWZvci10aGUtdXBjb21pbmctYnVsbC1tYXJrZXQtc3VyZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) and Pandoshi (PAMBO): Positioned for the Upcoming Bull Market Surge - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nIn the fast-paced world of cryptocurrencies, where innovation and potential are constantly reshaping the market, two standout tokens are poised for a significant impact in the upcoming bull market surge. Ethereum (ETH), a stalwart of the blockchain industry, and Pandoshi (PAMBO), an emerging force with a unique approach, are capturing the attention of both seasoned investors and newcomers alike.\n\nWhile Ethereum has long held its position as the second-largest cryptocurrency by market capitalization, Pandoshi is rapidly ascending, driven by its dedicated community and forward-thinking strategies.\n\nEthereum (ETH): The Trailblazing Pioneer\n\nEthereum, often hailed as the trailblazer of blockchain technology, has firmly secured its position as the second-largest cryptocurrency by market capitalization. Launched in 2015 by the visionary Vitalik Buterin, Ethereum introduced a decentralized platform powered by blockchain technology to the world. At the heart of this ecosystem lies its native token, ETH, which serves as the lifeblood of the network.\n\nThe significance of Ethereum extends beyond its market ranking. It has become a cornerstone of the decentralized finance (DeFi) space, revolutionizing traditional financial systems. Ethereum’s blockchain enables a wide range of financial instruments, including lending, borrowing, and trading, all without the need for reliance on traditional financial institutions. This innovation has unlocked new opportunities for users worldwide, empowering them to take control of their financial activities.\n\nDespite recent market turbulence that may raise concerns, Ethereum stands on a foundation of strength. Its fundamentals remain robust, with a thriving community of developers continuously working on improvements and enhancements. Ethereum’s dynamic ecosystem is influenced by various factors, including network upgrades, adoption by businesses, and market sentiment. While it has faced challenges along the way, the potential for Ethereum to thrive in the next bull market surge remains a topic of discussion among experts.\n\nAs Ethereum continues to make significant strides, the spotlight is also shining on Pandoshi (PAMBO), a cryptocurrency priced at a mere $0.008. This emerging player is gaining attention for its impressive performance during its ongoing presale stage and its potential for substantial growth in the upcoming bull run.\n\nClick Here To Take Part In Pandoshi Presale\n\nPandoshi (PAMBO): The Emerging Contender\n\nPandoshi, with its dedicated community and a wide range of utilities within its ecosystem, has positioned itself as a promising contender in the crypto space. The project’s unique approach includes a deflationary token model, aligning with the current trends favoring scarcity and value preservation. This model involves the gradual reduction of the token supply over time, a feature that appeals to investors seeking assets with growth potential.\n\nThe Pandoshi platform boasts a comprehensive and dynamic ecosystem, centered around a Layer-2 Network utilizing the Proof of Stake protocol. This choice underscores the project’s commitment to eco-friendliness, offering a greener alternative to traditional Proof of Work methods. The ecosystem encompasses various elements: a decentralized exchange, the recently released Pandoshi Wallet on the Google Play Store, offering secure and user-directed control, immersive Metaverse gaming, educational programs, and cryptocurrency-friendly prepaid cards. PAMBO, the native token initially introduced on the Ethereum blockchain, is integral to the functionality and success of this diverse ecosystem.\n\nIn the ongoing presale phase, Pandoshi has showcased resilience and strong backing from its community. Experts in the crypto sphere have taken note of Pandoshi’s potential to surge in value during the anticipated bull market. As investors and enthusiasts seek opportunities beyond the established giants, Pandoshi’s presence in the market offers a fresh perspective.\n\nConclusion: A Tale of Two Tokens\n\nAs the cryptocurrency market enters a new phase of potential growth, Ethereum (ETH) and Pandoshi (PAMBO) are positioned on different points of the spectrum. Ethereum, with its established reputation and fundamental strength, is poised to continue its journey as a blockchain powerhouse, driving innovation in the DeFi space. Meanwhile, Pandoshi, as an emerging contender, has captured the attention of experts and investors alike, showcasing its potential for significant growth in the upcoming bull market.\n\nThe crypto world remains dynamic and filled with opportunities, and the stories of Ethereum and Pandoshi exemplify the diverse paths that tokens can take in this ever-evolving landscape. Whether you place your faith in the established giant or the rising star, one thing is clear: the crypto market is never short of surprises, and the next bull market surge could bring forth exciting developments for both these tokens and their communities but notwithstanding, watch out for Pandoshi (PAMBO).\n\nClick Here To Take Part In Pandoshi Presale\n\n\n\nVisit the links below for more information about Pandoshi (PAMBO):\n\n\n\nWebsite: https://pandoshi.com/\n\nWhitepaper: https://docs.pandoshi.com/"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9jZWxzaXVzLW1vdmVzLTFiLWluLWV0aGVyZXVtLWFzLWV0ZnMtZ2V0LWRlbGF5ZWQtd2hhdC1uZXh0LWZvci1ldGgv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2NlbHNpdXMtbW92ZXMtMWItaW4tZXRoZXJldW0tYXMtZXRmcy1nZXQtZGVsYXllZC13aGF0LW5leHQtZm9yLWV0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Celsius moves $1B in Ethereum as ETFs get delayed – What next for ETH? - AMBCrypto News",
        "content": "Celsius moved $1 billion worth of ETH.\n\nETH ETF approval got delayed, but price of ETH remain unaffected.\n\nThe now-inoperative crypto lending platform Celsius made significant transfers of Ethereum [ETH] to centralized exchanges over the last few days. The latest transaction involved a substantial 459,561 ETH, valued at around $1 billion at press time.\n\nBig ETH moves\n\nThe reason for the ETH transactions remained unclear.\n\nHowever, according to an earlier report, Celsius had initiated a process of recalling and rebalancing its assets, part of which was unstaking its ETH holdings. This was to meet the troubled crypto lender’s liabilities under the bankruptcy proceedings.\n\nNevertheless, the recent transactions gave boost to creditor expectations that Celsius will start repaying them soon.\n\nAt the same time, there is a possibility that these transactions may add further selling pressure on ETH, causing its price to decline.\n\nAt press time, ETH was trading at $2,221.23 and its price had grown by 0.44% in the last 24 hours.\n\nETF uncertainty\n\nApart from the Celsius transfers, another factor that could influence ETH’s price could be the anticipation around the ETH ETF and its approval.\n\nRecently, the U.S. SEC delayed its decision on Grayscale Investments application to transform its Ethereum trust product (ETHE) into an exchange-traded fund (ETF).\n\nSimilarly, the SEC also postponed BlackRock’s application for a similar investment vehicle.\n\nThe delay in the approval of Ethereum ETFs could impact the sentiment around ETH to decline and could cause a negative impact on the price of ETH.\n\nHowever, the progress of Ethereum’s developments could help in countering the FUD caused by these events.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn a recent development call, developers got together to discuss future plans for Ethereum.\n\nThe upcoming Dencun upgrade will play a pivotal role in shaping the narrative around Ethereum in the future and could nudge ETH’s price to move in a positive direction."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vbWFya2V0LW5ld3MveHJwLWxlZGdlci1uZWFycy1ldGhlcmV1bS1jb21wYXRpYmlsaXR5LWEtcGFyYWRpZ20tc2hpZnQtaW4tYmxvY2tjaGFpbi1jb2xsYWJvcmF0aW9u0gF-aHR0cHM6Ly93d3cuY29pbnRydXN0LmNvbS9tYXJrZXQtbmV3cy94cnAtbGVkZ2VyLW5lYXJzLWV0aGVyZXVtLWNvbXBhdGliaWxpdHktYS1wYXJhZGlnbS1zaGlmdC1pbi1ibG9ja2NoYWluLWNvbGxhYm9yYXRpb24vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Nears Ethereum Compatibility: A Paradigm Shift in Blockchain Collaboration - CoinTrust",
        "content": "XRP Ledger Nears Ethereum Compatibility: A Paradigm Shift in Blockchain Collaboration Jan 26, 2024\n\nXRP Ledger Nears Ethereum Compatibility: A Paradigm Shift in Blockchain Collaboration\n\nIn a significant move towards fostering collaboration and innovation within the blockchain space, developers of the XRP Ledger have introduced a transformative update that brings the platform to the verge of achieving Ethereum compatibility. This momentous development not only holds the potential to expedite the adoption of the XRP Ledger but also to attract Ethereum developers keen on working with Solidity.\n\nA Gateway to Ethereum Compatibility\n\nAccording to the latest insights from the dedicated team overseeing this project, the XRP Ledger is poised to become an inviting space for Ethereum developers. The upcoming upgrade aims to achieve seamless compatibility with the Ethereum Virtual Machine (EVM) sidechain, presenting new opportunities for developers deploying smart contracts with Solidity. This move could establish a symbiotic relationship between the XRP Ledger and Ethereum, amplifying the capabilities of both platforms.\n\nSources close to the project reveal: “The XRP Ledger is on the cusp of becoming a welcoming space for Ethereum developers. The upcoming upgrade aims to achieve seamless compatibility with the Ethereum Virtual Machine (EVM) sidechain, opening up new possibilities for developers deploying smart contracts with Solidity.”\n\nProgress Report from Peersyst Technologies\n\nPeersyst Technologies, a key contributor to this groundbreaking upgrade, reports substantial progress in the endeavor. With only a few details left to finalize, the much-anticipated update seems imminent. The launch of the EVM Sidechain is contingent on the implementation of the XChainBridge public amendment, a key component already in the pipeline.\n\nReports suggest: “With only a few details left to iron out, the much-anticipated update appears to be just around the corner. One crucial prerequisite for the launch of the EVM Sidechain is the implementation of the XChainBridge public amendment, a key component that is already in the pipeline.”\n\nConvergence of Blockchain Ecosystems\n\nThis development signifies more than just a technical achievement; it marks the convergence of two prominent blockchain ecosystems. The synergy between XRP Ledger and Ethereum could create an environment where developers can seamlessly navigate between the two platforms, fostering a harmonious integration of technologies.\n\nExperts suggest: “The synergy between XRP Ledger and Ethereum could foster an environment where developers can seamlessly navigate between the two platforms, bringing about a harmonious integration of technologies.”\n\nPotential for Cross-Platform Collaboration\n\nThe prospect of Ethereum developers utilizing Solidity on the XRP Ledger presents a groundbreaking proposition. This cross-platform collaboration has the potential to spur innovation by leveraging the strengths of both ecosystems.\n\nInsiders predict: “The prospect of Ethereum developers utilizing Solidity on the XRP Ledger is a groundbreaking proposition. This cross-platform collaboration has the potential to spur innovation by leveraging the strengths of both ecosystems.”\n\nImplications Beyond Technical Advancements\n\nThe impending integration has sparked discussions within the blockchain community about potential use cases. The XRP Ledger’s embrace of Ethereum compatibility could reshape the dynamics of decentralized applications (DApps). Developers may seamlessly port their existing Ethereum-based DApps to the XRP Ledger, tapping into a new user base and enhancing the overall user experience.\n\nAnalysts posit: “The XRP Ledger’s embrace of Ethereum compatibility could reshape the dynamics of decentralized applications (DApps). Developers now have the prospect of seamlessly porting their existing Ethereum-based DApps to the XRP Ledger, tapping into a new user base and enhancing the overall user experience.”\n\nAnticipation and Industry Impact\n\nAs the finishing touches are applied to the Ethereum compatibility update, the entire blockchain ecosystem stands on the brink of a significant evolution. The integration of these platforms could serve as a catalyst for broader adoption, attracting not only developers but also institutional players looking to explore the diverse opportunities presented by the XRP Ledger.\n\nIndustry observers closely watch: “In the midst of this transformative development, industry observers are closely watching the trajectory of both the XRP Ledger and Ethereum. The collaborative potential of these two platforms has ignited excitement among blockchain enthusiasts, who eagerly anticipate the unveiling of a new era in decentralized technologies.”\n\nConclusion: A Pivotal Moment in Blockchain Evolution\n\nIn conclusion, the imminent Ethereum compatibility of the XRP Ledger marks a pivotal moment in the evolution of blockchain technology. This strategic move aligns with the broader trend of blockchain interoperability, positioning both platforms as frontrunners in driving innovation and collaboration within the decentralized space. As the countdown to the official update continues, the blockchain community eagerly anticipates the dawn of a new era in which Ethereum and XRP Ledger seamlessly coexist, pushing the boundaries of what is possible in the world of decentralized applications."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BhcmFsbGVsLWV2bXMtdnMtYXJiaXRydW0tc3R5bHVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "What are the differences between parallel EVMs and Arbitrum Stylus? - Blockworks",
        "content": "Parallelizing the Ethereum Virtual Machine (EVM) has been a topic of interest for many in the cryptocurrency space in recent weeks.\n\nParallelization increases transaction throughput and improves blockchain scalability by executing multiple transactions simultaneously rather than in the sequential order in which they arrive.\n\nHowever, Rachel Bousfield, tech lead at Offchain Labs, told Blockworks in an interview that people often overstate the value of parallelism.\n\n“The kinds of returns and fee reductions that people expect don’t really play out in practice,” Bousfield said. “A lot of the times when people talk about fees being cut due to parallelism, it’s often cut due to other things that are around it.”\n\nRead more: Parallelized EVMs are gaining popularity, but they won’t scale blockchains alone\n\nBousfield explains that different blockchains have different hardware requirements. In the case of Ethereum, the blockchain is designed to ensure that running a node is relatively inexpensive and that low-end computers are able to meaningfully contribute to the Ethereum network in the form of running applications or running validators.\n\nThis differs from other blockchains, which may enable parallelism, but the cost demands for running a node become much higher.\n\nRyan Watkins is the co-founder of Syncracy Capital, on Solana — a network that does enable parallelism. According to a post by Watkins, it is estimated that the cost to run a node is five times more expensive to run than Ethereum nodes. He said that the network currently has an estimated 40% of the number of nodes that Ethereum has.\n\n“If Ethereum wanted to, they could dramatically increase the demands and costs of running an Ethereum validator, and you would see performance improve, there’d be more capacity, and people’s fees would be lower, but is that really the kind of scaling that Ethereum wants in its future? It’s not clear to me that that would be an advisable decision,” Bousfield said.\n\nRead more: Scaling Ethereum’s virtual machine is a ‘solvable problem,’ says Monad Labs’ Galler\n\nAdditionally, Bousfield notes that parallelism enables throughput to improve efficiency when there are multiple users wanting to do different kinds of things in crypto at the same time.\n\n“The problem is that in real life, the actual demand we see on these blockchain networks is when people want to do very similar things to each other. When there is an airdrop, everyone wants to mint it at the same time. When there is a price discrepancy between DEXs, everybody wants to rush in and get MEV arbitrage out of it,” Bousfield said.\n\nShe notes that the technical term to describe this type of activity is called “contention,” adding that gas prices are often the highest when multiple people hope to do the same thing.\n\nIn fact, a recent study by Polygon Labs shows that parallelism is applicable to around 55% of the transactions in most blocks on its network.\n\n“This means that if parallelism was perfect, had a million cores, and ran really, really fast to the point where everything parallelized was executed instantaneously, you could, at best, double Polygon’s capacity with that,” she explained.\n\nWith that said, Bousfield notes that parallelism itself is not a bad thing, but it is not the silver bullet that many are anticipating.\n\nOn tackling the problem around transaction speeds and ways to increase throughput, Bousfield notes that Arbitrum Stylus achieves this by making it simpler for hardware to read and interpret data.\n\nIn a traditional EVM, when the hardware receives data, it must check that it is accurate, enable branches and simulate it in memory — steps that often take a great deal of time. In contrast, Bousfield notes that Stylus is designed to speak the language of the central processing unit (CPU).\n\n“By removing that layer of interpretation, Stylus is able to get a 10-100x speed on all compute workloads,” she said. “I think that strategies like this are where the big gains are going to be.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbmdlZWsuY29tL2V0aGVyZXVtLWRlY2VudHJhbGl6ZWQtbWFudHJhLWluLXRhdHRlcnMtYWZ0ZXItZXhlY3V0aW9uLW9mLWNsaWVudC1idWcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's decentralized mantra in tatters after execution of client bug - CoinGeek",
        "content": "Ethereum’s claims of decentralization are ringing ever more hollow due to the network’s lack of client software diversity, an overreliance that could pose an existential threat to ETH stakers.\n\nLast weekend, around 8% of Ethereum proof-of-stake (PoS) transaction validators suddenly began producing invalid blocks due to a critical flaw in the Nethermind client software. The issue followed the release of Netherland’s v1.23.0 update, requiring a frantic patch to get these network nodes back in business.\n\nWhile the order was eventually restored, a similar scenario befell the Besu client earlier this month. Besu’s share of the Ethereum execution client market was around 5% at the time and has since fallen to 4%.\n\nEthereum watchers soon warned that the fallout could be catastrophic if/when a similar situation impacted the Geth (Go Ethereum) client. Geth accounted for around 84% of network execution clients at the time of the Nethermind bug, but a concerted effort to sound the ‘eggs in one basket’ alarm has since pushed this down to a mere 79%.\n\nGeth is client software developed by the Ethereum Foundation that supports network functions like transaction validation and smart contract execution. Geth is generally considered a more robust option than its rivals, which, along with the Foundation’s stamp of approval, is why it accounts for such an outsized market share.\n\nRegardless, such a high concentration level would be problematic in any sector. But in an industry so prone to probing by malicious actors—particularly those adept at software supply chain attacks—it’s a recipe for disaster.\n\nA Geth failure would bring Ethereum finalization to a screeching halt, but as Labrys developer Lachlan Feeney recently suggested, this vulnerability could also result in the loss of the majority of the roughly 29 million ETH currently staked by validators.\n\nBecause validators are penalized for being offline, an ‘inactivity leak’ could rob validators of two months’ worth of staking rewards in just two days. Should the downtime extend for five days, a year’s worth of rewards would be lost. A weeklong outage could cost validators 10% of their staked ETH, while 90% of that stake could be lost if the outage extends to six weeks. While such a prolonged outage may be unlikely, it’s also not impossible.\n\nGeth-based validators would likely stampede for the exits rather than watch their stake bleed away to nothing. But they’d get caught in a logjam of similarly minded validators, all of whom would continue bleeding ETH as they wait their turn to disembark this sinking ship. Given the sheer number of Geth-based validators, this bottleneck could mean that only one in 12 could exit with more than 50% of their stake.\n\nFork me\n\nThe potential repercussions of a serious Geth bug don’t stop there. Should a Geth-based validator produce an invalid block, Geth’s domination of the network could result in this invalid block being added to the chain, resulting in a fork that would quickly become the dominant chain. Geth validators would be blocked from the valid chain until the smaller chain is finalized.\n\nAs Feeney put it, “Because the Geth validators are stuck on the invalid chain, they are considered inactive on the non-Geth chain and will suffer the inactivity leak. No software update or bug patch to Geth will save these validators. They will be bled out until their stake represents <⅓ of the network, allowing the non-Geth chain to finalize.”\n\nFeeney estimates that this bleeding could result in an 18% reduction in the total supply of ETH. (That’s definitely one method of creating artificial scarcity and thus losing the token’s fiat value.)\n\nFeeney offered this warning: “Staked ETH is not risk-free yield. Would you invest a minimum of $75,000 USD [the rough value of the 32 ETH required for serving as a validator] into an instrument where the maximum potential gain is 3.5% p.a. but the potential for loss is 100% (even if that loss is unlikely)? Probably not, but this is what 84% of the Ethereum stakers are doing today.”\n\nLido shuffle\n\nRetail users lacking the 32 ETH necessary to stake on their own have several options for pooling their resources, but staking via a service won’t necessarily protect them from the potential carnage described above.\n\nLido Finance, the largest staking service with around 9.4 million ETH staked, relies on Geth for most of its operations. On January 23, Lido stated that its preliminary Q4/23 data put Geth usage across Lido protocol validators at 67%, down from 76% in Q3/23 and 93% in Q3/22. Lido said “client diversity is fundamental” to its “mission to decentralize Ethereum.”\n\nLido added that its Lido DAO (decentralized autonomous organization) node operators “are afforded high degrees of autonomy,” but they “have already begun to signal their commitments to reduce majority client usage, or explain how their setups avoid the possibility of being affected by supermajority bugs.”\n\nCoinbase has a plan to make a plan\n\nThe Coinbase (NASDAQ: COIN) exchange has faced similar queries this week about its reliance on Geth. On January 22, CEO Brian Armstrong personally responded to a Coinbase customer who tweeted that they had “unstaked all of the ETH I had staked with you since you offered it as a service.” The user added that this “single client staking setup” made it “not worth the risk” of losing “a large percentage of my deposit.” Armstrong replied: “Taking a look.”\n\nLater that day, the Coinbase Cloud account tweeted that when it launched its ETH staking service, “Geth was the only client that met our technical requirements.” Coinbase claimed that “execution client diversity … is a critical concern,” and thus, it was conducting “an updated technical assessment with the goal of adding another execution client to our infrastructure.” Coinbase promised to provide an update on its progress “by the end of February.”\n\nNot everyone found this reassuring, with at least one customer suggesting that the situation wasn’t “a review and plan kind of phase. This is take serious and urgent action, with informed customers phase.” Coinbase was urged to set up “an insurance fund or allow us to opt in to other clients” because “the risk of supermajority failure is a *bigger* risk to your customers than minority client failure.”\n\nThis probably wasn’t the best week for Coinbase to run a sponsored post on Decrypt promoting the claim that its staking service “aims to be a ‘one-stop shop’ for crypto staking.” One stop, one point of failure… Synergy!\n\nCoinbase rival exchanges Binance, Kraken, and Bitfinex (among others) also rely solely on Geth to power their staking services. However, they have kept quiet regarding any plans they may have to inject a little diversity into their operations.\n\nAll in one\n\nDecentralization theater has been Ethereum’s stock-in-trade from its inception, starting with the Ethereum Foundation’s oversight-bereft crowd sale that delivered the majority of ETH into the hands of a few whales. This concentration of wealth and power continues to this day via the PoS consensus mechanism that further enriches the whales who can afford to run multiple validators.\n\nThis centralization was recently cited by the U.S. Securities and Exchange Commission (SEC) as part of the reason it was delaying decisions on applications to offer Ethereum spot-based exchange-traded funds (ETF). BlackRock, Grayscale Investments, and Fidelity are among those chomping at the bit to offer Ethereum ETFs to the public following the launch of multiple BTC spot-based ETFs earlier this month.\n\nIn approving those BTC ETFs, SEC chairman Gary Gensler stressed that the decision was limited to “one non-security commodity” (BTC) and “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.” Gensler, who has previously stated his belief that ETH is an unregistered security, reiterated his ‘don’t expect ETH ETF approvals anytime soon’ message earlier this week.\n\nOn Thursday, the SEC posted a list of ETH-related questions for public comment before making any ETF decision. For instance, the SEC wonders if there are “particular features related to ETH and its ecosystem, including its proof of stake consensus mechanism and concentration of control or influence by a few individuals or entities, that raise unique concerns about ETH’s susceptibility to fraud and manipulation?”\n\nInterested parties are instructed to submit their comments within three weeks. Just remember Ethereum Foundation members, you have to at least try to make it look like they’re not all coming from the same address.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple, Ethereum,\n\nFTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLWJpbmFuY2UtY29pbi1hc2lhbi13cmFwLTI2LWphbnVhcnktMjAyNDAxMjYwNjQx0gGVAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLWJpbmFuY2UtY29pbi1hc2lhbi13cmFwLTI2LWphbnVhcnktMjAyNDAxMjYwNjQx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & Binance Coin — Asian Wrap 26 January - FXStreet",
        "content": "Ethereum (ETH) price has been rolling down a cliff since January 12 when news of Grayscale Bitcoin Trust (GBTC) redemptions broke. The slump has seen Ether fall out from below the confines of a bullish technical formation, but that could end soon as the spot ETH exchange-traded funds (ETFs) theme gathers momentum.\n\nBitcoin price is range bound close to the psychologically important $40,000 level, nearly two weeks post Spot ETF approval by the Securities and Exchange Commission. Retail traders holding less than 1 BTC have shed their holdings, evident by the decline in Bitcoin wallets since October 2023.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFjdGlvbmZvcmV4LmNvbS9jb250cmlidXRvcnMvZnVuZGFtZW50YWwtYW5hbHlzaXMvNTM3MDMxLWV0aGVyZXVtLWNvdWxkLWVuZC1jb25zb2xpZGF0aW9uLXdpdGgtYS1kaXAtdG93YXJkcy0yMDAwL9IBggFodHRwczovL3d3dy5hY3Rpb25mb3JleC5jb20vY29udHJpYnV0b3JzL2Z1bmRhbWVudGFsLWFuYWx5c2lzLzUzNzAzMS1ldGhlcmV1bS1jb3VsZC1lbmQtY29uc29saWRhdGlvbi13aXRoLWEtZGlwLXRvd2FyZHMtMjAwMC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Could End Consolidation With a Dip Towards $2000 - Action Forex",
        "content": "Market picture\n\nVolatility in the cryptocurrency market remains subdued, keeping the capitalisation near $1.56 trillion for the third day. Meanwhile, Bitcoin remains around $40K, and Ethereum looks pegged to $2200.\n\nThe drop in equity indices over the past 24 hours hasn’t been too much of a concern for cryptocurrency investors so far, as it looks more like a series of individual corporate stories rather than a global shift in sentiment.\n\nBitcoin is benefiting from this consolidation as its share of all cryptocurrencies has once again surpassed 50%.\n\nMeanwhile, Ethereum, the second most-capitalised coin, has returned to the lower end of the consolidation it spent most of December in, losing since the start of the day and threatening to fall a notch lower to the $2100 area, which was the upper end of the consolidation in November. A decline here would be as logical a move as a BTCUSD pullback to $37500, which remains the main scenario. At the same time, however, be prepared for a brief dip towards $2000 due to cryptocurrency volatility.\n\nNews background\n\nThe SEC postponed the decision on BlackRock’s application to launch a spot Ethereum ETF until 10 March. Optimistic experts expect the Ethereum ETF to be approved in May with a 50-70% probability, while sceptics point to regulatory resistance.\n\nThe emergence of spot bitcoin ETFs in the US has opened the door for the cryptocurrency to reach a wider audience. Now, for the first time, cryptocurrency could become mainstream, said the head of institutional at exchange Coinbase. New cryptocurrencies will attract a lot of capital, but it won’t happen overnight. It will take “months and even years”.\n\nThe G20’s Financial Stability Board in 2024 plans to focus on global regulations for the digital asset industry and the regulation of artificial intelligence.\n\nReuters confirmed the existence of a thriving underground crypto market in China. Investor interest in digital assets is growing against the backdrop of a troubled economy and a lack of value preservation tools. With Hong Kong’s approval of digital assets in 2023, Hong Kong has become one of the opportunities for Chinese investors to access cryptocurrencies."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdG9rZW5wb3N0LmNvbS9FdGhlcmV1bS1TY2FsaW5nLVNvbHV0aW9uLUFsdExheWVyLUxhdW5jaGVzLVdpdGgtMTAwLU1pbGxpb24tQWlyZHJvcC0xMTE1M9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop - TOKENPOST",
        "content": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop\n\nAltLayer recently became the first of at least three protocols to go live with an impressive $100 million token airdrops scheduled for the upcoming week. The launch marks a milestone in the field of blockchain technology, offering promising solutions for Ethereum's scalability issues.\n\nThe much-anticipated ALT token and the claiming process were officially made available to the public as of Jan. 25, 9 am UTC, as per Cointelegraph. A staggering 300 million tokens were allocated for the initial airdrop, resulting in a total value of approximately $96 million based on the current average daily price of $0.32 per token.\n\nHowever, Celestia stakers eager to participate in the ALT airdrop will have to exercise patience as AltLayer reported technical differences delaying the distribution to Celestia. Despite this delay, AltLayer's airdrop comes at a time when several other projects are also expected to distribute their respective tokens to eligible recipients within the same timeframe.\n\nDymension and Jupiter to Follow Suit\n\nAccording to ADVFN, among these projects is Dymension, a multilayer rollup deployer poised to launch its mainnet in the near future. Dymension plans to airdrop 70 million DYM tokens, primarily benefiting Celestia stakers and Pudgy Penguin NFT holders, as well as participants in the Solana and Ethereum ecosystems.\n\nFurthermore, the Solana-based decentralized exchange Jupiter has confirmed the launch of its highly anticipated JUP token on Jan. 31. A total of 1 billion tokens will be distributed through the airdrop, making it potentially worth around $410 million based on the current pre-market trading price of approximately $0.41 per token.\n\nBitcoin Ordinals Users Could Benefit from Airdrop\n\nIn addition, Bitcoin Ordinals users may also have an opportunity to participate in an airdrop. Ordinals developer Leonidas recently announced the launch of \"Runestone,\" a decentralized \"fairdrop\" initiative designed to reward early users of the Ordinals protocol. The airdrop aims to incentivize users' early adoption and engagement.\n\nWhile airdrops offer exciting possibilities, crypto users must exercise caution. The X platform is currently plagued by scam accounts posing as crypto firms' official social media pages announcing airdrops. Users must remain vigilant to avoid falling victim to these fraudulent schemes.\n\nPhoto: Traxer/Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy8zLWNoZWFwLWV0aGVyZXVtLWFsdGVybmF0aXZlcy1wcmltZWQtZm9yLXF1aWNrLTE1eC1wcm9maXRzLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:51:27 GMT",
        "title": "3 cheap Ethereum Alternatives primed for quick 15x profits - Cryptonews",
        "content": "3 cheap Ethereum Alternatives primed for quick 15x profits\n\nInvestors and enthusiasts are perpetually seeking alternatives that not only bring unique features to the table but also promise substantial profits. Ethereum, as a frontrunner in the blockchain space, has paved the way for the emergence of innovative projects aiming to provide viable alternatives. Notable among these alternatives are Retik Finance, Ripple (XRP), and Cardano (ADA), which distinguish themselves as promising contenders. Frequently hailed as cheap alternatives to Ethereum, these projects are positioned for potentially rapid 15x profit gains. As the cryptocurrency landscape continues to evolve, the allure of these alternatives lies not only in their affordability but also in their potential to deliver significant returns, attracting attention from investors looking for diverse and lucrative opportunities in the blockchain sphere.\n\nRetik Finance: Illuminating the Path to Financial Empowerment\n\n\n\nRetik Finance steps onto the financial stage with a forward-looking vision that extends beyond current norms, envisioning a future marked by heightened financial empowerment, steadfast reliability, and unparalleled transparency. The project’s mission involves seamlessly integrating cryptocurrency with traditional fiat payment systems, breaking down barriers to enable global financial inclusion regardless of geographical location or financial status. Employing cutting-edge technologies, Retik aspires to revolutionise financial transactions, introducing a paradigm shift that transcends the constraints of existing systems.At the core of Retik’s transformative vision is the foundational principle of decentralisation, offering access to a diverse range of assets without cumbersome trust procedures. The project’s product architecture incorporates five decentralised layers, governed by an open payment consensus protocol adaptable to major public chains and layer 2 networks. This approach streamlines merchant onboarding, reconciliation, and settlements, and enhances the overall value proposition.Security is paramount for Retik Finance, with a robust credit scoring architecture ensuring a comprehensive and reliable approach to credit assessment. Emphasising sustainability through consensus mechanisms, Retik fosters innovation and growth within its ecosystem. Utilising a decentralised operational support infrastructure, the platform aims for cost-effectiveness and high efficiency through the implementation of smart contracts.As a cost-effective Ethereum alternative, Retik Finance has garnered attention for its potential to yield quick 15x profits. With CertiK audit certification, a presence on reputable platforms like CoinMarketCap and CoinGecko, and as of writing trades at a cheap price of $0.080 in presale stage 6, Retik Finance has witnessed significant momentum. Selling out 220 million RETIK tokens in under 8 weeks and accumulating $13.15 million, experts project that the platform, as it nears its Q3 2024 listing, is positioned for a rapid 15x profit surge fueled by increased momentum and adoption.\n\nRipple (XRP): Whales Amass as Regulatory Dynamics Unfold\n\n\n\nIn recent weeks, Ripple (XRP) has been in the spotlight due to significant developments surrounding its regulatory status. The U.S. Securities and Exchange Commission (SEC) offered a settlement that would categorise XRP as a security. However, Ripple firmly stands its ground, asserting that XRP is not a security. This regulatory uncertainty has led XRP whales to start accumulating tokens, amassing a staggering 360 million virtually overnight.Binance’s announcement of introducing XRP trading pairs against USDC further fueled the buying spree among XRP whales. Despite its cheap current trading price of $0.5077, a 14% increase compared to one month ago, experts project a potential surge to $0.85 by the end of January 2024, positioning XRP as an Ethereum alternative primed for quick 15x profits.While regulatory challenges pose a risk, the strategic moves by major platforms and the anticipation of an upward spiral signal potential opportunities for those eyeing quick profits within the XRP market.\n\nCardano (ADA): Charting a Bullish Trajectory\n\n\n\nCardano (ADA) has been garnering attention for its potential to follow Ethereum’s footsteps in terms of profitability. Analysts predict a potential rise to $7 or even $15, drawing parallels between ADA’s current behaviour and its late 2020 patterns. Notably, Dan Gambardello, founder of Crypto Capital Venture, highlights ADA’s enhanced functionalities in the current market compared to the previous bull run.Gambardello emphasises Cardano’s growth in the decentralised finance (DeFi) landscape since 2021, drawing parallels between ADA and Ethereum’s historical development. He also points out Cardano’s preparations for the next bull run, noting a bottoming-out structure before the upcoming Bitcoin Halving event. This cooling-off period for ADA is seen as notably bullish, potentially signalling an imminent upward move.As of writing, ADA trades cheaply at $0.4596 and is positioned as an Ethereum alternative, also viewed by experts as having the potential for quick 15x profits, showcasing the optimism surrounding its future trajectory.\n\nConclusion: Diverse Paths to Profits in the Crypto Universe\n\n\n\nRetik Finance, Ripple (XRP), and Cardano (ADA) represent three distinct paths within the crypto universe, each with its unique set of features and potential for profitability. Retik Finance stands out with its visionary approach, aiming to reshape the global financial landscape through decentralisation, security, sustainability, and efficiency.On the other hand, Ripple (XRP) navigates through regulatory challenges, with its market dynamics influenced by strategic moves and anticipation of an upward spiral. Cardano (ADA) charts a bullish trajectory, drawing parallels with Ethereum’s historical patterns and positioning itself as an Ethereum alternative with significant profit potential.As with any investment, it’s crucial for investors to conduct thorough research, assess risk factors, and stay informed about the dynamic nature of the cryptocurrency market. While the allure of quick 15x profits is enticing, prudent decision-making remains the key to success in the ever-changing world of digital assets.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance\n\nDisclaimer: The text above is a press release that is not part of Cryptonews.com editorial content."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmdlZWsuY29tL2V0aGVyZXVtLWNvLWZvdW5kZXJzLWtuZXctZXRoLXdhcy1hLXNlY3VyaXR5LWZyb20tdGhlLWdldC1nby1pbnNpZGVyLXNheXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum co-founders knew ETH was a security from the get-go, insider says - CoinGeek",
        "content": "An Ethereum insider says the network’s co-founders knew all too well that their 2014 token crowdsale involved unregistered securities and relied on friends in government to keep them out of trouble.\n\nLast November, Steven Nerayoff released an audio recording of several phone conversations he had with Ethereum co-founder Vitalik Buterin in April 2015, several months before the Ethereum blockchain officially mined its genesis block. Nerayoff, a former legal advisor to the Ethereum Foundation, says he’d been tasked with assessing the network’s problems and proposing a ‘restructure plan’ to ensure its long-term survival.\n\nNerayoff had teased the release of the recordings for weeks in advance, claiming that Ethereum insiders like Buterin and Joseph Lubin are involved in “the biggest fraud of our lives.” Unfortunately, the recording (full transcript viewable here) proved a bit of a letdown on that front, although Nerayoff claimed shortly before its release that evidence of said fraud will be detailed in a lawsuit he intends to file at some future date.\n\nWhat the recording did show was just how out of his depth Buterin was at the time. Having just turned 21, Buterin was clearly overwhelmed by Ethereum’s haphazard organizational structure and its dwindling financial resources.\n\nThe controversial crowdsale of ETH tokens the previous summer had brought in over 30,000 BTC tokens worth over $18 million at the time. But the failure of Ethereum’s leadership to deliver on many of the pre-sale promises they’d made to the roughly 9,000 participants had left many of the latter feeling betrayed by Buterin, Lubin, and the other co-founders.\n\nAs Nerayoff explained to Buterin, a lot of these crowdsale participants were “not wealthy people … they’re young people that have sold their Bitcoin and put their savings into this thinking this is the next best thing. These people are not going to be happy if this thing goes below par, so to speak. So one issue is, you must not only keep the organization going, you must keep Ether above par.”\n\nNerayoff added that he was “fairly convinced that securities laws and these other laws have been tripped. And so the question … is anybody going to come after you? And the likelihood of that diminishes greatly if the price of Ether stays above par and people don’t lose money.”\n\nButerin never pushes back against these observations, likely because he understood the reality of Nerayoff’s argument. But Nerayoff’s suggestion that Buterin had the power to boost the price of ETH—and Buterin’s apparent acknowledgment of this reality—ticks another box on the Howey test for determining whether assets are securities.\n\n\"At this point, if you're investing in Ethereum, I would say you're investing in the team and community.\"\n\n–@VitalikButerin pic.twitter.com/DGBF8VMgRp — Pledditor (@Pledditor) November 16, 2023\n\nFor those who might argue that inference isn’t evidence, consider that in March 2014, Buterin gave a presentation on Ethereum at the Texas Bitcoin Conference in Austin. In a sideline interview, he ticked more Howey boxes by telling would-be crowdsale participants that not only was ETH considered an ‘investment,’ but “if you’re investing in Ethereum, I would say you’re investing in the team and the community.”\n\nPapering the cracks\n\nNerayoff wasn’t the only Ethereum insider who believed ETH met the criteria for an unregistered security. Nerayoff posted screenshots of emails from July 2014 detailing a conversation between Lubin and Jeffrey Alberts, a partner at the law firm Pryor Cashman (CC’d were Buterin, Nerayoff, and another Pryor Cashman partner, Bertrand Fry).\n\nLubin speaks of the need to acquire “a strong opinion letter” that would leave Ethereum insiders “well insulated from criminal liability regarding securities laws” should they permit U.S. residents to participate in the crowdsale that was then only a week away. (Lubin later publicly celebrated this “piece of paper in our pocket” as having legally immunized the crowdsale in advance.)\n\nAlberts replies that while the opinion letter “probably does give you a defense under certain circumstances,” there was no legal defense against fraud. Based on Alberts’ advice, the Ethereum Foundation reserved $1 million from the crowdsale proceeds to cover potential legal bills.\n\nIn mid-December, Nerayoff sat for an interview with attorney John E. Deaton and offered additional evidence of ETH’s security status. Nerayoff displayed an ‘opinion party certificate’ from Pryor Cashman that lists what Nerayoff called “certain requirements that Ethereum is attesting to (to the law firm) in order for the opinion to be valid. Vitalik signed that. One of those [requirements] was not held up to be valid.”\n\nPer Pryor Cashman’s instructions, the Ethereum Foundation agreed to issue 60 million ETH (the same amount sold via the crowdsale) to blockchain reward miners over a 40-month period so that the distribution of tokens would be balanced.\n\nThe exact wording of this stipulation read: “An amount of Ether equal to 30% of the Pre-Sale Amount will be issued annually to blockchain miners, with the result that blockchain miners are expected to have received, by roughly three years and four months after the launch of the genesis block, an amount of Ether equal to the Pre-Sale Amount.”\n\nAccording to Nerayoff, “effectively, what they were saying was, ‘we’re not decentralized, and in order to become decentralized, we need to balance it out with the miners.’ The problem with that analysis is that, if you go out three years and four months, they issued less than half of that, which means the opinion letter’s no good and [ETH is] probably a security.”\n\nPumping Joe’s bags\n\nEthereum’s crowdsale is widely regarded as a fundamentally flawed procedure in which a relative handful of whales—less than 100—snapped up as much as 40% of the available tokens. Lubin himself informed these whales in advance that they wouldn’t be subjected to any real scrutiny should they wish to purchase more than the stated 12.5% maximum available to any one buyer. (There’s also evidence that Ethereum issued 168,000 additional ETH via its ICO than the amount Buterin claimed on Github at the time.)\n\nA couple of years ago, former Ethereum developer Lane Rettig claimed that maybe 60% of all ETH in existence was still the product of the premine and that Lubin was “probably the largest holder” of ETH following the crowdsale. Rettig said the premine was “the biggest reason I left Ethereum,” adding that this belated realization that his work was ultimately responsible for “pumping Joe Lubin’s bags” was “just not what I want to do.”\n\nAt the Consensus 2022 event, Lubin was asked to clarify the size of his bags. Lubin refused to offer specifics but claimed that his ETH holdings have “never been even close to even half a percent” of the total supply. But as Nerayoff noted to Deaton, Lubin didn’t say it was “never more than half a percent,” and Lubin’s phrasing doesn’t rule out the possibility that he holds 40% of the total supply, which is objectively not close to half a percent.\n\nNerayoff told Deaton that it was “two parties, maybe it was three parties, that bought the vast majority of all the ETH” in the crowdsale. Nerayoff further claimed that these same few parties were also “mining the vast majority of the ETH” right up until Ethereum’s ‘Merge,’\n\naka the 2022 shift from a proof-of-work consensus mechanism to one based on proof-of-stake.\n\nIn Nerayoff’s view, the fact that the miners receiving ETH via block rewards were also the biggest ETH crowdsale participants meant the network had become more centralized over time, making a mockery of its public proclamations of seeking greater decentralization. (That ship has now permanently sailed, given the post-Merge whale-favoring design of staking-based transaction validation.)\n\nEnter the Hinman\n\nGovernment agencies are notoriously slow off the mark, but other Ethereum insiders expressed similar concerns that the crowdsale would eventually provoke the Securities and Exchange Commission (SEC) to act. Vinay Gupta, who worked as project manager on strategy and communications for Ethereum’s 2015 launch, was sufficiently worried to discuss the matter with his own attorneys.\n\nThe attorneys told Gupta that ETH was indeed an unregistered security and “you can’t massively profit from this at the same time that you’re selling it to people.” Gupta was advised to either divest himself of his ETH holdings or move to a jurisdiction without an extradition treaty with the United States.\n\nGupta chose the former and now says his decision to divest cost him an estimated $56 million. Still, how was he to know Ethereum had men on the inside ensuring the SEC would take no action against it?\n\nIn June 2018, William Hinman, then-director of the SEC’s corporation finance division, gave a now-infamous speech at the Yahoo Finance All Markets Summit on the topic of “whether a digital asset offered as a security can, over time, become something other than a security.”\n\nIn this speech, Hinman declared that “putting aside the fundraising that accompanied the creation of Ether, based on my understanding of the present state of Ether, the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions.” As such, Hinman believed that “applying the disclosure regime of the federal securities laws to current transactions in Ether would seem to add little value.”\n\nThis speech has come under renewed scrutiny in recent years, in part due to the SEC’s suit against Ripple Labs over whether its XRP token is an unregistered security. Internal SEC documents disclosed in that suit reveal internal debate amongst SEC execs regarding Hinman’s Ethereum comments prior to his speech, including whether they reflected broader SEC policy or simply Hinman’s personal views.\n\nThe fact that Hinman himself referred to the speech as the ‘Ether speech’ in SEC emails—despite his also referencing the BTC token in the same speech—raises additional questions as to his motivations in crafting it. As does his June 4, 2018 email stating that he was planning “a call with Buterin later this week to confirm our understanding of how the Ethereum Foundation operates.” (Hinman would later deny under oath that he communicated with anyone other than SEC staff regarding the substance of the speech.)\n\nConflicted much?\n\nBefore joining the SEC in May 2017, Hinman was a partner at the Simpson Thacher & Barlettt law firm. That same year, the firm became a member of the Ethereum Enterprise Alliance (EEA), a group formed to “build, promote, and broadly support Ethereum-based technology.”\n\nHinman left the SEC in December 2020 and quickly rejoined Simpson Thacher as a senior advisor. It was later revealed that Hinman was paid millions of dollars from Simpson Thacher during his SEC tenure, money that a source close to Hinman described as part of Hinman’s pension from the firm. However, the majority of it appears to have come via partnership income, aka profit sharing.\n\nSimpson Thacher quietly left the EEA in the spring of 2022, later declaring that its “minimal involvement” with the group was “purely educational, to gain a better understanding of blockchain technology.”\n\nBut the exit dovetailed with the whistleblowers group Empower Oversight finally receiving SEC emails they’d sought via freedom of information access requests. The emails showed the SEC ethics office warning Hinman early on about his ‘retirement benefits’ being based on Simpson Thacher’s future profits, which could give him “a financial interest in the firm’s profitability while you are in government.”\n\nThe SEC ethics office warned Hinman that this “future interest is enough to give you a full financial interest in the firm,” and thus, he should recuse himself from any matters in which Simpson Thacher stood to benefit. Despite this warning, Hinman met with another Simpson Thacher partner at least three times during his time on the SEC payroll.\n\nThe SEC ethics officials continued to press Hinman in January 2018, saying “[i]t occurs to us that you have a full financial conflict with your old firm, not just an impartiality one.” The SEC warned Hinman not to have “any meetings with your old firm, even group meetings.”\n\nAnd yet, Hinman met with Simpson Thacher partner Chris Lin in August 2019 so that Lin could “report what is going on in China.” At the time, Lin represented Canaan, a China-based block reward mining firm that Simpson Thacher helped take public in November 2019.\n\nHow did Hinman get away with this flagrant ignoring of ethics guardrails? It didn’t help that in 2021, Carl Hoecker, the SEC official tasked with investigations of wrongdoing by agency staff, was found guilty of “serious misconduct” following an Integrity Committee probe that began in November 2017. Predictably, Hoecker’s punishment was limited to a brief suspension without pay, after which he went back to doing his heckuva job keeping watch over other SEC execs until May 2022.\n\nSay it ain’t so, Joe\n\nIn 2020, Lubin told a podcast that Ethereum “arrived on the scene before regulators were watching,” and the co-founders had been “fortunate enough to be able to frame our token as a utility token” by the time regulators began watching.\n\nThe year before, Lubin told a conference audience that “we are big friends and fans of [the SEC]. I think they’re really understanding the space well.” Lubin described how the SEC had “introduced a new construct–decentralization–into their thinking,” and thus, no Ethereum transactions “are considered to be transactions of securities.”\n\nThere’s no doubt that Hinman had been lobbied hard on this ‘decentralization’ angle ahead of his June 2018′ Ether speech.’ Emails show Lubin pushing to meet with SEC execs—including Hinman—with the first meeting taking place in December 2017.\n\nThis full-court press quickly gained pace, as the court-ordered release of Hinman’s calendar of appointments shows. Between March 29 and April 23, 2018, Hinman met twice with Lubin and individuals associated with ConsenSys, Lubin’s Ethereum-based blockchain software outfit. Two other Hinman meetings show the subject of discussion was ‘ETH’ or ‘Ether.’\n\nThat March, the Andreessen Horowitz venture capital group—a major investor in Ethereum-based projects—submitted a white paper to the SEC proposing a ‘safe harbor’ for ‘decentralized’ tokens. The paper singled out ETH as “a good example of this type of protocol token that has become so decentralized it should not be deemed a Security.”\n\nIn September 2019, Cooley LLP attorney Nancy Woitas appeared on a crypto regulation panel and referenced Hinman’s speech, saying, “most of what he says in there came out of the safe harbor, as well as the meetings that we had with him.”\n\nLowell Ness, a partner at Perkins Coie, told a BlockCon audience that he wrote the material presented to the SEC in the safe harbor paper. Ness added that the firms who attended an April 2018 meeting with SEC officials were taken aback by the “interesting dichotomy” between the SEC’s public tough talk re ‘crypto’ enforcement versus “this interesting sort of welcome that we got privately.”\n\nFor the record, both Cooley and Perkins Coie belonged to the Enterprise Ethereum Alliance.\n\nAlso, for the record, on June 2021, Andreessen Horowitz announced that it had added Hinman as an advisory partner to its $2 billion ‘a16z crypto’ fund.\n\nSham Master Jay\n\nHinman’s boss at the SEC was then-chairman Jay Clayton. Clayton’s tenure was marked by a significant number of civil actions against projects involving initial coin offerings (ICOs), nearly all of which occurred on Ethereum. And yet, Ethereum somehow escaped censure for enabling this illegality.\n\nIn February 2018, Clayton told the Senate banking committee that “every ICO I’ve seen is a security… Those who engage in semantic gymnastics or elaborate re-structuring exercises in an effort to avoid having a coin be a security are squarely in the crosshairs of our enforcement provision.” And yet, Ethereum’s own deeply flawed ICO and its subsequent failure to decentralize got the thumbs-up from Hinman just four months after Clayton made that statement.\n\nClayton was a partner at the Sullivan & Cromwell (S&C) law firm (of FTX fame) before his SEC stint and rejoined the firm after leaving government. It’s unclear when the relationship began, but at some point, Lubin hired S&C to advise ConsenSys on regulatory matters, including its various funding rounds.\n\nIn his July 2021 deposition in the Ripple suit, Hinman was specifically asked whether he’d had any communications with Clayton regarding Hinman’s pre-speech meetings with Lubin and other ConsenSys officials. Hinman admitted having communicated with Clayton regarding the ConsenSys meetings “once or twice.”\n\nLike Hinman, Clayton’s devotion to The Cause went neither unnoticed nor unrewarded. In March 2021, the One River Digital Asset Management firm—which in December 2020 bought around $600 million worth of ETH and BTC and announced plans to boost that sum to $1 billion by early 2021—added Clayton to its advisory council.\n\nAn interesting footnote regarding the dynamic duo of Clayton and Hinman. The pair both worked on the 2014 initial public offering of Chinese tech giant Alibaba (NASDAQ: BABAF) as the point people for their respective law firms. A mere three years later, Alibaba would be responsible for 10% of global blockchain-related patent applications.\n\nETHgate\n\nWhile his stint as SEC chair was due to run through June 2021, Clayton opted to resign on December 23, 2020 (less than three weeks after Hinman made his own premature exit).\n\nThat same day, the SEC sued Ripple Labs for offering unregistered securities.\n\nIn 2021, documents filed by the SEC in its suit v. Ripple indicated that “on approximately April 13, 2018, staff in the SEC’s newly-formed Cyber Unit began investigating whether Ripple’s and others’ conduct violated the federal securities laws.” On April 12, 2018, Hinman emailed Lubin to say he’d “greatly enjoyed” meeting Lubin and his team and wondering if “we could have a brief call in order to discuss the possibility of another meeting?”\n\nThe alleged favoritism the SEC showed Ethereum while aggressively targeting rival protocols such as Ripple has become known as ‘ETHgate’ among Ripple supporters. To be sure, CoinGeek can hardly be described as Ripple fans, seeing little difference between XRP, ETH, and any of the other bazillion ‘alt-coins’ that emerged in the 15 years since Satoshi Nakamoto released his Bitcoin white paper.\n\nBut as the saying goes, just because you’re paranoid doesn’t mean they aren’t after you.\n\nThe empire strikes back\n\nNerayoff’s public re-emergence onto the digital asset stage followed a failed attempt by the U.S. Department of Justice (DoJ) to put the former Ethereum insider inside a prison cell for a long, long time.\n\nIn 2017, Nerayoff worked as an advisor for some of the countless Ethereum-based projects that launched ICOs that year. In September 2019, Nerayoff and his alleged co-conspirator, Michael Hlady (aka Michael Peters), were arrested and charged with attempting to extort millions of dollars from a Seattle-based token project. (The project goes unidentified in court docs but was long ago outed as StormX.)\n\nNerayoff, who’d signed a deal to assist StormX in launching its ICO, was accused of shaking down StormX’s founders for millions more in cash and tokens than their original agreement called for, with Hlady allegedly issuing veiled threats of violence to compel the founders to agree. An FBI director called it “an age-old extortion scheme … with a modern day twist.”\n\nWhile Hlady pleaded guilty in April 2021, Nerayoff maintained his innocence from the start. Nerayoff claimed he’d been set up by Hlady, who Nerayoff alleged was an established conman who’d stolen hundreds of thousands of dollars from him. Nerayoff further claimed that Hlady was a government informant who’d exchanged 100 text messages and 45 phone calls with a Federal Bureau of Investigation (FBI) agent during the period in which the alleged extortion was said to have occurred.\n\nNerayoff was ultimately vindicated in May 2023 after the DoJ abruptly filed a motion to dismiss the indictment with prejudice, citing “material exculpatory evidence obtained by the government well after return of the Indictment” and “subsequent investigation based on that evidence.” The Department of Justice (DOJ) concluded that it was “unable to prove the charges in the Indictment beyond a reasonable doubt.”\n\nAmong this exculpatory evidence were Skype video recordings of meetings between Nerayoff and StormX founders that, in Nerayoff’s lawyers’ view, “clearly establish that not only were the agreements entered into freely, the parties’ dealings were entirely cordial.” Nerayoff’s lawyers noted that some of the exculpatory evidence had “been in the government’s possession since sometime in February 2019,” seven months before the complaint was filed.\n\nThe dismissal brought a halt to a motion filed by Nerayoff’s team one month prior that sought to compel the government to produce certain evidence related to his case. Nerayoff claimed that the government had tried to strongarm him into helping them bring criminal cases against some prominent figures within the blockchain sector. Nerayoff said he refused to cooperate despite the government’s suggestion that doing so could shave years off the sentence he’d receive on the extortion charge.\n\nSelective outrage\n\nDespite Nerayoff declining to throw anyone under the bus to save his own skin, at least one of Ethereum’s co-founders doesn’t appear all that grateful. Last September, Buterin was asked by journalist Laura Shin about some of Nerayoff’s recent claims. Buterin said that in 2015, he was still too young and naïve to “detect the problems in someone like Steven Nerayoff.”\n\nButerin went on to say that the Ethereum Foundation had since “successfully distanced ourselves” from “bad characters that caused us a lot of damage.” Buterin claimed Nerayoff was involved in “huge amounts of, like, fraud and behaving in … ways that made women around him very uncomfortable at the very least … That’s a shady character, man.”\n\nIt’s unclear what Buterin is referencing here re ‘uncomfortable women.’ Granted, Nerayoff has spoken favorably of Andrew Tate, the U.K. kickboxer turned misogynist-for-profit and multilevel marketing scammer. Nerayoff has clarified that his empathy for Tate has more to do with Tate allegedly being subjected to the kind of ‘bogus’ charges that Nerayoff says he endured via the “unchecked power of governments.”\n\nRegardless, Buterin compared Nerayoff unfavorably to Virgil Griffith, the former Ethereum developer currently doing time in a U.S. federal prison after ignoring warnings not to travel to North Korea to educate regime officials on how ‘crypto’ could help them evade U.S. economic sanctions. Buterin said he couldn’t say bad things about Griffith “just because he was, uh, you know, more geopolitically open-minded than a lot of other people.”\n\nButerin’s blinkered devotion to Griffith ignores the grotesque human rights violations that North Korea’s regime inflicts on its own people. Just last week, two teenagers were\n\nsentenced to 12 years of hard labor simply for watching South Korean television dramas. It seems that in Buterin’s world, Kim Jong-un is less of a ‘shady character’ than Nerayoff. High praise, indeed.\n\nOnly the beginning\n\nNerayoff appears nowhere near done shaking Ethereum’s tree, telling Deaton that he has “a lot of recordings” from the period of his involvement with the Ethereum Foundation.\n\nNerayoff closed his Deaton interview with the bombshell that the 2016 hack of The DAO—in which nearly 15% of all ETH in circulation was stolen from a decentralized autonomous organization and resulted in the controversial fork of the blockchain—was “an inside job by members of the Ethereum Foundation.”\n\nWhile Nerayoff had made this claim prior to the interview, he explained to Deaton that “whoever was controlling the Bitcoin wallet [from the crowdsale] is directly implicated, but it had to involve quite a number of people, so there was no DAO hack. That was a complete inside job. They benefited from it in a whole host of different ways.”\n\nNerayoff said he wasn’t going to offer up any “individual accusations” during the interview but did say that “one of the wallets connected to a certain individual communicated with the hacker’s wallet 10 days before” the hack. “Another one of the individuals at the Ethereum Foundation set up the contract for the hack and set up the wallets … There’s a lot more. I’m just giving you some anecdotal stuff.”\n\nNerayoff added that the so-called ‘DAO Report’ issued by the SEC in 2017 detailing the fallout from the hack—and which declined to “pursue an enforcement action in this matter”—was allegedly written by none other than Bill Hinman.\n\nElsewhere, other blockchain analysts believe they’ve connected the 2016 hack of the Gatecoin exchange to wallets linked to the Ethereum Foundation. But that’s a subject for the next installment in our ongoing series delving into the shady dealings that seem to surround Ethereum, the insiders who’ve profited from it, and the network’s deep ties to China. Stay tuned.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple, Ethereum,\n\nFTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jZWxzaXVzLW1vdmVzLTEtYmlsbGlvbi1ldGgtY3JlZGl0b3ItcGF5bWVudHMtaW5jb21pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Celsius Moves $1 Billion ETH: Will Creditors Get Their Money? - CCN.com",
        "content": "Celsius has transferred ETH worth over a billion dollars to Coinbase, FalconX and Paxos.\n\nEarlier this month, the bankrupt crypto lender started “rebalancing assets” ahead of creditor repayments.\n\nUsers have been able to withdraw funds held in Celsius Custody accounts since last year, but interest-bearing Earn accounts are subject to a different repayment plan.\n\nUnder its court-approved bankruptcy plan, Celsius started repaying users last year, but many creditors still haven’t received a single scent.\n\nHowever, recent developments have sparked hopes that further payouts are imminent. Earlier this month, Celsius unlocked more than 200,000 staked ETH. Now, the bankrupt crypto lender has sent a billion dollars worth of crypto to various exchanges.\n\nCelsius Wallet Transfers 460,000 ETH\n\nOver the course of about an hour on Thursday, January 25, a Celsius wallet transferred around 460,000 ETH worth more than a billion dollars toCoinbase, Paxos and FalconX.\n\nThe largest recipient was a Coinbase Prime deposit address which received 297,000 ETH. alongside smaller denominations of USDC (<$100,000). A further 147,000 ETH was sent to Paxos and 7,800 ETH to FalconX.\n\nAccording to Arkham Intelligence, known Celsius wallets still hold assets worth over $700 million.\n\nWhy Have Some Celsius Users Been Paid But Others Are Still Waiting?\n\nIn June 2022, Celsius suspended withdrawals for all users who held assets on the platform.\n\nThroughout the ensuing bankruptcy proceedings, the court approved separate repayment types for different groups of Celsius users. Judge Martin Glenn deemed that certain funds held in non-interest-bearing Custody accounts belonged to the account holder.\n\nThe ruling only applied to deposits that weren’t commingled with other assets, and which hadn’t been transferred from an interest-bearing account in the 100 days before the the platform’s suspension. Withdrawals for this specific group opened up in March last year. The remaining Custody account assets were released in November, subject to the terms of Celsius’ settlement agreement.\n\nHowever, Celsius users who had funds in interest-bearing Earn accounts are still waiting to recover their assets. According to Celsius’ bankruptcy plan, Earn creditors will receive payment in Bitcoin and Ether based on their account balance, when withdrawals were suspended.\n\nCreditor Payments Incoming?\n\nIn a post on X earlier this month, Celsius said it had started “started the process of recalling and rebalancing assets to ensure ample liquidity.” Accordingly, the latest Ether transactions appear to suggest that more creditor payments are imminent.\n\nAlthough Celsius hasn’t officially confirmed when it will begin distributing payments to Earn creditors, Ionic Digital, which emerged out of Celsius’ post-bankruptcy restructuring, has reported that disbursements are expected to start in mid-February. Eligible creditors will have a one-year window to withdraw their funds, the firm added."
    }
]