[
    {
        "Who": "**Who:**\n\n* Luke Nolan, CoinShares Ethereum research associate\n\n**What:**\n\n* The Ethereum Dencun upgrade will enable Layer 2 transactions to be sent to the Ethereum network through blobspace, an alternative to the current transactional calldata mechanism.\n\n**When:**\n\n* The Dencun upgrade is expected to be activated on the Goerli testnet by Jan. 30, while the same upgrade on the Sepolia testnet is expected to be activated by Feb. 7.\n\n**Where:**\n\n* Ethereum testnets\n\n**Why:**\n\n* The Dencun upgrade is designed to decrease gas fees for users transacting using roll-ups, and bring users back to the network because of lower transaction fees.\n\n**How:**\n\n* The Dencun upgrade will enable Layer 2s to use the new blobspace mechanism, which has significantly lower gas costs.\n\n**Sentiment:**\n\n* The news is negative, as the price of ether has fallen by over 3% in the past 24 hours.",
        "What": "Sure, here's a brief summary of the news in the aspect of What:\n\n* The Ethereum Dencun upgrade will enable Layer 2 transactions to be sent to the Ethereum network through blobspace, an alternative to the current transactional calldata mechanism.\n\n\n* This could result in reduced gas usage and, consequently, a lower amount of ether being burned.\n\n\n* The Dencun upgrade could see gas prices settle at lower levels, which means less ether is burned.",
        "When": "**When:** The Dencun upgrade is expected to be activated on the Goerli testnet on Jan. 17 and the Sepolia and Holesky testnets on Jan. 30 and Feb. 7, respectively.",
        "Where": "Sure, here's a brief summary of the news in the aspect of Where:\n\nThe Dencun upgrade will enable Layer 2 transactions to be sent to the Ethereum network through blobspace, an alternative to the current transactional calldata mechanism.",
        "Why": "**Why:**\n\n* The Ethereum Dencun upgrade will enable Layer 2 transactions to be sent to the Ethereum network through blobspace, an alternative to the current transactional calldata mechanism.\n* This could result in reduced gas usage and, consequently, a lower amount of ether being burned.\n* The Dencun upgrade could see gas prices settle at lower levels, which means less ether is burned.",
        "How": "Sure, here's a brief summary of the news in the aspect of How:\n\n* The Ethereum Dencun upgrade will enable Layer 2 transactions to be sent to the Ethereum network through blobspace, an alternative to the current transactional calldata mechanism.\n* This could result in reduced gas usage and, consequently, a lower amount of ether being burned.\n* The Dencun upgrade could see gas prices settle at lower levels, which means less ether is burned.",
        "Sentiment": "**Sentiment:** The news is neutral and informative, providing a concise overview of the Ethereum Dencun upgrade and its potential impact on the ether supply and gas fees."
    }
]