[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDkvYml0Y29pbi1ldGYtZmV2ZXItZHJpdmVzLWV0aGVyZXVtLXRvLTMyLW1vbnRoLWxvdy12ZXJzdXMtYnRjL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDkvYml0Y29pbi1ldGYtZmV2ZXItZHJpdmVzLWV0aGVyZXVtLXRvLTMyLW1vbnRoLWxvdy12ZXJzdXMtYnRjL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Fever Drives Ethereum to 32-Month Low Versus BTC - CoinDesk",
        "content": "Ethereum, meanwhile, has fallen from the spotlight following its hyped transition to a proof-of-stake blockchain in 2022. Total value locked across all Ethereum protocols is less than it was in April last year, despite the price being 10% higher."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1odXJkbGUtMjM1MC_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtaHVyZGxlLTIzNTAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Avoids Trend Reversal But Key Hurdle Still Intact - NewsBTC",
        "content": "Ethereum price managed to stay above $2,170 and recovered losses. ETH consolidating and still facing many hurdles near $2,350 and $2,400.\n\nEthereum is attempting a fresh increase above the $2,300 resistance level.\n\nThe price is trading above $2,250 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $2,245 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above the $2,350 level.\n\nEthereum Price Regains Strength\n\nEthereum price extended its decline below the $2,200 level. However, ETH remained stable near the $2,180 and $2,170 levels. A low was formed near $2,170 and the price started a fresh increase, like Bitcoin.\n\nThere was a decent increase above the $2,240 level. There was also a break above a connecting bearish trend line with resistance near $2,245 on the hourly chart of ETH/USD. The pair climbed above the $2,320 resistance, but the bears were active near $2,350.\n\nA high was formed near $2,358 and the price is now correcting gains. There was a minor decline below the $2,320 level. The price moved below the 23.6% Fib retracement level of the upward move from the $2,170 swing low to the $2,358 high.\n\nETH is now trading above $2,250 and the 100-hourly Simple Moving Average. If there is a fresh increase, the price might face resistance near the $2,350 level. The next major resistance is now near $2,400.\n\nSource: ETHUSD on TradingView.com\n\nThe main uptrend hurdle sits at $2,450. A close above the $2,450 resistance could start a decent upward move. The next key resistance is near $2,540. If the bulls push Ethereum above $2,540, there could be a rally toward $2,720. Any more gains might send the price toward the $2,800 zone.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,350 resistance, it could start a fresh decline. Initial support on the downside is near the $2,280 level.\n\nThe first key support could be the $2,260 zone or the 50% Fib retracement level of the upward move from the $2,170 swing low to the $2,358 high. A downside break and a close below $2,260 might send the price further lower. In the stated case, Ether could test the $2,170 support. Any more losses might send the price toward the $2,050 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,260\n\nMajor Resistance Level – $2,350\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmxpdmViaXRjb2lubmV3cy5jb20vZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtZXRoLXRhcmdldHMtZnJlc2gtaGlnaC1hYm92ZS0yNTAwL9IBYGh0dHBzOi8vd3d3LmxpdmViaXRjb2lubmV3cy5jb20vZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtZXRoLXRhcmdldHMtZnJlc2gtaGlnaC1hYm92ZS0yNTAwLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Targets Fresh High Above $2,500 - Live Bitcoin News",
        "content": "Ethereum price is eyeing an upside break above the $2,350 resistance against the US Dollar.\n\nETH price is now trading above $2,280 and the 55 simple moving average (4 hours).\n\nThere was a break above a key bullish flag pattern with resistance near $2,250 on the 4-hour chart (data feed from Coinbase).\n\nThe pair could climb further if it stays above the $2,250 support zone.\n\nEthereum price is consolidating above the $2,300 level against the US Dollar. ETH/USD could rise again if it clears the $2,350 resistance zone.\n\nEthereum Price Analysis\n\nIn the past few sessions, Ethereum saw a decent increase from the $2,155 zone against the US Dollar. ETH price moved above the $2,180 and $2,200 levels to move into a positive zone.\n\nThere was a break above a key bullish flag pattern with resistance near $2,250 on the 4-hour chart. The price even cleared the 50% Fib retracement level of the last downward move from the $2,433 swing high to the $2,100 low. The price settled above the $2,300 level.\n\nEthereum is now trading above $2,310 and the 55 simple moving average (4 hours). On the downside, initial support is near the $2,280 level or the 55 simple moving average (4 hours).\n\nThe next major support is now near the $2,250 level. A break below the $2,250 support could push the price to $2,155. Any more losses could lead the price toward $2,100 or even $2,020 in the coming days. Immediate resistance on the upside is near the $2,350 level or 76.4% Fib retracement level of the last downward move from the $2,433 swing high to the $2,100 low.\n\nThe next major resistance is near the $2,400 zone. A clear move above the $2,400 level could send the price toward $2,450. Any more gains could even send the price toward the $2,620 resistance zone or $2,700 in the near term.\n\nLooking at the chart, Ethereum price is clearly trading above the $2,300 zone and the 55 simple moving average (4 hours). Overall, Ether price could climb again if it stays above the $2,250 support zone.\n\nTechnical indicators\n\n4 hours MACD – The MACD for ETH/USD is now gaining momentum in the bullish zone.\n\n4 hours RSI (Relative Strength Index) – The RSI for ETH/USD is now above the 50 level.\n\nKey Support Levels – $2,250, followed by the $2,155 zone.\n\nKey Resistance$ Levels – $2,350 and $2,450."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9ldGhlcmV1bS1sYXllci0ycy1zdGlsbC1iYXNlZC1vbi10cnVzdC1hcy1hY3Rpdml0eS1zdXJnZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Trust Ethereum layer 2s? You shouldn't have to - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nEthereum layer 2 activity is surging. But are the rollups ready for it?\n\nProjects pick Celestia stakers for token airdrops\n\nDeFi security may not be ready for another bull run\n\nHow decentralised are layer 2s?\n\nDeFi users are piling into layer 2 blockchains, pushing several metrics to new highs.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nArbitrum, the biggest layer 2 by total value locked, surpassed the Ethereum mainnet in decentralised exchange transaction volume. At the same time, the combined TVL of all layer 2s registered a fresh all-time high of over $20 billion.\n\nEven smaller layer 2s like Metis are benefitting from the excitement surrounding Ethereum’s scaling options.\n\nEthereum’s faithful cheer the increased adoption of layer 2s, which are faster and cheaper than the main Ethereum network they rely on to finalise transactions.\n\nBut there’s an elephant in the room: most layer 2s are still nowhere near as decentralised as they would like to be.\n\nJoin the community to get our latest stories and updates\n\nUsers must trust that transactions are verified correctly by a centralised entity — usually the company building the layer 2 — instead of through a decentralised consensus like the Ethereum mainnet.\n\nThis is a problem because it goes against DeFi’s founding principle of not having to rely on or trust any single entity to transact.\n\nFor the average DeFi degen, whether or not a specific layer 2 is decentralised probably doesn’t matter that much.\n\nBut for more sophisticated investors — such as institutions — having to trust the companies behind layer 2s will make some think twice before committing serious cash to them.\n\nThe first layer 2 to fully decentralise its transaction processing should benefit greatly — and I expect at least one to make it happen in 2024.\n\nA new airdrop trend emerges\n\nCelestia stakers had a great start to 2024: two projects have promised them airdrops of valuable tokens, with another strongly hinting at the prospect.\n\nSo why are these projects being so generous?\n\nIn a nutshell, because they rely on the Celestia blockchain for their transaction validation, and those who stake their Celestia tokens are pivotal to that.\n\nIf the projects running on Celestia can incentivise more people to stake Celestia tokens, the more secure they are.\n\nIt’s likely this new trend of airdropping tokens to Celestia stakers is only just beginning. More projects building on Celestia — such as Berachain, Monad, and Kinto — are also set to launch later this year.\n\nCertiK calls out DeFi security — then gets hacked itself\n\nCrypto security firm CertiK warns the brewing bull run will be a key test for the DeFi sector in a new report.\n\nCertiK said the DeFi industry needs to decrease the correlation between the money deposited into it and the total amount lost in hacks and scams, if it wants to be taken seriously.\n\nWhile CertiK makes a valid point, a security breach in its own house dampened its effect.\n\nJust two days after publishing the report, CertiK’s X account was compromised following an employee’s interaction with a scammer posing as a representative from a media organisation.\n\nThe breached CertiK account disseminated a message to the security firm’s 343,000 followers, claiming a vulnerability in the decentralised exchange Uniswap’s router contract and linking to a phishing site.\n\nAfter a year of mishaps for CertiK, where the firm signed off on multiple projects that went on to get hacked or rug pull depositors, 2024 isn’t off to a great start.\n\nData of the week\n\nL2Beat provides a nifty dashboard that keeps track of how decentralised each Ethereum layer 2 is.\n\nWhen it comes to general-purpose layer 2s, Arbitrum is the furthest along, but it has yet to make validation permissionless.\n\nL2Beat keeps track of what stage of decentralisation each Ethereum layer 2 is at. (L2Beat)\n\nThis week in DeFi governance\n\nVOTE: Establish the Arbitrum DAO procurement committee\n\nTEMP CHECK VOTE: Add PayPal’s PYUSD to the Aave v3 Ethereum market\n\nPROPOSAL: Make Celestia liquid staking safer and more aligned with the blockchain\n\nPost of the week\n\nWe couldn’t pass up on the opportunity to highlight some rare praise for DefiLlama from one of crypto’s most notorious pseudonymous voices: Gwart.\n\nWhile Gwart’s posts are usually heavily sarcastic, we’re hoping this one is sincere!\n\nI will say something nice here: the most useful thing in DeFi is DefiLlama — Gwart (@GwartyGwart) January 8, 2024\n\nWhat we’re watching\n\nAnd now $3,000,000,000 of leveraged stETH on Aave that was \"very liquid\" is relying on $300mn of Curve liquidity; there is still virtually no off-chain liquidity.\n\n\n\nEspecially with volatility from ETF news, if any large stETH holder gets impatient and sells, things could get ugly https://t.co/jgNhjesvc5 pic.twitter.com/AFL4Di6NBQ — Riyad Carey (@riyad_carey) January 5, 2024\n\nCelsius’ move to unstake its Ether holdings has clogged the validator exit queue.\n\nSeveral analysts, including Kaiko’s Riyad Carey, have pointed out that such a situation could put liquidity for Lido’s stETH token in a potentially perilous position.\n\nHave you joined our Telegram channel yet? Check out our news feed for the latest breaking stories, community polls, and of course — the memes.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tZ3JpbmQtYmFjay1hbmQtZm9ydGgtMTQwMTExMdIBZmh0dHBzOi8vYW1wLmZ4ZW1waXJlLmNvbS9lbi9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tZ3JpbmQtYmFjay1hbmQtZm9ydGgvMTQwMTExMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Grind Back And Forth - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoYnRjLW1heS1jYXBpdHVsYXRlLXdpbGwtdGhlc2UtZmFjdG9ycy1zdXBwb3J0LWV0aGVyZXVtL9IBZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoYnRjLW1heS1jYXBpdHVsYXRlLXdpbGwtdGhlc2UtZmFjdG9ycy1zdXBwb3J0LWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "ETHBTC May Capitulate, Will These Factors Support Ethereum? - NewsBTC",
        "content": "Despite ETHBTC trending lower in favor of Bitcoin (BTC), there is a chance that the second most valuable cryptocurrency will recover in the months ahead. Taking to X in support of Ethereum (ETH), a crypto analyst, Mckenna, said a favorable combination of protocol-related and regulatory factors may support ETH, plugging the bleed versus BTC and sparking a refreshing rally.\n\nEthereum Under-performing Bitcoin: Will This Continue?\n\nLooking at the ETHBTC weekly chart, it is evident that Bitcoin bulls have had the upper hand since August 2022. During this time, Bitcoin gained 42% versus ETH, with bulls pressing on when writing.\n\nTo illustrate, Bitcoin is at a 2022 low versus ETH and will likely extend gains once a spot Bitcoin ETF is approved by the United States Securities and Exchange Commission (SEC). The crypto community expects this authorization to cement Bitcoin’s position, possibly drawing in billions in capital.\n\nSome analysts argue that this event could support altcoins, including Ethereum. So far, Ethereum, though edging lower versus Bitcoin, is firm against the USD. McKenna also notes that once a spot Bitcoin ETF is live in the United States, attention will shift to the SEC on whether it will also greenlight a similar product, but for Ethereum.\n\nThese 2 Factors Might Support ETH\n\nDespite the ETH weakness versus BTC, Mckenna expects Ethereum to recover in the medium to long term. This is because of the expected preference for proof-of-stake (PoS) consensus systems over proof-of-work (PoW) methods that power Bitcoin.\n\nPoW is a computationally intensive process that uses much energy for block confirmation. This has led to criticism from those who are concerned about the environmental impact of crypto mining. For this reason, Ethereum adopted a PoS system, fully transitioning in 2021 after the Merge.\n\nBeyond the energy efficiency, the analyst also notes that the PoS in Ethereum provides ETH stakers with a base yield that will be considered “the safest bond instrument in the entire digital asset space.” Subsequently, this may support ETH, with many viewing it as a safe haven. This assurance is based chiefly on the fact that Ethereum is the second most valuable crypto network, with over $276 billion in market cap, according to CoinMarketCap.\n\nAdditionally, ETH will, in the long run, be deflationary following the activation of EIP-1559 in August 2021. This system burns a portion of gas fees- the base fee- taking a portion of ETH out of circulation. According to Ultra Sound Money, over 17,600 ETH have been destroyed in the last week alone, 1,000 ETH more than those network issues.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tZXRoLW1pZC1qYW51YXJ5LXByaWNlLXByZWRpY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Mid-January Price Prediction - Watcher Guru",
        "content": "The Ethereum network underwent a dramatic transition from the proof-of-work mining model to the proof-of-stake model on September 15, 2022. With an astounding 99.95% decrease in energy use, this much-anticipated change has ushered in a new era of sustainability and environmental friendliness in the blockchain sector.\n\nEthereum has displayed decent growth recently. It is trading at $2,296.73 at press time, with a 3.3% surge in value over the last 24 hours. ETH is up by 75% year-to-year. Let us look at the price prediction for Ethereum for mid-January 2024.\n\nAlso read: Ethereum: ETH Could Hit $3500 in Q1, But There’s a Catch\n\nSource: ETH price CoinGecko\n\nEthereum price prediction for mid-January 2024\n\nCryptocurrency experts at Changelly have predicted the price of ETH for mid-January 2024. According to the analysts, ETH is forecast to reach a minimum of $2,221 and a maximum of $2,439. The average price of Ethereum is expected to be $2,330.\n\nAlso read: Shiba Inu: Boldest SHIB Price Prediction For 2024\n\nThis can vary greatly depending on market sentiment. The SEC’s much-awaited decision on a Bitcoin ETF approval can likely trigger a market push. Nevertheless, if the market proves to be bullish moving forward, ETH’s price can shoot up."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWJpdGNvaW4tcmF0aW8tZHJvcHMtdG8taGlzdG9yaWMtbG93LWFzLWV0Zi1hcHByb3ZhbC1zcGVjdWxhdGlvbi1oZWlnaHRlbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Bitcoin ratio drops to historic low as ETF approval speculation heightens - CryptoSlate",
        "content": "Ethereum’s value against Bitcoin has dropped to historical lows as market anticipation grows for an imminent launch of a spot exchange-traded fund in the U.S.\n\nData from Paris-based crypto intelligence platform Kaiko showed that the ETH/BTC ratio has steadily declined since the smart-contract-enabled blockchain transitioned into a proof-of-stake network in September 2022. During the last 24 hours, the metric dropped to 0.048, its lowest point since May 2021.\n\nThe ETH/BTC ratio is a crucial measure for gauging Ethereum’s performance in relation to Bitcoin. When this ratio rises, Ethereum gains strength or maintains its value better than Bitcoin, suggesting a market preference for ETH over BTC.\n\nConversely, a decrease in the ETH/BTC ratio indicates Ethereum’s weaker performance compared to Bitcoin, potentially signaling investor leanings toward the perceived safety of Bitcoin.\n\nThis ratio goes beyond mere price movements as it encapsulates shifts in investor confidence and market sentiment between these two prominent cryptocurrencies.\n\nCryptoSlate’s data shows that BTC’s price has greatly outperformed Ethereum’s over the past year. During the period, the top cryptocurrency’s price rose by more than 170% to a 21-month high of more than $47,000, while ETH was able to post a modest gain of 74%.\n\nBTC’s positive run could be attributed to the surrounding market optimism and demands for the potential approval of a spot ETF. Over the past several months, several asset managers, including BlackRock, VanEck, Grayscale, and others, have actively engaged the U.S. Securities and Exchange Commission (SEC) over the applications, fueling speculations that these products could begin trading as early as Jan. 11.\n\nOn the other hand, Ethereum’s lukewarm price performance came amid the launch of several futures-based ETFs for the digital asset last year. These ETFs barely made a ripple in the market as they saw tepid demand, forcing asset manager CoinShares to describe ETH as the “least loved altcoin” compared to rivals like Solana."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYXQtY3JpdGljYWwtanVuY3R1cmUtYXMtbWljaGFlbC12YW4tZGUtcG9wcGUtcHJlZGljdHMtYnVsbGlzaC1icmVha291dNIBZ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYXQtY3JpdGljYWwtanVuY3R1cmUtYXMtbWljaGFlbC12YW4tZGUtcG9wcGUtcHJlZGljdHMtYnVsbGlzaC1icmVha291dD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) at Critical Juncture as Michaël van de Poppe Predicts Bullish Breakout - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn the ever-evolving landscape of the cryptocurrency market, Ethereum (ETH) finds itself at a critical juncture, with renowned crypto analyst Michaël van de Poppe predicting a potential bullish breakout. In a recent tweet, van de Poppe conveyed his insights, indicating that Ethereum was approaching the low of 2022 and was likely to absorb liquidity at that level.\n\nAdvertisement\n\nHe expressed the belief that in the event of a spot ETF approval for Bitcoin (BTC), there would potentially be a liquidation candle on the trading chart for the ETH/BTC trading pair. Following this, analyst van de Poppe foresaw a rotation of funds into Ethereum, accompanied by a bullish weekly divergence.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there.\n\n\n\nIf an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nAccording to the most recent data, Ethereum is presently valued at $2,294, indicating a noteworthy 3.04% uptick in the past 24 hours. The trading volume within this period has experienced a substantial surge, escalating by 36.14% and peaking at $12.48 billion. In the aftermath of this modest rally, ETH has observed $21.60 million in short liquidations and $11.79 million in long liquidations, as reported by CoinGlass.\n\nSpillover effect\n\nThe focal point of van de Poppe's analysis revolves around the potential approval of a Bitcoin spot ETF by the U.S. Securities and Exchange Commission (SEC). The cryptocurrency market anticipates a breakthrough, with BlackRock, a financial behemoth, leading the charge. BlackRock, along with other prominent firms such as Grayscale Investments, Valkyrie and ARK 21Shares, has recently submitted updated 19b-4 filings for their proposed spot Bitcoin ETFs.\n\nMarket sentiment is building as BlackRock expresses confidence in the SEC's approval for its spot Bitcoin ETF, with expectations pointing toward a potential decision as early as this Wednesday. A positive outcome could trigger a ripple effect in the broader cryptocurrency market, impacting not only Bitcoin but also potentially leading to a rotation of funds into Ethereum.\n\nMichaël Van de Poppe's prediction hinges on the notion that Bitcoin spot ETF approval may prompt a notable uptrend for Ethereum. Traders and investors are closely monitoring these developments, recognizing the interconnected nature of cryptocurrencies and the potential spillover effects of major regulatory decisions. As Ethereum stands at this critical juncture, the market awaits further clarity from regulatory bodies and key players in the cryptocurrency space."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvY29pbmJhc2Utc2F5cy1iaXRjb2luLWV0aGVyZXVtLWN1cnJlbnQtY3ljbGVzLXJlc2VtYmxlLTIwMTgtMjAyMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Coinbase says Bitcoin, Ethereum current cycles resemble 2018-2022 - crypto.news",
        "content": "Bitcoin and Ethereum are seemingly following the pattern of previous years, when their prices jumped by 500% and 1,000% respectively, Coinbase research says.\n\nThe current crypto market cycle for Bitcoin (BTC) and Ethereum (ETH) closely echoes the period between 2018 and 2022, when both cryptocurrencies witnessed a significant surge in their prices, according to the latest research report conducted by Coinbase Research and Glassnode.\n\nAs noted by analysts, various metrics of cyclicality, including net unrealized profit/loss and supply in profit, follow the previous trends and indicate that the current state of the crypto markets does not reflect the euphoric conditions witnessed during the maximum of 2023, suggesting the market still has room to surge.\n\nBitcoin price performance since cycle low | Source: Coinbase Research\n\nYou might also like: Bitcoin ETF applicants ramp up BTC purchases ahead of SEC verdict\n\nWhile acknowledging the potential positive impact of the upcoming Bitcoin halving, Coinbase Research remains cautious, noting limited supporting evidence and characterizing the relationship as somewhat speculative.\n\n“With only three halving events historically, we have yet to see a clear pattern fully emerge, particularly as previous events were contaminated by factors like global liquidity measures.” Coinbase Research\n\nThe next Bitcoin halving is expected to take place in April 2024 based on current mining rates. The block reward will decrease from 6.25 to 3.125 BTC.\n\nRegarding Ethereum, analysts spotlight the forthcoming upgrade named Cancun. Anticipated to enhance scalability and security, the upgrade aims to make layer-2 transactions as cost-effective as possible, potentially leading to a significant increase in the number of processed transactions on the Ethereum network.\n\nCoinbase also notes that both Bitcoin and Ethereum have undergone two cycles, encompassing both bull and bear markets, with the ongoing cycle, which initiated in 2022, closely mirrors the patterns observed in the preceding cycles.\n\nRead more: CryptoQuant unveil two potential scenarios for spot Bitcoin ETFs\n\nFollow Us on Google News"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hc3Nlc3NpbmctdGhlLW9kZHMtb2YtZXRoLWNyb3NzaW5nLTI1MDAv0gFLaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWFzc2Vzc2luZy10aGUtb2Rkcy1vZi1ldGgtY3Jvc3NpbmctMjUwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Checking if ETH to $2500 is still on the cards - AMBCrypto News",
        "content": "ETH was up by more than 5% in the last 24 hours.\n\nMarket indicators and metrics remained bullish on the token.\n\nThe crypto market recently turned bullish, allowing most cryptos to register gains, and Ethereum [ETH] was no exception. Though this sudden uptrend gave investors hope of a sustained bull rally, an analyst had something different to say.\n\nEthereum finally turns bullish\n\nAfter a week-long decline, Ethereum investors were finally enjoying profits as the token’s daily chart turned green.\n\nAccording to CoinMarketCap, ETH was up by more than 5% in the last 24 hours. At the time of writing, Ethereum was trading at $2,318.33 with a market capitalization of over $278 billion.\n\nHowever, the latest analysis from CryptoQuant suggested that the probability of ETH moving within a small price range seemed likely.\n\nCryptoOnChain, an analyst and author at CryptoQuant, mentioned in an analysis that derivative market charts indicate a relatively high number of short transactions, which looked bearish.\n\nThe analysis also mentioned that it was unlikely for ETH to initiate a bull rally before Bitcoin [BTC] manages to go above a key resistance level of $43,500.\n\nHowever, the king of cryptos has toppled the resistance level already. At press time, BTC was trading at $46,770.41.\n\nTherefore, AMBCrypto planned to have a closer look at ETH’s metrics to understand whether the king of altcoins can touch $2,500 anytime soon.\n\nEthereum’s metrics look bullish\n\nAMBCrypto’s analysis of CryptoQuant’s data revealed that buying pressure on the token was high. This was evident from the fact that its net deposit on exchanges was low compared to the last seven-day average.\n\nAnother bullish signal was its active addresses, which increased in the recent past.\n\nBuying sentiment among US investors was also high as its Coinbase premium was green. Not only that, but things in the derivatives market also looked pretty optimistic.\n\nEthereum’s funding rate remained green, meaning that derivatives investors were actively buying ETH at its higher price.\n\nIf ETH manages to sustain its bull rally, as suggested by the aforementioned metrics, the coin might face resistance in quite a few zones.\n\nAnalysis of Ethereum’s liquidation levels revealed that in order to maintain a bull rally, ETH must go above the $2,400 mark and then the $2,450 mark in the near future.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe possibility of ETH going above these levels was likely, as most market indicators were bullish.\n\nFor instance, its Money Flow Index (MFI) registered an uptick. Its Chaikin Money Flow (CMF) also followed a similar trend, increasing the chances of a continued uptrend."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV0aC1wcmljZS1yb2FkLXRvLTMwMDAtYW5kLWJleW9uZC_SAWVodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldGgtcHJpY2Utcm9hZC10by0zMDAwLWFuZC1iZXlvbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Price Road to $3,000 and Beyond - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nEthereum (ETH), the largest web3 ecosystem with nearly $30 billion in Total Value Locked (TVL) and around $69 billion in stablecoins market cap, has attracted significant attention from investors amid the notable Bitcoin (BTC) rally. However, the altcoin leader has been consolidating between $2,150 and $2,400 since it broke out of the macro ascending triangle in the fourth quarter of 2023. Having accumulated significant buyers in this range, Ethereum’s price is in the final countdown for an imminent breakout.\n\nEthereum Under Spot BTC ETF Frenzy\n\nEthereum network has registered increased on-chain activity in the past few months fueled by the heightened demand from institutional investors and retail traders. Moreover, ETH provides liquidity to more than 50 percent of the entire altcoin industry including top meme coins like Shiba Inu.\n\nSome notable spot bids have appeared for $ETH on Binance and on lower timeframes we have a potential impulse printed here.\n\n\n\nIn a scenario in which $BTC does not get any notable pullback and instead launches upwards into ETF approval- ETH also likely makes a higher low here and… https://t.co/yo3CmoixUQ pic.twitter.com/RTH96Z8rNI — CrediBULL Crypto (@CredibleCrypto) January 9, 2024\n\nAccording to a popular crypto analyst alias CrediBull Crypto on the X platform, the next Ether’s price action will be determined by the decision on the spot Bitcoin ETF in the United States by tomorrow.\n\nETH Price Analysis\n\nEthereum’s weekly Relative Strength Index (RSI) has been attempting to rally beyond the 70 level in the recent past without success. The top altcoin needs to convert the resistance level around $2,400 into a support level and consistently close above it in the coming weeks to secure a rally above $3,000. According to the weekly auto Fib Retracement, the next Ethereum price targets are at $2,500 then at around $3,150.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there.\n\n\n\nIf an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nMeanwhile, the ETH/BTC weekly charts depict a possible reversal in the near term, which could further signal the onset of the much-awaited altseason."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JyZWFraW5nLW5ld3MtdGlja2VyL3ZhbGt5cmllLWNpby1hbnRpY2lwYXRlcy14cnAtYW5kLWV0aGVyZXVtLXNwb3QtZXRmcy1mb2xsb3dpbmctYml0Y29pbnMtYXBwcm92YWwv0gGBAWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JyZWFraW5nLW5ld3MtdGlja2VyL3ZhbGt5cmllLWNpby1hbnRpY2lwYXRlcy14cnAtYW5kLWV0aGVyZXVtLXNwb3QtZXRmcy1mb2xsb3dpbmctYml0Y29pbnMtYXBwcm92YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Valkyrie CIO Anticipates XRP And Ethereum Spot ETFs Following Bitcoin’s Approval - NewsBTC",
        "content": "While Bitcoin exchange-traded fund (ETF) applications are still awaiting approval from the US Securities and Exchange Commission (SEC), executives from asset management firms are already speculating about the potential launch of spot ETFs for other major cryptocurrencies, including XRP and Ethereum (ETH).\n\nValkyrie Invest’s Chief Investment Officer, Steven McClurg, expressed his belief that the SEC’s potential approval of a Bitcoin ETF could pave the way for similar offerings in the XRP and Ethereum markets.\n\nHowever, regulatory challenges and classifying XRP and Ethereum as securities may present hurdles toward these index funds.\n\nXRP And Ethereum Spot ETF Potential Hurdles\n\nUnlike Bitcoin, which has been classified as a commodity by regulators, XRP and Ethereum have been deemed securities. This divergence in classification poses potential difficulties and may necessitate a more complex approval process for spot ETFs tracking these cryptocurrencies.\n\nThe anticipated impact of spot ETF approval on the XRP and Ethereum price would mirror the pattern seen with Bitcoin. Still, the SEC’s skepticism towards the broader cryptocurrency market could pose additional hurdles for XRP and Ethereum ETFs.\n\nNevertheless, the outcome of the ongoing Ripple vs. SEC case holds significant implications and could hold the key for the cryptocurrency industry to pursue these index funds for other cryptocurrencies.\n\nIf Ripple, the blockchain payment company associated with XRP, emerges victorious and is not classified as a security by Judge Analisa Torres, it could establish a precedent for asset managers seeking to apply for an XRP ETF.\n\nThis legal precedent could also prompt potential litigation against the SEC to support an Ethereum ETF application.\n\nWhile discussions revolve around the possibility of spot ETFs for XRP and Ethereum, there is still uncertainty surrounding the approval of Bitcoin ETFs.\n\nThe SEC may reject or delay the pending applications, making it uncertain whether these other index funds will materialize. Furthermore, US regulators’ current classification of XRP and Ethereum as securities adds an additional layer of complexity to their respective ETF prospects.\n\nBitcoin ETF Decision Imminent\n\nAs reported on Monday by NewsBTC, Sources close to the process have indicated that the ultimate approval for Bitcoin ETFs may come on Wednesday.\n\nCNBC’s sources suggest that this coincides with the application deadline for Ark Invest and 21 Shares, raising the possibility of a potential trading launch between Thursday and Friday. Several applications are expected to receive the green light, pending updates from the SEC on the filings.\n\nOverall, as anticipation builds around the potential approval of Bitcoin ETFs, asset managers are already contemplating the prospect of spot ETFs for other major cryptocurrencies like XRP and Ethereum.\n\nHowever, the regulatory challenges and the classification of XRP and Ethereum as securities present significant hurdles for these index funds. The Ripple vs. SEC case outcome could have far-reaching implications, potentially setting a legal precedent for asset managers to pursue XRP and Ethereum ETFs.\n\nXRP is trading at $0.5673, showing a lack of bullish momentum with a 1% decline in the past 24 hours. Furthermore, it has experienced a continuous downtrend of 13% over the past 30 days.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcG9pc2VkLWZvci1icmVha291dC1hbmFseXN0LXBpbnBvaW50LWtleS1sZXZlbHMv0gFjaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1wb2lzZWQtZm9yLWJyZWFrb3V0LWFuYWx5c3QtcGlucG9pbnQta2V5LWxldmVscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Poised For Breakout? Analyst Pinpoint Key Levels For Monumental Surge - NewsBTC",
        "content": "So far, Ethereum appears to be showing signs of an impending bullish run, according to Crypto Tony, a renowned analyst in the crypto space. Crypto Tony suggests that Ethereum’s journey to bullish momentum could commence if it successfully maintains its position above the crucial level of $2,130.\n\nFortunately, the asset trades above this price level and appears to be climbing further above it, with its current trading price of $2,264 at the time of writing.\n\nKey Levels For Major ETH Rally\n\nThe $2,130 price mark, as disclosed by Crypto Tony, is seen as a pivotal point for Ethereum, as maintaining this level could signal “strength and stability,” setting the stage for further gains.\n\nThis optimism further escalates should Ethereum reclaim the range high at $2,500, a price level Crypto Tony revealed that would reinforce the bullish sentiment in the Ethereum market. Notably, Crypto Tony’s bullish outlook aligns with the sentiments of other analysts in the crypto community.\n\n$ETH / $USD – Update The ETH range is simple. Remain above $2,130 and we are bullish .. Reclaim the range high at $2,500 and we are really bullish pic.twitter.com/YKOph2YbRY — Crypto Tony (@CryptoTony__) January 8, 2024\n\nFor instance, Ali Chart, another notable crypto analyst, has identified $3,830 and $5,100 price levels as Ethereum’s following major targets based on the Market Value to Realized Value (MVRV) price bands.\n\nFor context, MVRV is a key on-chain metric or indicator that compares a cryptocurrency’s market value (market cap) to its realized value, offering an alternative approach to assess the network’s valuation by considering the price at which each unit last moved.\n\nThe MVRV ratio is a crucial indicator that can be utilized especially for gauging the relative valuation of a crypto asset like Ethereum. When the MVRV ratio is high, it often suggests that the cryptocurrency’s price may be overvalued, and when it’s low, the asset could be undervalued.\n\nAccording to the #Ethereum MVRV Pricing Bands, the next key price targets for $ETH are $3,830 and $5,100! pic.twitter.com/cLo4crWkPF — Ali (@ali_charts) January 1, 2024\n\nAccording to a chart recently shared by Ali Chart on X, Ethereum is currently on an upward trajectory, with the next significant MVRV Pricing Bands at 2.4 and 3.2. These levels indicate that Ethereum may become overvalued, correlating to Ali’s price targets for Ethereum at around $3,830 and $5,100, respectively.\n\nEthereum Whale Movements Backs Bullish Sentiment\n\nAdding to the bullish sentiments are recent whale movements. Spot On Chain has disclosed that an Ethereum whale, identified as ‘0x931’, made a significant purchase of 21,192 ETH, valued at approximately $48 million, at an average price of $2,265.\n\nThis accumulation of ETH is a strong indicator of confidence in Ethereum’s future performance, as the whale has now held roughly 79,500 ETH since January 2023, sitting on an unrealized profit of $36.84 million.\n\nMoreover, last week’s on-chain data from Santiment revealed that Ethereum’s largest private wallets now hold a record 56.25 million ETH, representing 46.8% of the crypto’s total circulating supply. This concentration of ETH in large wallets could be interpreted as a sign of long-term holding strategies among major investors.\n\nAmid these developments, Ethereum has been showing signs of recovery from its recent retracement. Despite a week of decline, the altcoin is beginning to exhibit an upward trajectory, with a near 2% increase in the past 24 hours, trading at around $2,272.\n\nThis recovery is further evidenced by a surge in trading volume, which has surged from a low of $11 billion last Monday to over $20 billion, indicating a possible increasing buying activity.\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1ldGgtcHJpY2UtaGl0LTI0MDAtaW4tbmV4dC00OC1ob3Vycy1haGVhZC1vZi1iaXRjb2luLWV0Zi12ZXJkaWN0L9IBhwFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1ldGgtcHJpY2UtaGl0LTI0MDAtaW4tbmV4dC00OC1ob3Vycy1haGVhZC1vZi1iaXRjb2luLWV0Zi12ZXJkaWN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETH Price Hit $2400 in Next 48 Hours Ahead of Bitcoin ETF Verdict? - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights With a consolidation range formation below the $2400 mark, ETH price coils up huge trend momentum.\n\nThe recent overnight recovery with high anticipations around the Bitcoin Spot ETF fuels the rally in altcoins in Ethereum.\n\nRising momentum and improving sentiments tease a breakout run in ETH price to $2700.\n\nKeeping a bullish stance in the long consolidation range, the ETH price finds constant support at the bottom base of $2200. Becoming a multi-contact point of reversal, Ethereum price continuously the streak of bullish engulfing formation from the crucial support level.\n\nLasting for more than 30 days, the Ethereum price constantly struggles to enter a decisive trend. Nevertheless, the recent market-wide recovery aligns with our ETH price prediction, which holds a bullish standpoint for the upcoming trend.\n\nBuyers Preparing Breakout Challenges $2400 Barrier.\n\nSource – TradingView\n\nDespite the recent failure to sustain the New Year’s rally, the ETH price avoids a downfall like other altcoins of lesser market cap. With the strong buying activity at the $2200 support level, the bulls are prolonging the range formation and coiling up more trend momentum.\n\nThe intent is clear to provide a high-speed move upon the fracturing of the boundary on either side. Moreover, the spike in the buying pressure, evidenced by the spike in trading volume supporting the price jumps, improves the breakout chances.\n\nCurrently, the ETH price trades at $2308 and takes a 1.04% intraday pullback following the 4.94% jump last night. As the tradition of $2200 bouncing the Ethereum price continues, the $2400 breakout possibility sustains.\n\nTechnical indicators:\n\nRSI indicator: The daily RSI line shows a sideways trend, diluting the prevailing downfall near the halfway line. Moreover, the bullish divergence in the past two dips at the $2200 support increases the bull run chances.\n\nMACD Indicator: The MACD and signal lines close up the gap with the recent jump in ETH price and tease a bullish crossover. Further, the recent price jump in Ethereum shows a spike in average lines, reflecting improved sentiment and a potential comeback for Ethereum.\n\nThe Bears Are On The Verge Of Liquidation\n\nFollowing the recent liquidation event of almost $100Mn Liquidation from the bulls, the ETH price stabilizes normally within the range. Further, the recent liquidation chart from Coinglass shows a spike in liquidations on the bearish side.\n\nAs bears lose $42Mn due to liquidation on Monday and the uptrend gaining momentum, the Ethereum price may soon make a strong comeback. This can lead to more bearish liquidations in the coming days.\n\nIs Ethereum Ready to Cross $2400?\n\nAs per the technical analysis, the ETH price action shows a high momentum bullish trend entering a sideways track. Therefore, as per the price pattern analysis, a bullish flag pattern forms in the daily chart. Hence, the breakout of the consolidation range is most likely on the upside as the flag pattern is a trend continuation pattern.\n\nThe recent surge has tested the $2400 level and presented a breakout entry for traders who missed the $220 breakout. Additionally, the likelihood of Ethereum crossing the $2500 level is increasing, with significant upside potential remaining. The uptrend could potentially reach the $2700 level.\n\nConversely, a reversal could drive the price of ETH back to $2200."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzA5L2NyeXB0by1iZWFyLXNheXMtZmFrZW91dC1yYWxsaWVzLWFuZC10aGVuLW1hc3NpdmUtY29ycmVjdGlvbnMtY29taW5nLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bS_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMDkvY3J5cHRvLWJlYXItc2F5cy1mYWtlb3V0LXJhbGxpZXMtYW5kLXRoZW4tbWFzc2l2ZS1jb3JyZWN0aW9ucy1jb21pbmctZm9yLWJpdGNvaW4tYW5kLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Crypto Bear Says Fakeout Rallies and Then Massive Corrections Coming for Bitcoin and Ethereum - The Daily Hodl",
        "content": "A widely followed crypto bear believes that major corrections are coming for Bitcoin (BTC) and Ethereum (ETH) after fleeting rallies.\n\nPseudonymous trader Capo tells his 83,873 Telegram subscribers that the possible approval this week of a spot Bitcoin exchange-traded fund (ETF) will likely ignite a short-lived rally for Bitcoin and other digital assets.\n\n“Whales are showing strong interest in the $48,000-$50,000 level. News can trigger volatility and leave large wicks. So a pump to that level and a big rejection afterward is a likely scenario.”\n\nThe trader shares a chart predicting Bitcoin’s price action “for the next few days.”\n\nLooking at his chart, the trader suggests that Bitcoin will soar toward $51,000 upon news of the approval of a spot market Bitcoin ETF. After the rally, he suggests that Bitcoin will likely correct down to the $30,000-$31,000 as whales “sell the news.”\n\nThe trader also predicts Ethereum will rally to as high as $2,600 before correcting. And he expects other altcoins to also undergo a massive correction after a brief move to the upside.\n\n“Interesting week ahead. ETF news should be released soon. As explained these days, I expect the market to pump first. BTC to $48,000-$50,000, ETH to $2,500-$2,600. Alts should pump more, especially low caps. After this, which should take a few days, the market should reach a very important local top. That’s when I will start opening swing short positions, aiming for new lows.”\n\nLooking further out, the trader maintains his long-standing prediction that Bitcoin will eventually collapse to the $12,000 level, which his chart suggests will happen around April.\n\n“BTC HTF (high timeframe) idea.”\n\nBitcoin is trading for $46,776 at time of writing, up 7% in the last 24 hours. Meanwhile, Ethereum is trading for $2,314 at time of writing, up 4.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL2ZhbnRvbS1mb3VuZGVyLWFuZHJlLWNyb25qZS1yZWZsZWN0cy1vbi1iaXRjb2luLWV0aGVyZXVtcy1zdGF0ZS1ibG9hdC1wcm9ibGVtL9IBZ2h0dHBzOi8vY29pbmdhcGUuY29tL2ZhbnRvbS1mb3VuZGVyLWFuZHJlLWNyb25qZS1yZWZsZWN0cy1vbi1iaXRjb2luLWV0aGVyZXVtcy1zdGF0ZS1ibG9hdC1wcm9ibGVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Fantom Founder Andre Cronje Reflects On Bitcoin & Ethereum's State Bloat Problem - CoinGape",
        "content": "Fantom co-founder Andre Cronje, known as the godfather of decentralized finance (DeFi), further raised concerns over probabilistic finality in blockchains including Bitcoin and Ethereum as the market sees expanding use cases and adoption in traditional finance. He said Fantom has already solved state bloat as Ethereum developers look to solve state bloat in the chain.\n\nAndre Cronje Says Fantom Has Resolved S tate Bloat Issue\n\nIn response to Ambient Finance founder Doug Colkitt’s belief that Ethereum is the only chain looking to solve state bloat in its long-term plan, Andre Cronje said “I am pretty confident in saying we already solved state bloat at Fantom.”\n\nadvertisement\n\nEthereum roadmap entails using Verkle trees to allow for “data to be small enough to be attached to every block.” It could help validators and nodes to become stateless as all ‘state’ can be stored more efficiently off-chain.\n\nHowever, Andre Cronje said any blockchain that uses probabilistic finality or any variant of the longest chain rule won’t resolve this issue. Bitcoin and Ethereum chains depend on probabilistic finality. Finality refers to when a block of transactions is considered permanent and cannot be altered or reversed.\n\nFantom uses aBFT (Asynchronous Byzantine Fault Tolerance) consensus mechanism, which does not require the longest chain rule.\n\nMoreover, Fantom introduced the new database Carmen, a flat storage method that does not use tree or dictionary structures while maintaining a cryptographic signature of the world state. This greatly reduces the bloat of the current active state (two epochs). Carmen supports real-time pruning, and although archive nodes still need to retain all data, most validators can enable pruning.\n\nAfter adopting the above technology, Fantom’s status is reduced from about 2TB (archive) to 60GB (archive). Cronje said state bloat has been one of Fantom’s core milestones since its early days.\n\nAlso Read: BlackRock And VanEck Files Updated S-1 For Spot Bitcoin ETF Approval"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1wcmljZS1idGN0aHVuZGVycy1wYXN0LTQ3ay1ldGhlcmV1bS1nYWlucy1tb21lbnR1bS1wZXBlLXByaWNlLXJhbGxpZXMtMTEv0gF-aHR0cHM6Ly9jb2luZ2FwZS5jb20vY3J5cHRvLXByaWNlcy10b2RheS1iaXRjb2luLXByaWNlLWJ0Y3RodW5kZXJzLXBhc3QtNDdrLWV0aGVyZXVtLWdhaW5zLW1vbWVudHVtLXBlcGUtcHJpY2UtcmFsbGllcy0xMS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Price (BTC)Thunders Past $47K, Ethereum Gains Momentum, Pepe Price Rallies 11% - CoinGape",
        "content": "The cryptocurrency market made a stellar comeback on Monday, with Bitcoin thundering past $47,000 for the first time in almost 2 years as anticipation grew about the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the US.\n\nThe OG cryptocurrency Bitcoin rose sharply from $43,280 in early morning trade in Asia to $47,193 — the highest level since April 2022 — during the US session, before paring some gains.\n\nadvertisement\n\nWith institutional interest in Bitcoin on the rise, Bitcoin’s (BTC) price went up nearly 8% over the last 24 hours to $46,931. The market cap of Bitcoin rose to $919.5 billion while trading volumes jumped a whopping 103% to $43.2 billion over the last 24 hours.\n\nEthereum — the third largest crypto — followed a similar upward trend, gaining nearly 5.5% over the last 24 hours to $2,311. As of writing, Ether commanded a market cap of $277.9 billion while trading volumes stood at $13.2 billion, up 68% over the last 24 hours.\n\nWhile Tether (USDT) prices largely remained flat, BNB price climbed 1.8% and XRP price rose over 2.3% in the past 24 hours. The remaining top 10 cryptocurrencies by market cap also rose sharply. Solana (SOL) rallied nearly 16% over the last 24 hours, Cardano (ADA) was up 11% while Avalanche (AVAX) surged over 14%.\n\nPopular meme coins — Dogecoin and Shiba Inu — also saw their prices rising over the last 24 hours by 5.2% and 7.5%, respectively. The global crypto market was buoyed by the optimism, having surged over 7% over the last 24 hours to $1.72 trillion The fear and greed index level stood at 74, indicating investor sentiment was positive.\n\nTop 3 Cryptos For Today\n\nPepe Price Rallies 11%\n\nThe price of Pepe Coin climbed 11% over the last 24 hours to $0.000001184, with its market cap standing at $498.3 million. Its trading volume over the last 24 hours went up over 1.5% to $86 million.\n\nPepe Price Chart\n\nSEI Price Jumps Over 17%\n\nThe Sei Network’s namesake token has seen a more than 17% increase in the last 24 hours. At press time, SEI’s price stood at $0.7224, with its market cap standing at $1.6 billion. The 24-hour trading volumes stood at $731.5 million, up more than 13% in the last 24 hours.\n\nLido DAO Gains 8%\n\nThe Lido DAO (LDO) token has been on a roll. In the past 24 hours, the LDO Price rose over 8% to $3.13, and the token was sitting at a market cap of $2.8 billion. However, trading volumes over the last 24 hours dropped over 4% to $169.2 million. Note that the token has appreciated over 26% in the past 30 days.\n\nAlso Read: Breaking: Bitcoin ETF Filers Unswayed By US SEC Comments On S-1s, Approval Ahead?"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvLm5ld3MvY2Vsc2l1cy1wYXlzLW92ZXItOTBtLXRvLWNvaW5iYXNlLWFuZC1mYWxjb254LXZpYS11bnN0YWtlZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Celsius pays over $90m to Coinbase and FalconX via unstaked Ethereum - crypto.news",
        "content": "Over the past week, a total of 40,000 Ethereum, estimated to be over $90 million, was transferred by Celsius to its significant creditors, Coinbase and FalconX.\n\nAccording to Arkham Intelligence, Celsius still retains a substantial amount of Ethereum in its Staked ETH account, amounting to approximately 59,000 ETH, valued at over $133 million. The bankrupt lender’s recent activity is a strategic maneuver to unlock a considerable portion of its Ethereum holdings. This decision is part of a comprehensive plan designed to facilitate the allocation of assets to the firm’s creditors, a major step in its bankruptcy proceedings.\n\nCelsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process — Celsius (@CelsiusNetwork) January 4, 2024\n\nYou might also like: Celsius moves to unstake $470m in ETH for creditor repayments\n\nHaving filed for Chapter 11 bankruptcy protection in July 2022, Celcius grappled with a severe liquidity crisis, exacerbated by the downturn in the cryptocurrency market following the UST crash and FTX’s collapse. The decision to unstack Ethereum will potentially generate the liquidity needed to navigate the costs associated with the restructuring process and ensure that creditors receive their dues on time.\n\nOn Boxing Day, the court approved Celsius Network and its associated unsecured creditors to proceed with the “MiningCo Transaction.” This decision, documented in court filings, allows Celsius to move forward with a specific part of its restructuring plan.\n\nDespite objections from the United States Trustee, a group of borrowers, and individual creditors like Cathy Lau and Anne Yeilding, the court ultimately sanctioned Celsius’s plan. This approval, along with the company’s recent ETH unstaking efforts, is a significant step in its ongoing efforts to manage its bankruptcy and restructure its operations.\n\nRead more: Spot Bitcoin ETF issuers file new AP disclosures with SEC\n\nFollow Us on Google News"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvLm5ld3MvZmlkZWxpdHlzLXNwb3QtYml0Y29pbi1ldGYtbGF1bmNoZXMtb24tZHRjYy1kZWJ1dC1ldGhlcmV1bS13aGFsZXMtYmFuay1vbi1haS1hbHRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Fidelity's spot Bitcoin ETF launches on DTCC debut, Ethereum whales bank on AI altcoin - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nA spot Bitcoin ETF by Fidelity was recently listed on the DTCC website. This development might push Bitcoin prices further, generating a positive outlook for other cryptocurrencies. Meanwhile, an anonymous Ethereum whale is doubling down on InQubeta (QUBE). This project merges artificial intelligence (AI) and blockchain technologies.\n\nThis article explores why the Ethereum whale considered InQubeta as Fidelity’s spot ETF lists on DTCC.\n\nInQubeta presale success\n\nInQubeta is a platform that connects AI startups with investors, industry professionals, and technology enthusiasts.\n\nIts fractional investment model allows investors with different budgets to find suitable investment opportunities.\n\nYou might also like: XRP to surge 390,000%; InQubeta presale approaches $9m\n\nInQubeta has raised over $8 million and sold over 704 million QUBE in its presale.\n\nQUBE is deflationary. This is achieved by allocating a 2% tax to a burn wallet and an additional 5% to a reward pool for buying or selling.\n\nQUBE holders can earn rewards by staking.\n\nMarket expects imminent approval of spot Bitcoin ETFs\n\nFidelity Investments has placed its spot Bitcoin ETF on DTCC under the ticker FBTC, bringing it closer to official approval.\n\nThis move follows similar listings by other companies, like BlackRock, and reflects increasing institutional acceptance of digital assets.\n\nYou might also like: Pantera, VanEck prepare to make investment following spot Bitcoin ETF approval\n\nThe deadline for the SEC to approve an ETF is on Jan. 10, 2024.\n\nAhead of this, BTC prices are inching higher.\n\nEthereum leads the smart contracts landscape\n\nEthereum is a platform that powers many decentralized applications, including smart contracts.\n\nThis has attracted various entities to Ethereum (ETH), such as corporations and industries.\n\nRecently, an anonymous investor recognized InQubeta’s potential. This altcoin utilizes AI technology for sustainable growth and profit potential.\n\nConclusion\n\nInvestors can purchase QUBE using ETH, BTC, and USDT in the ongoing presale.\n\nQUBE prices will rise from $0.01925 to $0.0224 in the next funding round.\n\nInQubeta’s approach to crowdfunding and inclusive investment models make it an attractive investment opportunity.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1wcmVkaWN0cy1ldGhlcmV1bS1wcmljZS1pZi1iaXRjb2luLWV0Zi1pcy1hcHByb3ZlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "ChatGPT Predicts Ethereum Price If Bitcoin ETF Is Approved - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nThe possibility of a spot Bitcoin ETF being launched in the US has the crypto community buzzing, with some analysts speculating that these funds could be approved as early as this week.\n\nWe tasked the AI model ChatGPT with providing an in-depth price prediction for Ethereum (ETH) if one of these ETFs was given the green light.\n\nChatGPT also highlighted a new altcoin, Bitcoin Minetrix (BTCMTX), that could be primed to benefit from the tailwinds associated with ETF approval.\n\nHow Could Spot Bitcoin ETF Approval Affect Ethereum’s Price?\n\nWhile Ethereum and Bitcoin are separate blockchains with different use cases, the two leading cryptos have often moved in tandem in the market and look likely to continue doing so.\n\nThe reasons are multifaceted – for one, regulatory approval of a spot BTC ETF could mean greater legitimacy for cryptocurrencies as an asset class.\n\nIn turn, this may inspire investor confidence in altcoins like Ethereum.\n\nAdditionally, launching a successful BTC ETF may increase the appetite for a spot ETH ETF down the line, which would likely boost the ETH price in anticipation.\n\nHowever, some analysts caution that the actual debut of a spot BTC ETF could be underwhelming relative to expectations.\n\nThis might start a wave of profit-taking that spills over into Ethereum and other altcoins.\n\nStill, the overall consensus suggests a spot ETF would introduce new institutional inflows, outweighing any short-term volatility.\n\nFor this reason, Ethereum investors are eagerly anticipating the potential launch of one of these funds in the US.\n\nChatGPT’s Bullish ETH Price Prediction If SEC Gives Spot ETF Green Light\n\nMoving from market speculation to AI-generated projections, we consulted ChatGPT to analyze how the approval of a spot Bitcoin ETF could impact Ethereum’s price outlook.\n\nWith ETH currently trading around $2,270, ChatGPT delivered an overwhelmingly bullish forecast.\n\nThe AI model argues ETF approval would accelerate crypto asset adoption, attract institutional dollars, and create a halo effect, boosting the broader altcoin market – all positive for Ethereum.\n\nConsidering these factors and Ethereum’s independent growth drivers within the DeFi space, ChatGPT sees significant upside potential even after the recent rally.\n\nIn the model’s most optimistic scenario, if a spot BTC ETF gets the green light, ChatGPT predicts ETH could reach between $3,000 and $4,000 by the end of the year.\n\nThis would represent a rally of up to 76% from current levels.\n\nWhile this forecast is entirely hypothetical, ChatGPT makes a strong case for ETH benefiting from a regulatory breakthrough on the Bitcoin front.\n\nWhich Other Coins Could Rise After Spot Bitcoin ETF Approval?\n\nWhile all the attention is being given to Bitcoin and Ethereum, a spot BTC ETF could open the floodgates for capital into smaller-cap tokens.\n\nOne under-the-radar project on the verge of a significant breakthrough is Bitcoin Minetrix (BTCMTX), an innovative Stake-to-Mine platform in its presale phase.\n\nChatGPT Predicts 687% Price Pump for Bitcoin Minetrix as Presale Nears $8M Milestone\n\nAs a crypto project striving to open Bitcoin mining to mainstream investors, Bitcoin Minetrix is well-positioned to ride the wave of interest from spot BTC ETF approval.\n\nThe project’s novel “Stake-to-Mine” model lets users earn BTC rewards by staking BTCMTX tokens rather than running expensive mining hardware.\n\nThis feature has already helped raise over $7.9 million in presale funding, showcasing strong investor interest.\n\nWe asked ChatGPT how BTC ETF approval could impact Bitcoin Minetrix’s price outlook in 2024.\n\nThe AI model cited several bullish factors, including increased crypto legitimacy, which would translate into potential tailwinds for mining tokens like BTCMTX.\n\nConsidering these factors, ChatGPT forecasts that BTCMTX’s price could rise as high as $0.10 if the token is listed on exchanges following spot ETF approval.\n\nShould ChatGPT’s prediction come true, it would represent a staggering 687% increase from the current presale price of $0.0127.\n\nWith anticipation ramping up in the Bitcoin Minetrix Telegram group, ChatGPT’s bullish forecast could fuel further enthusiasm and attract more attention to the project.\n\nVisit Bitcoin Minetrix Presale"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vY29pbmpvdXJuYWwubmV0L2V0aGVyZXVtL2J1eS9wYXlwYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "5 Best Ways to Buy Ethereum With PayPal in 2024 - CoinJournal",
        "content": "5 Ways to Buy Ethereum With PayPal\n\nHere are reviews of some of the best places to buy Ethereum with PayPal, along with step-by-step instructions on how to do so.\n\n1. eToro – Overall Best Way to Buy Ethereum With PayPal\n\neToro is the best place to buy ETH with PayPal as it is a regulated platform with strong security. It also provides access to a variety of other asset types and has a unique range of social investing features.\n\nHow to Buy Ethereum With PayPal on eToro\n\n1. Create a free account\n\nGo to the eToro website and click “Join Now”. This will take you to the registration page, where you can fill in a username, email address, and password. Tick the boxes to accept the terms and conditions, then click “Create Account”.\n\n2. Verify your account\n\nClick the link emailed to you to verify your email address and then complete your profile with further details such as your full name, date of birth, and address. You may have to upload a photo ID to verify your identity, and you’ll need to answer some questions about your investing experience before you can get started.\n\n3. Make a deposit with PayPal\n\nYou can make a deposit by using the “Deposit Funds” button and entering the amount you want to transfer. Click on the payment method and select PayPal from the dropdown list. You will be redirected, and you will need to fill in your PayPal password to complete the transaction.\n\n4. Buy Ethereum\n\nUse the search box at the top to find Ethereum and click on “Trade” next to it. In the box that pops up, simply enter how much you want to buy and click “Open Trade”. You also have the option to switch from Trade to Order if you want to buy ETH once it reaches a certain price.\n\nWhy Use eToro?\n\neToro has attracted millions of users around the world and a reputation for reliability over the many years it has been operating. It is highly trusted as a safe place to buy Ethereum as it employs top-tier security practices such as cold storage and encryption.\n\nThe platform is easy to use, making it a great choice for beginners, and there are no fees for making PayPal deposits. You can even practise trading ETH risk-free in your virtual account. There are charts and tools to help with research and analysis of Ethereum and eToro’s 70+ other coins, while you can also invest in other asset classes, such as stocks, indices, and ETFs.\n\neToro stands out from competitors by virtue of its social investing features. You can connect with and learn from other ETH traders, and even replicate the trades of professionals with the unique CopyTrader feature.\n\nPayPal can’t be used for deposits in some of the countries that eToro serves, and there will be a $5 fee if you want to use PayPal (or any other method) for a withdrawal, but the crypto trading fees are transparent and competitive at 1% plus spread. Read the full eToro review here.\n\nPros\n\nQuick and easy to buy ETH\n\nSecure and regulated\n\nVirtual account\n\nMulti-asset platform\n\nCopy trading\n\nFree PayPal deposits\n\nMobile app\n\nCons\n\nPayPal deposits unavailable in the UK\n\n$5 withdrawal fee\n\nOpen Account 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.\n\n2. Coinbase – Best Way to Buy Ethereum With PayPal for Beginners\n\nCoinbase aims to make crypto accessible to everyone. Its easy-to-use interface, strong security, and low trade minimums make it ideal for beginners who want to buy ETH with PayPal safely.\n\nHow to Buy Ethereum With PayPal on Coinbase\n\n1. Create a free account\n\nHead to the Coinbase website and click on “Get Started”. Fill in your full name, email address, and password to create an account. You will need to click the verification link you receive by email and then enter your phone number and the verification code you will be texted.\n\n2. Verify your identity\n\nProvide some further information, such as your address and date of birth, and then answer some questions about your work and investment activities. You will need to provide a photo ID, which you can do in the Account limits section under Settings. Select your ID type and upload an image of your driving licence or state-issued ID.\n\n3. Link your PayPal account\n\nClick on “Add a payment method” in the Payment methods section under Settings and then select PayPal. You will need to log into your PayPal account when you are redirected. After that, US customers will be able to make PayPal deposits or fund purchases with PayPal.\n\n4. Buy Ethereum\n\nClick on the “Buy / Sell” button at the top, select Ethereum, and enter how much you want. If you haven’t already made a PayPal deposit, you can select PayPal from the list of options under “Pay with”. Click on “Preview Buy” and then hit the buy button if you are satisfied.\n\nWhy Use Coinbase?\n\nCoinbase has a very clear layout, and the platform is easy to navigate, making it the top choice for many beginners. It’s also great for those who only want to invest a little in Ethereum, as the minimum order amount is just $2.\n\nThere is a good selection of over 150 other cryptocurrencies, and if you don’t want to miss anything, you can add Ethereum to your watchlist to get price alerts. You can also use the recurring buys feature if you want to use a dollar-cost averaging strategy.\n\nYou can access more advanced features such as customisable charts and technical indicators through the Coinbase Pro platform. What’s more, the trading fees are pretty competitive at 0.6% plus spread.\n\nUK and European users can’t use PayPal to make deposits or purchases, but they can still cash out with PayPal. If you’re in the US, however, you can make PayPal deposits for a 2.5% fee, or buy ETH directly with PayPal for a 3.99% fee. Read our full Coinbase review here.\n\nPros\n\nEasy to use\n\nBuy as little as $2 of ETH\n\nOver 150 other coins\n\nEducational resources\n\nLearn and earn campaigns\n\nSet up recurring buys\n\nSecure and regulated\n\nMobile app\n\nCons\n\nHigh minimum deposit\n\nPayPal deposits/purchases only available in the US\n\nHigh fees for using PayPal\n\nSign up to Coinbase Disclaimer\n\n3. Binance – Best Way to Buy Ethereum With PayPal Without Fees\n\nWith a huge array of cryptocurrencies and advanced trading features, Binance is a popular platform for experienced traders. Although you can’t make PayPal deposits on Binance, you can use PayPal as a payment method on Binance’s peer-to-peer (P2P) platform.\n\nHow to Buy Ethereum With PayPal on Binance\n\n1. Create a free account\n\nOn the Binance website, click the “Register” button and then click “Sign up with phone or email” (alternatively, you can sign up with Apple or Google). You will then need to fill in your country, phone number or email address, and password. Then enter the verification code you receive by text or email.\n\n2. Verify your identity\n\nSelect Identification from the menu under your user icon, and in the Identity Verification section, click “Verify” and select your country. Fill in some personal information, choose your ID type, and upload an image of your ID. You will then need to give Binance access to your webcam, so your identity can be verified through facial recognition.\n\n3. Add PayPal as a P2P payment method\n\nSelect the Payment tab on the left of your dashboard and click “Add a payment method”. You should be able to find PayPal under “More”. Enter the necessary information for your PayPal account and use your verification code to authenticate it.\n\n4. Buy Ethereum on Binance P2P\n\nUnder the Trade tab, click on Binance P2P and then select Ethereum. You can use the filters to set PayPal as the payment method, select your local fiat currency, and enter an amount and region if you wish. Next, choose a seller, click on the “Buy” button, and complete the PayPal payment by following the onscreen instructions.\n\nWhy Use Binance?\n\nExperienced traders will find Binance a great choice as there are more than 600 cryptocurrencies available in addition to ETH, as well as charts, technical indicators, and derivatives. Once you’ve purchased some ETH, there are also earning products, such as staking and savings accounts, that provide interest.\n\nYou can manage your account from anywhere with the Binance app, and if you’re new to crypto, there is a wealth of educational materials on cryptocurrencies and trading in the Binance Academy.\n\nThere are no trading fees when using Binance P2P, as you will be dealing directly with the seller. As the seller sets the exchange rate, you could still end up paying more than when buying elsewhere with fees, though. You can use the Express tab if you want a simplified P2P trading experience.\n\nEscrow should give you some security, and you should not release your funds from escrow until you receive your crypto. You should still be cautious, though, when trading P2P and be vigilant for possible scams. Read the full Binance review here.\n\nPros\n\nNo fees on Binance P2P\n\nSimplified P2P process for beginners\n\nFunds secured with escrow\n\nEarn interest on your ETH\n\nOver 600 other coins\n\nTechnical analysis tools\n\nEducational resources\n\nMobile app\n\nCons\n\nOther P2P users may attempt to scam you\n\nPrice set by seller may be higher than other platforms\n\n4. Buy Ethereum With PayPal on Skilling\n\nSkilling leads the way when it comes to trading contracts for difference (CFDs). There is a wide array of crypto CFDs available on the platform for you to trade once you’ve made a PayPal deposit.\n\nHow to Buy Ethereum With PayPal on Skilling\n\n1. Create a free account\n\nIn the top right corner of the website, click on the “Sign up” button. You will need to provide your email address, password, and country. Then, you can click “Sign up” to create an account.\n\n2. Verify your identity\n\nTo verify your identity, you’ll need to fill in your phone number, tax number, employment information, and answer questions about your trading experience. You will also need to submit a photo ID and some form of proof of address, like a utility bill.\n\n3. Make a deposit with PayPal\n\nIn your account settings, click on “Deposit”. The payment options available in your country will be shown at the top, and you can scroll along until you find PayPal. Fill in the amount, click “Deposit”, and follow the instructions to complete your payment.\n\n4. Start trading Ethereum\n\nGo to the crypto section of the platform and use the search box to find Ethereum. Simply fill in how much you wish to purchase and click on the “Buy” button.\n\nWhy Use Skilling?\n\nThe benefit of trading Ethereum CFDs is that they enable you to profit from crypto price changes without actually owning any coins—so you don’t need to worry about storage or security. CFDs are high risk, however, so should only be traded by experienced traders, as there is the potential for significant losses.\n\nUsers can take comfort from the fact that the platform is secure and regulated, while there is a customer support team on hand to provide assistance over the phone, email, or live chat. Skilling offers up to 50x leverage on Ethereum, and also facilitates the trading of other asset types, including shares, commodities, forex, and indices.\n\nYou can choose the trading platform that best suits your experience and needs. Beginners will find the Skilling Trader platform ideal as its intuitive interface is user-friendly. Meanwhile, advanced traders may prefer the cTrader platform, where they can access algorithmic trading and technical indicators.\n\nThe minimum PayPal deposit is $100, and money can be deposited instantly for free. The trading fees start from 0.1% plus spread, but Ethereum CFDs aren’t available to users in the UK. Read our Skilling review.\n\nBuy Ethereum with PayPal on Skilling 82% of retail CFD accounts lose money.\n\n5. Buy Ethereum Directly on PayPal\n\nThe PayPal platform introduced support for a few of the most popular cryptocurrencies in 2021, aiming to make crypto accessible to anyone with a PayPal account.\n\nHow to Buy Ethereum on PayPal Directly\n\n1. Create a free account\n\nClick the “Sign Up” button and choose “Personal Account”, if you don’t have a PayPal account already. Fill in your email address, name, and password, and click “Continue”. You will then need to complete your profile with your address, phone number, and date of birth, after which you can link a card and/or bank account to your PayPal account.\n\n2. Confirm your US taxpayer status\n\nYou will be asked to confirm whether or not you are a US citizen before you can purchase any crypto. You will then need to tick a box to confirm that you understand the risks of buying cryptocurrency.\n\n3. Verify your identity\n\nIf you attempt to buy crypto, you will be prompted to verify your identity first. After clicking the “Get Started” button, you will need to fill in a few personal details, and then select your ID type and submit an image of it.\n\n4. Buy Ethereum\n\nClick on Ethereum in the crypto section and tap the “Buy” button. After entering how much you want to buy, click “Next” and select your funding source. Review the transaction and fees, and then click “Agree and Buy”.\n\nWhy Use PayPal?\n\nPayPal provides a quick and easy way to purchase ETH and other popular cryptocurrencies, especially for those who are new to crypto and don’t yet have the skills to trade on a crypto exchange or broker.\n\nIt allows you to gain exposure to crypto without needing to risk a lot of capital, as the minimum purchase amount is just £1. There are also some educational resources on the platform if you want to expand your crypto knowledge.\n\nOnly Bitcoin, Ethereum, Litecoin, and Bitcoin Cash are available to buy directly on PayPal, so more experienced crypto users may be disappointed by the limited choice, as well as the lack of trading tools.\n\nPayPal charges a fee of at least 1.5% plus spread on ETH purchases and sales. When buying smaller amounts, however, the fee can be much higher. If you want to withdraw your crypto to a private wallet, you can do so if you pay a network fee.\n\nPros\n\nVery easy to use\n\nDon’t need an account with a crypto exchange/broker\n\nMinimum purchase of £1\n\nSome educational resources\n\nCons"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRhaWx5Zm9yZXguY29tL2ZvcmV4LXRlY2huaWNhbC1hbmFseXNpcy8yMDI0LzAxL2V0aGVyZXVtLWZvcmVjYXN0LTktamFudWFyeS0yMDI0LzIwNjE3ONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Forecast Today -09/01: Looks for Push (Chart) - DailyForex.com",
        "content": "Ethereum, after a brief dip in Monday's trading session, has shown signs of resurgence, breaking above the 20-day Exponential Moving Average.\n\nThe momentum suggests a potential target of around $2,400. This level has repeatedly resisted price advances and represents a significant point of interest.\n\nHowever, it's important to note that Bitcoin remains the primary driver in the cryptocurrency market.\n\nThe $2,400 level is expected to continue offering resistance. Should a breakthrough occur, the market might make a concerted effort to surpass the $2,500 level, which also holds considerable attention and resistance. Beyond that, the $2,750 level becomes the next potential target. Over the longer term, there is a possibility of ascending even further, with a measured move from the previous ascending triangle indicating a potential destination of $3,400 or potentially higher.\n\nConsolidation Phase\n\nIn the recent trading session, the market has been in a consolidation phase, accumulating momentum for an upward push. The $2,100 level is considered reliable support, complemented by the presence of the 50-day EMA in the same vicinity. These elements align to create a setup that suggests an impending upward move. Additionally, if there is an expectation of central banks adopting loose monetary policies, it could benefit Ethereum and the broader cryptocurrency market. Monitoring the 10-year yield is crucial in this context. A decline below the $2,000 level would necessitate a reassessment of the entire market. However, for now, the prevailing sentiment leans towards buying opportunities during dips.\n\nForex Brokers We Recommend in Your Region See full brokers list\n\nIn the end, Ethereum has displayed renewed strength, breaking above the 20-day EMA and potentially targeting the $2,400 level. Resistance is expected at this juncture, with subsequent targets at $2,500 and $2,750. A longer-term perspective suggests the possibility of reaching $3,400 or even higher. The market has been consolidating recently, with support at $2,100 and the 50-day EMA reinforcing this zone. The prospect of looser central bank policies could further boost Ethereum and the broader cryptocurrency market. Keeping an eye on the 10-year yield is essential. A drop below $2,000 would necessitate a reevaluation, but for now, buying the dips appears to be the prevailing strategy employed by most traders around the world. The market continues to see plenty of opportunities for people to take advantage of now.\n\nReady to trade ETH/USD? Here’s a list of some of the best crypto brokers to check out."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcmFsbHktaGlhdHVzLWV5ZXMtZnJlc2gtbGlxdWlkaXR5LXdpdGgtc3BvdC1idGMtZXRmLWFwcHJvYWNoaW5nL9IBcGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcmFsbHktaGlhdHVzLWV5ZXMtZnJlc2gtbGlxdWlkaXR5LXdpdGgtc3BvdC1idGMtZXRmLWFwcHJvYWNoaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Rally Hiatus Eyes Fresh Liquidity With Spot BTC ETF Approaching - CoinGape",
        "content": "As the window for spot Bitcoin ETF approval shrinks to 36 hours, market participants exhibit contrasting strategies. Bulls favor a breakout in Bitcoin and Ethereum price, while bears anticipate a correction triggered by the “sell-the-news” narrative, potentially preceding a longer-term upward trend.\n\nEthereum Price Trend Continuation Depends On Critical Support Levels\n\nAlthough buoyant, Ethereum price stalled close to the stubborn $2,400 resistance. The leading smart contracts token has since early December consolidated within a narrow range, with resistance cut out at $2,400 and support around $2,200.\n\nadvertisement\n\nIt is this consolidation that has led to ETH forming a bullish rectangle pattern which if validated may treat investors to a 10% move. Therefore, the next sessions could determine the next direction Ether takes.\n\nSimilarly, if the immediate support highlighted at $2,274 by the 20-day Exponential Moving Average (EMA) (in blue) remains intact, the least resistance would shift upwards, paving the way for Ethereum price to activate the rectangle breakout targeting highs at $2,600. It would be worth looking out for a daily candle close above this support line likely to reinforce the bulls’ presence in the market.\n\nRecommended for you: Crypto Price Prediction For January 9: HNT, BONK, TIA\n\nLong-term success in a news-sensitive market necessitates a measured approach. While experienced investors navigate this volatility with practiced caution, novice traders might find it particularly challenging.\n\nThe Moving Average Convergence Divergence (MACD) indicator, although donning a sell signal, has the potential to send a call to buy ETH in the near term.\n\nBefore entering new long orders, traders must make sure that the MACD line in blue is above the signal line in red and accompanied by an upward-slopping movement.\n\nPrudence remains paramount even amidst bullish murmurs. As Ethereum price continues to lack directional momentum, a breach below the 20-day EMA (purple) support would lend credence to the prevailing bearish sentiment. This, coupled with the potential market response to the approval of spot Bitcoin ETFs, could intensify downward pressure on Ethereum, potentially pushing it towards the $2,200 rectangle support level.\n\nCollecting liquidity from this support could mean that Ethereum price gains momentum to make another approach for a breakout to $2,600. However, if the support weakens amid increasing panic-selling pressure, ETH may be forced to retest $2,200 and perhaps brush the 200-day EMA (purple) support before the next significant trend reversal starts to build.\n\nThe token is also approaching the 2022 low on the ETH/BTC pair, which crypto analyst Michaël van de Poppe believes holds immense liquidity to support the next breakout above $3,000.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there. If an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nThe anticipation for the ETF would greatly impact the performance of Ethereum price. While a sell-the-news scenario is possible, investors cannot ignore the spike in capital flow likely to give cryptos like ETH and BTC momentum to hit higher highs.\n\nRelated Articles"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnN0YXRpc3RhLmNvbS9zdGF0aXN0aWNzLzEyNzI5MDMvY3J5cHRvY3VycmVuY3ktdHJhZGUtdm9sdW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Crypto trading volume per day 2020-2024 - Statista",
        "content": "Strategy and business building for the data-driven economy:\n\nThe best of the best: the portal for top lists & rankings:\n\nGet quick analyses with our professional research service\n\nDirectly accessible data for 170 industries from 150+ countries and over 1 Mio. facts.\n\nDetailed information for 39,000+ online stores and marketplaces\n\nBusiness information on 100m+ public and private companies\n\nInsights on consumer attitudes and behavior worldwide\n\nMarket forecast and expert KPIs for 1000+ markets in 190+ countries & territories\n\nAll key figures about countries and regions\n\nDetailed information about political and social topics\n\nConsumer and brand insights and preferences in various industries\n\nKey figures and rankings about companies and products\n\nIndustry and market insights and forecasts\n\nOverview and forecasts on trending topics\n\nNumber of apps available in leading app stores Q3 2022\n\nQuarterly smartphone market share worldwide by vendor 2009-2023\n\nFacebook: quarterly number of MAU (monthly active users) worldwide 2008-2023\n\nPlease create an employee account to be able to mark statistics as favorites. Then you can access your favorite statistics via the star in the header. Register now\n\nCurrently, you are using a shared account. To use individual functions (e.g., mark statistics as favourites, set statistic alerts) please log in with your personal account. If you are an admin, please authenticate by logging in again. Login\n\nTo download this statistic in XLS format you need a Statista Account\n\nTo download this statistic in PNG format you need a Statista Account\n\nTo download this statistic in PDF format you need a Statista Account\n\nTo download this statistic in PPT format you need a Statista Account\n\nAs a Premium user you get access to the detailed source references and background information about this statistic.\n\nAs a Premium user you get access to background information and details about the release of this statistic.\n\nAs soon as this statistic is updated, you will immediately be notified via e-mail.\n\n… to incorporate the statistic into your presentation at any time.\n\nYou need at least a Starter Account to use this feature.\n\nStatista Accounts: Access All Statistics. Starting from $2,148 USD / Year\n\nBasic Account Get to know the platform You only have access to basic statistics.\n\nThis statistic is not included in your account. Starter Account The ideal entry-level account for individual users Instant access to 1m statistics\n\nto 1m statistics Download in XLS, PDF & PNG format\n\nin XLS, PDF & PNG format Detailed references $199 USD $179 USD / Month * in the first 12 months Professional Account Full access Business Solutions including all features. * Prices do not include sales tax.\n\nStatista Accounts: Access All Statistics. Starting from $2,148 USD / Year Learn more about how Statista can support your business. Request webinar\n\nStatista. (January 9, 2024). Overall cryptocurrency 24 hour trade volume from July 1, 2020 to January 9, 2024 (in billion U.S. dollars) [Graph]. In Statista . Retrieved February 28, 2024, from https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/\n\nStatista. \"Overall cryptocurrency 24 hour trade volume from July 1, 2020 to January 9, 2024 (in billion U.S. dollars).\" Chart. January 9, 2024. Statista. Accessed February 28, 2024. https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/\n\nStatista. (2024). Overall cryptocurrency 24 hour trade volume from July 1, 2020 to January 9, 2024 (in billion U.S. dollars) . Statista . Statista Inc.. Accessed: February 28, 2024. https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/\n\nStatista. \"Overall Cryptocurrency 24 Hour Trade Volume from July 1, 2020 to January 9, 2024 (in Billion U.S. Dollars).\" Statista , Statista Inc., 9 Jan 2024, https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/\n\nStatista, Overall cryptocurrency 24 hour trade volume from July 1, 2020 to January 9, 2024 (in billion U.S. dollars) Statista, https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/ (last visited February 28, 2024)\n\nOverall cryptocurrency 24 hour trade volume from July 1, 2020 to January 9, 2024 (in billion U.S. dollars) [Graph], Statista, January 9, 2024. [Online]. Available: https://www.statista.com/statistics/1272903/cryptocurrency-trade-volume/"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMDkvYml0Y29pbi1hbmQtZXRoZXJldW0tbWFya2V0LWN5Y2xlcy1lY2hvLTIwMTgtMjAyMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Market Cycles Echos 2018-2022 - Crypto Times",
        "content": "According to Coinbase Research, Bitcoin and Ethereum are at present following a trend similar to that observed between 2018 and 202 Thus far this year. This suggests that the market may see additional growth.\n\nAnalysts cite metrics such as net unrealized profit/loss and supply in the candle of profits, suggesting so far that this market is not yet overheated like it did in 2023. This indicates possible further upwards moves.\n\nPrices could also be buoyed by the next Bitcoin halving, due in April 2024 when the block reward will shrink to half. Coinbase Research, however, remains careful to point out that the link between halvings and price rises is still not completely made.\n\nBitcoin price performance since cycle low/ Source: Coinbase Research\n\nThe upcoming Cancun upgrade for Ethereum, scheduled to enhance scalability and security features in its protocols could also result in an increased transaction volume leading potentially to an increased ETH price.\n\nOverall, Coinbase’s research indicates that the current crypto market cycle appears to be on track with this 2018-2022 cycle followed by potential upside before reaching its peak."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1oYWNrZXJzLWx1cmUtZXRoZXJldW0tc29sYW5hLXRyb24tY29tbXVuaXRpZXMtaW50by1haXJkcm9wLXNjYW0v0gFgaHR0cHM6Ly9jb2luZ2FwZS5jb20vY3J5cHRvLWhhY2tlcnMtbHVyZS1ldGhlcmV1bS1zb2xhbmEtdHJvbi1jb21tdW5pdGllcy1pbnRvLWFpcmRyb3Atc2NhbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Airdrop Scam: Crypto HackersTarget Ethereum, Solana & Tron Communities - CoinGape",
        "content": "Wallet drainers have now started targeting Ethereum (ETH), Solana (SOL), and Tron (TRX) communities to execute phishing scams. Earlier, they focused on conducting crypto scams via EVM chains. However, the trend has changed after they expanded their reach into well-established crypto groups.\n\nAlso Read: Crypto Scam: Trading Platform Coinspaid Might be the Latest Victim\n\nadvertisement\n\nOverview of Wallet Drainers’ Airdrop Scam\n\nAccording to a post by Scam Sniffer on X, phishing scams have been initiated by attracting crypto enthusiasts via fake airdrops. They have designed a webpage wherein one can claim Ethereum, Solana, and Tron airdrop rewards.\n\nThe scammers term the airdrop scam as an “exclusive opportunity” for the community. Moreover, they encourage people to connect their primary wallet to be able to access these airdrops. In addition, Scam Sniffer noted that these fraudsters can drain various types of crypto wallets via this webpage.\n\nThis update is an alarming one considering the popularity of Ethereum, the second-largest crypto, Solana, and Tron. It could instill crypto investors into believing such wallet drainers in anticipation of high-end crypto rewards. Thereby, millions and billions of digital asset investments could be wiped off owing to such wallet drainer scams.\n\nHowever, it is possible to identify such scams via a few checks. The snapshot shared by Scam Sniffer shows that the concerned airdrop scam webpage has grammatical errors, which could be a way to be safe from such fraudsters. But, they can upgrade their strategies from time to time.\n\nHence, it’s always better to check the source of such links. If a trusted entity isn’t posting such airdrop updates, then avoid such offerings completely. Moreover, it’s time to be even more cautious since hackers have been hacking reputed companies’ X (formerly Twitter) accounts to promote crypto scams.\n\nCertik and Mandiant Official X Accounts Get Hacked\n\nEarlier this month, Certik, a blockchain audit firm, witnessed its X account being hacked. Thereafter, malicious links were posted that promised people to return the digital assets they lost to various crypto scams. The dubious link was available on their website for quite sometime before the Certik team managed to regain access.\n\nThe X account of Mandiant, a cybersecurity company, was successfully reclaimed by its rightful owner on January 4, 2024, after falling victim to hacking. The incident unfolded over several hours on X, with users presenting evidence of the account takeover. The attackers, posing as the Phantom, a non-custodial crypto wallet, used the compromised Mandiant X account to promote a cryptocurrency scam.\n\nAlso Read: Just In: Founder of ACE Crypto Exchange Arrested for Fraud"
    }
]