[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDI0LzAxLzE3L21ldGFtYXNrcy1zZWNyZXQtaW50ZW50cy1wcm9qZWN0LWNvdWxkLXJhZGljYWxseS1jaGFuZ2UtaG93LXVzZXJzLWludGVyYWN0LXdpdGgtYmxvY2tjaGFpbnMv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMTcvbWV0YW1hc2tzLXNlY3JldC1pbnRlbnRzLXByb2plY3QtY291bGQtcmFkaWNhbGx5LWNoYW5nZS1ob3ctdXNlcnMtaW50ZXJhY3Qtd2l0aC1ibG9ja2NoYWlucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "MetaMask's Secret Project Could Shake Up How Ethereum Works - CoinDesk",
        "content": "\"We are currently focused on ensuring we have built the best system of its kind in terms of safety, features, performance, and control,\" he wrote. \"Once we are satisfied, everyone in the industry will have a chance to use it for themselves, and will be free to use it how they want.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvLm5ld3MvZGVuY3VuLXVwZ3JhZGUtZ29lcy1saXZlLW9uLWV0aGVyZXVtcy1nb2VybGktdGVzdG5ldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Dencun upgrade goes live on Ethereum's Goerli testnet - crypto.news",
        "content": "The long-awaited Dencun upgrade has finally arrived for the Goerli testnet, although low participation resulted in it failing to be finalized in the expected time.\n\nThe Dencun upgrade, which includes a major update known as “proto-danksharding” designed to help reduce layer-2 transaction fees, went live on Ethereum’s Goerli testnet on Jan. 17, according to Tim Beiko, community manager at Ethereum Foundation.\n\nBeiko acknowledged that the participation among validators for the upgrade was “not great,” but noted that a similar outcome “was expected.” It also appears the upgrade resulted in a “chain split” as not all validators synced with each other for the update.\n\nAnd it seems like we have a chain split! Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates! — timbeiko.eth ☀️ (@TimBeiko) January 17, 2024\n\nYou might also like: Ethereum’s Dencun upgrade: the next major step in scalability\n\nFollowing its deployment on Goerli, the next phase of the upgrade is scheduled to take place on Jan. 31 on the Sepolia testnet, with the Holesky testnet activating Dencun on Feb. 7. Once Dencun runs smoothly on all three testnets, the Ethereum Foundation plans to roll out the upgrade on the Ethereum mainnet by the end of Q1 2024.\n\nDencun marks the final upgrade for the Goerli testnet. Subsequently, both the client and Ethereum Foundation testing teams will discontinue support for the Goerli testnet after the completion of the Dencun upgrade.\n\nThe Dencun upgrade, known as EIP-4844, aims to increase blockchain space for data blobs and slash layer-2 rollup fees by activating proto-danksharding. This data storage expansion should scale Ethereum’s blockchain, enabling more transaction capacity without hiking gas fees.\n\nRead more: ETH developers voice concern over gas limit hike proposed by Vitalik Buterin\n\nFollow Us on Google News"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vZm91cndlZWttYmEuY29tL2V0aGVyZXVtLWJsb2NrY2hhaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Blockchain In A Nutshell - FourWeekMBA",
        "content": "Discover more from FourWeekMBA\n\nSubscribe now to keep reading and get access to the full archive.\n\nContinue reading"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1nb2VzLWxpdmUtdGVzdG5ldC1hZnRlci00LWhvdXItZGVsYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun upgrade goes live on testnet after 4-hour delay - Cointelegraph",
        "content": "The newest upgrade to the Ethereum network, codenamed “Cancun-Deneb” or “Dencun,” has gone live on the Goerli testnet for the first time, according to a Jan. 17 social media post from Ethereum developer Parithosh Jayanthi.\n\nAccording to Jayanthi, a bug delayed the network’s launch for approximately four hours. But once this problem was fixed through a patch, the network came back up.\n\nThe goerli fork finalized! :Dhttps://t.co/LIa3d4Ml5H\n\n\n\nAfter the fix was patched in, the validators came back online and the chain started finalizing again. The MEV circuitbreaker automatically disables and mev-blocks have started flowing through as well.\n\n\n\nYay client diversity! https://t.co/cLz3ZRxnXq — parithosh | (@parithosh_j) January 17, 2024\n\nOnce implemented on the mainnet, the Dencun upgrade will significantly lower the cost of transactions on Ethereum layer 2s such as Optimism, Base, Polygon zkEVM and others, developers have claimed. It will also limit self-destruct operations and allow for new bridge and staking pool features.\n\nThe fork was implemented at approximately 6 am UTC, according to Ethereum developer Tim Beiko. About 20 minutes after this post, Beiko announced that the network had undergone a “chain split” due to a lack of finalization. Terence.eth later revealed that the Prysm implementation of Ethereum contained a bug causing it to fail to sync with the other nodes. Once the bug was discovered and patched, the network began running smoothly again, according to Jayanthi.\n\nJayanthi claimed that the quickly implemented solution was a testament to the power of the team’s debugging systems. “I do want to mention that we went from fork -> issue -> triage -> fix -> finality in under 4h,” Jayanthi stated. “The debugging apparatus has gotten great!”\n\nAccording to Dencun’s testing schedule, its next big moment will be Jan. 30, when it is slated to be implemented on the Sepolia testnet. Holesky testnet will follow on Feb. 7. The team has not yet announced a date for the upgrade to be implemented on the mainnet."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ncmluZHMtaGlnaGVyLTI2MjAv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWdyaW5kcy1oaWdoZXItMjYyMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Grinds Higher, Is This The Start Bulls Were Waiting For? - NewsBTC",
        "content": "Ethereum price is attempting a fresh increase above the $2,550 level. ETH could continue to move up unless there is a drop below the $2,525 support.\n\nEthereum is attempting a fresh increase above the $2,520 level.\n\nThe price is trading above $2,520 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move up if it clears the $2,600 and $2,620 resistance levels.\n\nEthereum Price Holds Support\n\nEthereum price remained well-supported above the $2,450 level. ETH outperformed Bitcoin and started a fresh increase above the $2,500 resistance zone.\n\nThere was a move above the $2,550 resistance and the 100-hourly Simple Moving Average. The price even broke the $2,600 level before the bears appeared. A high is formed near $2,614 and the price is now correcting gains. There was a minor move below the 23.6% Fib retracement level of the upward move from the $2,471 swing low to the $2,614 high.\n\nEthereum is still trading above $2,520 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD. It is close to the 50% Fib retracement level of the upward move from the $2,471 swing low to the $2,614 high.\n\nOn the upside, the price is facing resistance near the $2,600 level. The next major resistance is now near $2,620. A clear move above the $2,620 level might start a decent increase. In the stated case, the price could rise toward the $2,665 level.\n\nSource: ETHUSD on TradingView.com\n\nThe main breakout zone is now forming near the $2,710 zone. A close above the $2,710 resistance could start another major increase. The next key resistance is near $2,780. Any more gains might send the price toward the $2,880 zone.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $2,620 resistance, it could start another decline. Initial support on the downside is near the $2,550 level and the trend line.\n\nThe next key support could be the $2,500 zone. A downside break below the $2,500 support might send the price further lower. In the stated case, Ether could test the $2,450 support. Any more losses might send the price toward the $2,350 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,540\n\nMajor Resistance Level – $2,620\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLWV0aC1wcmljZS1pcy1zdHJlbmd0aGVuaW5nLWFnYWluc3QtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "3 reasons why Ethereum (ETH) price is strengthening against Bitcoin - Cointelegraph",
        "content": "Ether (ETH) price is holding on to the $2,500 handle even as data shows futures liquidations rising.\n\nETH/USD daily chart. Source: TradingView\n\nAccording to data from monitoring resource Coinglass, Jan. 16 saw $15.03 million of ETH shorts liquidated against $5.3 million long liquidations.\n\nThis coincided with the ETH/USD pair rising to highs of $2,614, breaking through the resistance at $2,500.\n\nETH liquidations chart. Source: Coinglass\n\nFurther data from on-chain analytics firm Glassnode captured the dominance of short versus long liquidations on Jan. 16.\n\nEther futures long liquidations dominance chart. Source: Glassnode\n\nA report by 10xResearch reveals Ether’s increasing share of open interest since the start of the year.\n\nAccording to the report:\n\n“Open interest share in perp futures has remained flat for BTC (41.6% on Jan 1. Vs. 41.1% now), while ETH’s share of open interest has increased from 21.8% to 26.5%.”\n\nInvestors expect ETH/BTC appreciation to continue\n\n10xResearch also highlighted that the Bitcoin (BTC) dominance indicator dropping below 50% for a fourth day. This is often seen as a sign that altcoins can sustainably perform better than Bitcoin.\n\nAccording to the chart below, ETH’s dominance has climbed to a three-month high above 18%.\n\nBitcoin vs. Ethereum dominance. Source: 10xResearch\n\nData from on-chain data provider Santiment shows Ethereum’s price dominance surging against Bitcoin, marking a +22.4% increase in the past week.\n\nThis period also saw the creation of roughly 89,400 new Ethereum addresses per day, further underscoring the platform’s growing traction. Notably, a staggering 96,300 wallets were created on Jan. 16 alone.\n\nexchanges is getting close to reaching its #AllTimeLow (since the opening week of trading) of 8.05%. Movement to self custody & staking implies less risk of an impending selloff, as opposed to a more concerning rising supply on exchanges.\n\n\n\nLink to chart: https://t.co/NQf3x6BGKt — Santiment (@santimentfeed) January 16, 2024\n\nThe data also shows ETH’s supply on exchanges nearing its all-time low of 8.05%.\n\nThis signals movement toward self-custody and staking, implying a reduced risk of an imminent sell-off, presenting a more favorable scenario compared to concerns arising from a rising supply on exchanges.\n\nThese on-chain metrics shed light on Ether’s current market strength and its potential to outperform Bitcoin in the short term.\n\nRelated: Vitalik Buterin says L2s using Celestia are validiums, not genuine rollups\n\nEthereum Dencun upgrade deploys proto-danksharding on Goerli\n\nThe newest upgrade to the Ethereum network, codenamed “Cancun-Deneb” or “Dencun,” has gone live on the Goerli testnet, according to a Jan. 17 social media post from Ethereum developer Parithosh Jayanthi.\n\nThe goerli fork finalized! :Dhttps://t.co/LIa3d4Ml5H\n\n\n\nAfter the fix was patched in, the validators came back online and the chain started finalizing again. The MEV circuitbreaker automatically disables and mev-blocks have started flowing through as well.\n\n\n\nYay client diversity! https://t.co/cLz3ZRxnXq — parithosh | (@parithosh_j) January 17, 2024\n\nAt the heart of the Dencun deployment on the Goerli testnet is the implementation of EIP-4844, which is expected to significantly lower the cost of transactions on Ethereum layer 2s such as Optimism, Base, Polygon zkEVM and others. It will also limit self-destruct operations and allow for new bridge and staking pool features.\n\nAccording to Ethereum’s 2024 roadmap, the next big moment in Dencun’s testing schedule will be Jan. 30, when it is slated to be implemented on the Sepolia testnet.\n\nThe Holesky testnet will follow on Feb. 7. The team has not yet announced a date for implementing the upgrade on the mainnet.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTcvYml0Y29pbi1hbmQtZXRoZXJldW0tdG8tbGVhZC1hbHRjb2lucy1oaWdoZXItaW4tMjAyNC_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE3L2JpdGNvaW4tYW5kLWV0aGVyZXVtLXRvLWxlYWQtYWx0Y29pbnMtaGlnaGVyLWluLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum to Lead Altcoins Higher in 2024 - CoinDesk",
        "content": "Here's the catch: this flood of cash is gonna flow mainly into Bitcoin and Ethereum. Sorry, altcoins, you might have to wait your turn for the time being. But, the rise of Bitcoin and Ether should trickle down into other digital assets, as crypto native investors take profits on the majors and allocate capital into smaller tokens. This will put crypto native players in the driver-seat of bitcoin dominance (see chart below), as they will be the investors capable of playing in the basis and spreads between the majors and altcoins."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcHJlZGljdGlvbnMtZXRoLXByaWNlLWV0aGVyZXVtL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcHJlZGljdGlvbnMtZXRoLXByaWNlLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Here Are The Most Bullish Predictions For ETH Price As Ethereum Dominance Rises Against Bitcoin - NewsBTC",
        "content": "The sentiments around Ethereum look to be very bullish at the moment as the second-largest crypto token by market cap has seen its dominance surge against Bitcoin. Ethereum’s rise against the flagship crypto token is also significant, as crypto analyst Jaydee recently suggested that it could usher in the altcoin season.\n\nBullish Predictions For Ethereum’s Price\n\nCrypto analyst Ali Martinez recently highlighted the fact that Ethereum broke out from an ascending triangle on the weekly chart. According to him, the crypto token has its eyes on the $3,400 price level despite the short-term volatility. Backing Ali’s analysis, crypto analyst Mayne shared their belief that $3,400 remains a viable target for ETH’s price.\n\nInterestingly, Mayne hinted that “ETH betas” could run alongside ETH when this significant price surge begins to happen. These ETH betas include tokens like the native tokens of Ethereum’s layer-2 networks Optimism and Arbitrum.\n\nCrypto analyst Ash Crypto also offered a bullish prediction for ETH’s price while commenting on the state of the market. He remarked that money was currently flowing from Bitcoin to Ethereum and that it shouldn’t be long before the latter trades above $3,200.\n\nETH trading above the $3,000 price level looks to be the consensus going by these predictions. The CEO and founder of MN Trading, Michaël van de Poppe, had before now suggested that ETH was also going to rise above $3,000 on its way to $3,500. Then, Poppe boldly claimed that this price prediction would materialize in the first quarter of 2024.\n\nMeanwhile, crypto analyst ColdBloodedShill stated in a recent X post that ETH is likely planning for higher prices as long as it remains above $2,400. The $2,400 price range looks to be an important support level as ETH looks to break out. Crypto analyst Bluntz Capital also highlighted that price range ($2,495 specifically) as he noted that there will be an eventual breakout as long as ETH holds above that level.\n\nETH bulls struggle at $2,500 | Source: ETHUSD on Tradingview.com\n\nConviction On Ethereum Getting Stronger\n\nMarket intelligence platform Santiment recently revealed that the number of new ETH addresses is on the rise as Ethereum continues to outperform Bitcoin. 89.4 thousand addresses are said to have been created daily during this stretch. This represents a significant increase from late last year, when 70.4 addresses were created daily in early November.\n\nSantiment also added that ETH’s supply on exchanges had reduced drastically to 8.10%, almost getting close to its all-time low (since the opening week of trading) of 8.05%. Such a development usually suggests that ETH holders are looking to hold for the long term as they move their holdings to self-custody.\n\nFeatured image from TechRadar, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1nb2VzLWxpdmUtMDc0MzUyMzAyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade Goes Live, But Fails to Finalize on Testnet - Yahoo Finance",
        "content": "Ethereum’s much-awaited Dencun upgrade went live on the Goerli testnet earlier Wednesday but failed to finalize in the expected time.\n\nThe upgrade was pushed at 6:32 UTC, blockchain data shows, but did not initially finalize on the testnet.\n\nA few hours later, Ethereum core developer Parithosh Jayanthi confirmed that the chain was finalizing again, and told CoinDesk over Telegram that the issue was due to a bug, now patched, in Prysm nodes.\n\nAnd it seems like we have a chain split! Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates! — timbeiko.eth ☀️ (@TimBeiko) January 17, 2024\n\nFinality refers to irreversibility once a transaction has been confirmed and added to a block in a blockchain network. A testnet is a network that mimics real-world blockchains and is used to test applications and important upgrades before they can be pushed live on a mainnet.\n\nDencun’s implementation of Goerli is part of a three-phased approach to eventually enacting a new, less costly method of storing data on the main Ethereum blockchain.\n\nThat method, “proto-danksharding,” is a mechanism that will add capacity for data availability as well as help reduce the cost of transactions for layer-2 blockchains. These auxiliary networks have proliferated in the past year as an alternative to processing transactions on the main Ethereum blockchain, but analysts say their growth is hampered by the steep data costs under the current setup.\n\nThe next phase will happen sometime in the next few weeks, with an upgrade to the Sepolia testnet, followed by the Holesky testnet.\n\nDencun will be the biggest upgrade – technically a “hard fork” in blockchain terminology – for Ethereum since the Shapella upgrade last March, which enabled the withdrawals of staked ether [stETH]. That milestone marked the second step for Ethereum’s transition to a proof-of-stake blockchain, away from the more energy intensive proof-of-work chain that it was before the Merge.\n\nUPDATE (Jan. 17, 08:15 UTC): Adds additional details.\n\nUPDATE (Jan. 17, 14:49 UTC): Updates that the blockchain is finalizing again."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vbWlsa3JvYWQuY29tL25ld3MvZXRoZXJldW0tZGVuY3VuLXRlc3RuZXQtdXBncmFkZS1mYWlscy10by1maW5hbGl6ZS1hcy1leHBlY3RlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Testnet Upgrade Fails to Finalize As Expected - Milk Road",
        "content": "A highly anticipated trial run of the Ethereum Dencun upgrade deployed successfully on the Goerli test network on Wednesday but then failed to reach finalization as intended. The setback points to potential validation and software shortcomings ahead of deploying major network changes.\n\nBlockchain data shows the testnet upgrade was initiated around 6:32 UTC but did not finalize transactions as projected. Sources told The Block that a lack of nodes upgrading the requisite components to facilitate consensus likely obstructed the completion of the normally irreversible finalization process.\n\nAnd it seems like we have a chain split! Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates! — timbeiko.eth ☀️ (@TimBeiko) January 17, 2024\n\nDencun on Goerli marks the first phase of testing planned network shifts, enabling expanded data availability.\n\nFailure to finalize transactions suggests issues with validator participation and software preparation.\n\nFurther upgrades are slated for the Sepolia and Kintsugi testnets before any mainnet activation.\n\nRead more: Sam Bankman Fried’s Parents Seek FTX Lawsuit Dismissal\n\nGoerli acts as a testing ground for functionality and security before pushing Ethereum improvements to the live main network. The Dencun dry run specifically involves a data storage technique called “proto-danksharding” to boost network capacity.\n\nEthereum developers aim to diagnose and resolve the issue\n\nActivating the technology requires high node turnout and upgrading consensus mechanisms to guarantee transaction finality. Sources said an apparent shortfall on both fronts disrupted the expected confirmation of Dencun test transactions.\n\nDevelopers now aim to diagnose and resolve the problems in the coming days before initiating further trials. The next Dencun test phases involve the Sepolia and Kintsugi testnets in sequence as deployment moves closer to reality.\n\nRead more: Grayscale Transfers 9,000 BTC To Coinbase Prime As Bitcoin Hits $43,000\n\nAs Ethereum’s most significant change since last year’s Merge, rigorous testing minimizes mainnet disruptions from Dencun’s novel data architecture. Successfully processing transactions via shard chains remains essential to Ethereum’s vision for scalability and reduced gas costs.\n\nHowever, the Goerli hiccup demonstrates challenges still confronting Ethereum’s complex roadmap for future upgrades, like sharding."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi1iYWNrcy1kb3duLWV0aGVyZXVtLXN0ZWFscy10aGUtc3BvdGxpZ2h0LXdpdGgtc3VyZ2UtaW4tbWFya2V0LWRvbWluYW5jZS_SAXFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4tYmFja3MtZG93bi1ldGhlcmV1bS1zdGVhbHMtdGhlLXNwb3RsaWdodC13aXRoLXN1cmdlLWluLW1hcmtldC1kb21pbmFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Backs Down: Ethereum Steals The Spotlight With Surge In Market Dominance - NewsBTC",
        "content": "Amidst the lull in the realm of Bitcoin, Ethereum emerges as a trailblazer, confidently charting its course. While the crypto king takes a breather following its ETF approval, Ethereum, undeterred, is experiencing a surge in both price and dominance, propelled by an influx of new users and the prevailing trend of self-custody.\n\nRecent data from Santiment vividly illustrates Ethereum’s ascendancy. The platform’s price dominance, reflecting its market share in comparison to all other cryptocurrencies, has witnessed a remarkable surge of 22.4% within a mere week.\n\nEthereum’s Remarkable Surge: Growing Community, Strong On-Chain\n\nThis surge is not merely a passive spectacle; Ethereum is actively attracting an astonishing 89,400 new addresses on a daily basis, with an unprecedented 96,300 joining the Ethereum community in a single day.\n\nSource: Santiment\n\nThis momentum is not solely about acquiring new participants; it’s about retention. Ethereum’s exchange supply, representing the quantity readily available for sale, is approaching its historical low of 8.05%. This shift signals a notable move towards self-custody and staking, mitigating the immediate risk of a substantial selloff and fortifying Ethereum’s price floor.\n\nThe on-chain strength witnessed translates into tangible market action. Following a brief dip that tested the $2,500 support, Ethereum not only stabilized but turned this once-resilient level into a launchpad.\n\nEthereum currently trading at $2,556 on the daily chart: TradingView.com\n\nAnalysts are now setting their sights on the $2,700 barrier as the gateway to unlocking a potential price surge, with FOMO (fear of missing out) traders anticipated to join the rally. Beyond this juncture, the horizon appears boundless, with $3,400 emerging as an enticing target.\n\nCaution Amid Excitement: Ethereum’s Unpredictable Trajectory\n\nYet, amid the excitement, an air of caution permeates the volatile crypto landscape. A breach below the “hammer” formation that materialized on Monday holds the potential to send Ethereum plummeting towards the 20-Day EMA (exponential moving average) at approximately $2,300.\n\nTraders are poised on tenterhooks, meticulously monitoring these crucial levels to decipher the forthcoming trajectory of Ethereum’s journey.\n\nOne undeniable truth emerges: Ethereum is casting off the shadow of Bitcoin and carving out its unique path. With an increasing dominance, a fervent user base, and a focus on self-custody, Ethereum is laying the groundwork for future expansion.\n\nWhether it attains the envisioned $3,400 pinnacle or steers towards an alternate destiny, one certainty prevails—Ethereum is an influential force, and its narrative is only in its nascent stages.\n\nHistory repeating itself.#Bitcoin dominance peaking before the halving and potentially marking a cycle top. Altcoins are likely to outperform coming period. pic.twitter.com/ox36x2M5NG — Michaël van de Poppe (@CryptoMichNL) January 15, 2024\n\nMeanwhile, in order to bolster Ethereum’s increasing dominance over Bitcoin, Michaël van de Poppe, the founder and CEO of trading company MNTrading, observed that Bitcoin was falling behind Ethereum in terms of the total market capitalization of cryptocurrencies.\n\nIn a post on X dated January 12, he included the following graphic with the caption, “#Bitcoin dominance peaking before the halving and maybe signifying a cycle top.” It’s conceivable that altcoins will perform better in the near future.\n\nFeatured image from Shutterstock\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1pbW11dGFibGUtZXRoZXJldW0tbmV0d29yay1jcnlwdG8tbmZ0LWdhbWVz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvL3Jlc291cmNlcy93aGF0LWlzLWltbXV0YWJsZS1ldGhlcmV1bS1uZXR3b3JrLWNyeXB0by1uZnQtZ2FtZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "What Is Immutable? The Ethereum Network for Crypto and NFT Games - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nImmutable X is a layer-2 scaling network built on top of Ethereum, the leading blockchain for decentralized applications. Developed by the Web3 firm Immutable via tech created by StarkWare, Immutable X uses the native ERC-20 token IMX and hosts a number of different blockchain games on its network like Gods Unchained, Guild of Guardians, Illuvium, and Ember Sword, to name a few.\n\nWhile Ethereum proponents argue that its mainnet is among the most decentralized and secure of all cryptocurrencies, it’s also historically suffered from high gas fees and long waits to make transactions. This has long caused friction with NFT creators like those behind the CryptoKitties, who once clogged the mainnet with their digital cats and made it virtually unusable.\n\nBecause NFTs—unique blockchain tokens that signify ownership—are currently so essential to blockchain games, it’s unfeasible for most game developers to build on the Ethereum mainnet. That’s where layer-2 solutions like Immutable X come in, plus Immutable is expanding with another new zkEVM scaling network ahead. Here’s what you need to know about the Immutable platform.\n\nAD\n\nAD\n\nWhat is Immutable X?\n\nImmutable X is a gaming-focused protocol that’s built atop the Ethereum mainnet’s security, but with the speed and lower transaction costs of a layer-2 scaling network. In other words, it provides additional benefits on top of the Ethereum mainnet.\n\nAccording to Immutable X’s whitepaper, the network allows users to make transactions with zero gas fees. This is partly possible due to Immutable X’s use of StarkWare’s ZK rollup technology which bundles transactions and can enable over 9,000 NFT transactions per second.\n\nWho created Immutable X?\n\nImmutable is the main Web3 firm behind the Immutable X protocol. The company is part blockchain developer and part game publisher, as Immutable developed the NFT card-battling game Gods Unchained and is publishing the action role-playing game Guild of Guardians.\n\nPer Crunchbase data, Immutable has raised nearly $280 million in funding from 32 investors as of January 2024, with firms like Tencent, GameStop Digital Ventures, King River Capital, and the now-defunct Alameda Research investing.\n\nHow does Immutable X work?\n\nImmutable X supports all Ethereum wallets, such as MetaMask and Coinbase Wallet. Users can also create an Immutable Passport to transact on the network. Immutable Passport is designed to be a streamlined and more approachable crypto wallet for gamers, plus it provides a unified identity across games.\n\nAD\n\nAD\n\nThe protocol itself sits on top of the Ethereum mainnet, allowing for Immutable X to leverage the mainnet’s decentralization and security for finalizing transactions. But because Immutable X uses ZK rollups, its transactions on its layer-2 network are still able to be fast and cost-effective.\n\nImmutable has built multiple REST application programming interfaces (APIs), meaning they are APIs that adhere to a specific set of architectural standards. Immutable’s REST APIs mean that transactions can consist of an API call, which takes less time than engaging with a protocol directly via a smart contract.\n\nWho's using Immutable X?\n\nA number of different NFT marketplaces and game developers have chosen to offer their products and services on ImmutableX. In June 2022, Immutable Ventures established a massive $500 million fund to invest in Web3 gaming projects being built on Immutable X and to also provide various developers with grant-based funding.\n\nRarible, Mintable, NFTrade, TokenTrove, OKX, and Kinguin are NFT marketplaces that use Immutable X. Brick-and-mortar video game retailer GameStop also launched its NFT marketplace on Immutable X in 2022, but has since discontinued its own crypto wallet and has said that it will shut down its marketplace in February 2024.\n\nGames like IMVU, Guild of Guardians, Habbo, Cross the Ages, Undead Blocks, Ember Sword, Planet Quest, Gods Unchained, WAGMI Defense, and Tiny Colony are building their Web3 elements on Immutable X.\n\nAs the world of Web3 gaming heats up, Immutable X faces competition with other blockchains like Polygon, Avalanche, Arbitrum Nova, Sui, and Solana to offer a fast and seamless gaming experience.\n\nWhat is Immutable zkEVM?\n\nImmutable is developing more than just Immutable X as its Ethereum gaming platform expands. In March 2023, the firm announced that it is working with competitor Polygon to develop a new Immutable zkEVM scaling network that combines Polygon zkEVM technology with Immutable’s gaming platform.\n\nA number of games have already announced that they’ll be using the Immutable zkEVM, from MetalCore to Shardbound and Elemental Knights. According to an Immutable blog post, the zkEVM network provides native compatibility with Ethereum Virtual Machine smart contracts, potentially making it easier for developers to port over from EVM chains and utilize an array of third-party tools.\n\nAD\n\nAD\n\nAs the Immutable platform grows, the IMX token has become the most valuable gaming token as of this writing, with a market cap of nearly $2.7 billion. That makes it the 37th largest overall cryptocurrency by market cap according to data from CoinGecko, as of January 17, 2024.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wcm90b2NvbC1tZXRhbWFza3Mtc2VjcmV0LXdlYXBvbi1ldGhlcmV1bXMtMjIyMDM0NDk4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: MetaMask's Secret Weapon and Ethereum's Dencun Debacle - Yahoo Finance",
        "content": "Last month, our feature in The Protocol highlighted how the blockchain design principle of \" intents \" was gaining ascendancy among developers on the industry's cutting edge. This week our Sam Kessler is back with a scoop on how the popular crypto wallet MetaMask, from the Ethereum developer Consensys, has quietly deployed a version of an intents-based routing mechanism that could revolutionize how users interact with blockchains.\n\nWe've also got:\n\nA post-mortem on Ethereum's unexpectedly ugly Dencun upgrade on the Goerli test network.\n\nReactions to Vitalik Buterin's proposed \"gas limit\" increase.\n\nJob cuts at NEAR Foundation as new CEO Illia \"Black Dragon\" Polosukhin goes to work.\n\nHighlights from this week's Protocol Village column on blockchain project updates, featuring Taiko, Chainlink, Hedera, Lagrange and Hacken.\n\nNetwork news\n\nEthereum co-founder Vitalik Buterin. (CoinDesk)\n\nMOORE IS MORE. Ethereum co-founder Vitalik Buterin , the de facto high priest of the world's largest smart-contracts blockchain, tossed out last week on a Reddit \"Ask Me Anything\" that it would be \"reasonable\" to raise the network's \"gas limit\" – a very technical way of referring to the amount of transactions that can get jammed into each new block . He suggested an increase to \"40M or so,\" implying a 33% increase over the current limit of 30 million gas. (Yes, for the underinitiated, a unit of gas, in this context, is just… a gas .) The main reason this is now possible, according to Buterin, is Moore's law – the observation that computing power seems to double every year . That's relevant because of the amount of data that it takes to store Ethereum's \"state\" – the complete record of the blockchain's history; as computers become more powerful, they should theoretically be able to handle the higher transaction capacity – potentially helping to reduce fees for end-users. \"There appears to be a constructive willingness to explore this topic further,\" analysts at Coinbase Institutional wrote. But some members of the Ethereum community have raised yellow flags. Péter Szilágyi, an Ethereum developer, tweeted that such an increase could slow the network's \"sync time.\" Galaxy Research's Christine Kim wrote in a weekly newsletter that \"larger blocks would certainly increase block propagation latency and potentially result in a higher number of missed blocks. \" Marius van der Wijden, an Ethereum software developer, estimated that the network's state is currently around 87 gigabytes (GB), and growing at 2 GB per month. That would put it at 111 GB in a year and 207 GB in five years. In an era where a 1 terabyte thumb drive can be bought on Amazon.com for $19.99 , it doesn't sound too terribly daunting. \"The problem here is not the size itself,\" van der Wijden wrote. \"Everyone will be able to store that amount of data. However, accessing and modifying it will become slower and slower.\" One thing there seems to be some agreement on: It's worth waiting a bit to observe the impact of the upcoming \" Dencun \" upgrade on the network, which will introduce a new way of storing data as \"blobs,\" effectively providing a capacity increase .\n\nStory continues\n\nBLACK DRAGON BREATHES FIRE: Just two months after NEAR Protocol co-founder Illia Polosukhin took over as CEO of the supporting NEAR Foundation, he announced drastic cuts last week in the organization's workforce – impacting 35 colleagues, or a 40% reduction. According to Polosukhin, the decision came after a \"thorough review of the foundation's activities,\" resulting in feedback that \"the foundation has not always been as effective as it could be.\" Polosukhin noted that the financial picture remains sound, with over $285 million in \"fiat\" or government-issued currencies and 305 million NEAR tokens \"worth over $1B,\" along with $70 million of investments and loans. Referred to in the foundation's communications as the \" Black Dragon ,\" Polosukhin may be under pressure to breathe new life into the alternative layer-1 blockchain, which ranks 32nd among networks based on the much-watched metric of total value locked, or TVL, according to DeFi Llama . Notably NEAR is trying some fresh strategies, pivoting last year to serve as a \" data availability \" network and cutting a deal with restaking pioneer EigenLabs to create a \" fast finality layer \" for Ethereum layer-2 networks.\n\nONE BETTER THAN TWO: The Binance-incubated BNB Chain ecosystem has announced a plan called \" Fusion \" that will see the original BNB Beacon Chain decommissioned while reinforcing the primacy of the sister BNB Smart Chain. According to a statement on the open-source software platform GitHub, the proposal will help to \"overcome legacy services and technical debt, enabling faster iteration and development.\" According to the newsletter Wu Blockchain , \"BNB Beacon Chain is set to exit the stage within the next six months.\"\n\nALSO:\n\nImage tweeted early Wednesday by Ethereum's Tim Beiko with the comment,\n\nEthereum’s Dencun upgrade went live on the Goerli test network early Wednesday but failed to finalize in the expected time. Developers expect the apparent issues to be fixed in the coming days. These likely occurred due to low participation and validators not upgrading parts of their software that would have helped with finalization. ( Link ) Interoperability service Socket and its bridging platform, Bungee, restarted operations after an apparent $3.3M exploit led to a temporary pause in trading activity. A wallet connected to the exploit believed to be the attackers' holds nearly $3 million in ether (ETH) and $300,000 worth of other tokens. ( Link ) Vivek Ramaswamy, crypto-friendly U.S. presidential candidate, suspended his campaign. ( Link ) The U.S. Securities and Exchange Commission issued a statement on the hack of its X account and the resulting fake Bitcoin ETF approval announcement. ( Link ) Venezuela has reportedly ended its controversial Petro cryptocurrency. ( Link ) Moody's, the bond-rating service, said tokenized fund adoption is growing but brings the risk of \"technological failure.\" ( Link ) Solana Mobile plans to launch a second smartphone, after its predecessor, Saga, sold out quickly once opportunistic crypto traders realized it came with an allocation of BONK tokens that more than covered the price of the device. ( Link ) Uri Kolodny, CEO of StarkWare, the developer behind the Ethereum layer-2 network Starknet, announced he is stepping down due to a family health issue. ( Link ) Taproot Wizards, the Bitcoin Ordinals project led by influencers Udi Wertheimer and Eric Wall that raised an astonishing $7.5M last year, is now moving forward with its first sale of a collection , Quantum Cats.\n\nProtocol Village\n\nHighlighting blockchain tech upgrades and developments.\n\n1. Taiko , developing a so-called type-1 zkEVM to help scale the Ethereum blockchain, announced the launch of \"Katla,\" its alpha-6 testnet, according to a message from the team: \"Katla is laying the foundation for Taiko's mainnet launch in 2024.\"2. Parallel Network has officially launched on mainnet and is open to developers, according to the team , claiming to be the first layer-2 network on Arbitrum Orbit to go live. \"It is also the first non-custodial omni-chain margin protocol, which allows liquidity to be pooled across multiple chains and makes it immediately available on the Parallel Network.\"\n\n3. Chainlink’s Cross-Chain Interoperability Protocol (CCIP) has integrated Circle’s Cross-Chain Transfer Protocol (CCTP) to make it easy for users to transfer USDC across chains, according to a press release. Developers can now build cross-chain use cases via CCIP that involve cross-chain transfers of USDC, including payments and other DeFi interactions, the statement said.\n\n4. The Hedera Council announced its newest member, the electronics maker Hitachi America, Ltd. (Hitachi). According to the team: \"Hitachi aims to begin creating proof-of-concepts for end-to-end supply chain and sustainability solutions on Hedera in the next year.\"\n\n5. Lagrange Labs, developer of a blockchain proving system based on zero-knowledge cryptography, has integrated its light client protocol, Lagrange State Committees (LSC), for the Ethereum layer-2 network Mantle, according to the team . LSCs \"are a ZK light client protocol for optimistic rollups (ORUs), designed through combining Lagrange’s ZK MapReduce Coprocessor and EigenLayer restaking. Each state committee borrows security from Ethereum by dual staking, both through EigenLayer restaking and with the rollup’s native token.\"\n\n6. Hacken, a blockchain security auditor, has introduced an open-source Rust library for code coverage generation for WASM-based protocols, according to the team: \"Code Coverage utilities are crucial for automation testing to ascertain the thoroughness of code examination. Without it, some critical components can remain untested. While it is available for Ethereum-based projects, WASM-based protocols don't have it. Wasmcov by Hacken is already integrated into the Radix ecosystem, which enables all Radix-built projects to utilize code coverage measurement. The next protocol to get it will be NEAR. The rest can set it up manually.\"\n\nSee the entire Protocol Village list from this past week here.\n\nMetaMask’s Secret ‘Intents’ Project Could Radically Change How Users Interact With Blockchains\n\nMetaMask has quietly rolled out a limited version of its new routing tech into the new Smart Swaps feature. (MetaMask, modified by CoinDesk)\n\nMetaMask, the most popular crypto wallet on Ethereum, is testing a new \"transaction routing\" technology that's likely to have major ramifications for how value flows through the second-biggest blockchain network.\n\nCoinDesk learned of the new technology from developers briefed on the plan, and key details were subsequently confirmed by officials with MetaMask's parent company, Consensys.\n\nThe effort capitalizes on a concept known in blockchain circles as \" intents \" that is rapidly gaining momentum, potentially leading to a radical shift in how people interact with blockchains: Rather than specifying how they want to get something done (e.g. \"sell X tokens on Y exchange for Z price\"), blockchain users may only need to specify what they want the outcome to be (e.g. \"I want the best price for my tokens\").\n\nThe \"what\" versus \"how\" distinction might seem subtle, but it's a big departure from how MetaMask and other crypto wallets worked originally – as neutral, relatively simple pieces of software for connecting users to blockchains. The goal with the new tech is for users to get better execution on their transactions and improved ease of use, but intent-based programs ultimately represent a big shift to where – and to whom – value flows on blockchains.\n\nThe new technology is being built by Special Mechanisms Group (SMG), a blockchain infrastructure firm that MetaMask owner Consensys purchased last year.\n\nRead the full story by Sam Kessler here\n\nMoney Center\n\nFundraisings\n\nRenzo , an interface for the liquid restaking protocol EigenLayer , has raised $3.2M, according to the team: \"Maven11 led the Renzo seed round which also saw follow-on investments from Figment Capital, SevenX, IOSG and Paper Ventures.\"\n\nHashKey Group , which operates the Hong Kong-based crypto exchange, has “nearly” met its $100 million fundraising target, the firm said Tuesday. HashKey announced the fundraising round in August, shortly after it won a license from Hong Kong’s security regulator to offer retail crypto trading . The firm did not disclose the investors in the round and now claims a valuation of $1.2 billion post-raise, giving it “unicorn” status.\n\nBitfinity Network , a Web3 infrastructure firm, announced it has successfully secured over $7 million in funding from notable backers, including Polychain Capital and ParaFi Capital, advancing its mission to establish off-chain infrastructure for Bitcoin and Ordinals.\n\nDeals and Grants\n\nPush Protocol , the communication protocol of Web3, recently concluded their Billion Reasons to Build (BRB) developer tour in India, according to the team: \"During the hackathon, Aditya Bisht successfully solved one of its hardest coding challenges belonging to the Ethereum Foundation – quantum proofing the Ethereum Network. Bisht's creation of an account abstraction smart contract effectively conceals public keys, enhancing the network's defense against quantum decryption.\"\n\nThe Hedera and Algorand ecosystems have joined to Form DeRec Alliance. (DeRec stands for \"decentralized recovery.\") According to the team: \"Entities from across the Hedera and Algorand ecosystems including the HBAR Foundation, Algorand Foundation, Hashgraph Association, Swirlds Labs, and DLT Science Foundation, along with industry partners The Building Blocks and BankSocial, are partnering to develop a new interoperability recovery standard which will simplify the recovery & adoption of crypto and other assets.\"\n\nSui , a layer-1 blockchain, is getting DePIN and DeWi through a groundbreaking partnership with Karrier One, according to the team: \"The deal also includes strategic investment from Sui to fuel the expansion of Karrier One’s global footprint and deployment on Sui. The technical integration will feature DePIN services powered by the Sui blockchain and the launch of a Karrier One Decentralized Wireless (DeWi) network token on Sui.\"\n\nData and Tokens\n\nAmong Major Layer-2 Networks, ZkSync Era Has the Cheapest Average Transactions\n\nWe finally got around to reading Messari analyst Seth Bloomberg's excellent report out a few weeks ago titled, \" The Onchain Economics of ZK Rollups .\" It provides a good snapshot of the competition between major Ethereum layer-2 networks as 2023 closed out. The report reinforced the oft-repeated observation that \"Data publishing (or data availability) generally remains the highest on-chain cost for rollups\" – thus underscoring the significance of Ethereum's upcoming \"Dencun\" upgrade, which is supposed to lead to drastic reductions in those expenses. But there are different ways to handle the data, of course, and the zkSync Era project stands out in that it \"only posts state diffs to Ethereum,\" while most rollup networks \"publish the full rollup transaction data.\" Per the report: \"In simple terms, publishing state diffs means that if two users send ETH and other tokens to each other multiple times, only the net differences in their account balances need to be published to Ethereum instead of the full transaction history between the two users.\" The upshot? ZkSync Era has the lowest average transaction costs, at 18 cents, seen as a nice bargain compared with Polygon zkEVM's 45 cents.\n\nCalendar"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1kZXBsb3llZC1zdWNjZXNzZnVsbHktMDQyNTIzMjU5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade Deployed Successfully on Goerli Testnet - Yahoo Finance",
        "content": "Ethereum’s Dencun Upgrade Deployed Successfully on Goerli Testnet\n\nEthereum's core developers have taken a significant step towards improving the network's scalability with the deployment of the Dencun upgrade on the Goerli testnet on January 24, 2024, at around 1:35 a.m. ET. However, the upgrade faced issues in the validator clients' ability to sync with each other.\n\nParithosh Jayanthi, DevOps engineer at the Ethereum Foundation, later announced that the fix was patched in and the Dencun fork on Goerli was finalized. In preparation for this transition, the development team has opted for a phased approach, initially implementing the upgrade on various testnets.\n\nThe successful deployment on the Goerli testnet marks the first phase of a gradual rollout, with subsequent implementations planned for the Sepolia and Holesky testnets before the final mainnet release in Q1 2024.\n\nThe Dencun upgrade introduces EIP-4844, a novel transaction mechanism known as ephemeral blobs or proto-danksharding. This approach allows Ethereum nodes to temporarily store and access off-chain data, reducing storage demands and lowering transaction costs. By reducing transaction costs, EIP-4844 will make it more affordable to use Ethereum dApps and Layer 2 solutions.\n\nThe Dencun upgrade is a positive development for the Ethereum ecosystem, bringing the network closer to enhanced scalability and lower transaction costs. The phased rollout approach minimizes risks and allows for thorough testing, ensuring a successful transition to the upgraded network.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1wdWxscy1iYWNrLW9uLXdlZG5lc2RheS0xNDAyOTc00gFcaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLXByaWNlLWZvcmVjYXN0LWV0aGVyZXVtLXB1bGxzLWJhY2stb24td2VkbmVzZGF5LzE0MDI5NzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Pulls Back on Wednesday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tbWFrZXMtaW1wb3J0YW50LXN0YXRlbWVudC1hYm91dC1ldGhlcmV1bS1sYXllci0yc9IBVWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tbWFrZXMtaW1wb3J0YW50LXN0YXRlbWVudC1hYm91dC1ldGhlcmV1bS1sYXllci0ycz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Makes Important Statement About Ethereum Layer 2s - U.Today",
        "content": "A recent conversation with Vitalik Buterin on X platform sheds light on a few important topics regarding L2 networks – the main scalability tool for the Ethereum network.\n\nAdvertisement\n\nAt its core, an L2 solution is a secondary framework or protocol built atop the Ethereum blockchain, designed to increase transaction capacity and speed without compromising the security provided by the main chain, known as layer 1 (L1). This conversation is vital because it helps users understand the types of solutions available and their respective tradeoffs.\n\nYeah I agree with this. I called them \"security-favoring\" vs \"scale-favoring\" here, but we can probably come up with better terms (\"strong L2\" vs \"light L2\" perhaps?)https://t.co/oSPZkB3Xo3 — vitalik.eth (@VitalikButerin) January 16, 2024\n\nButerin participated in a discussion clarifying that \"L2s\" encompass both rollups and validiums. The distinction is important for users to grasp the different security and scalability features. Rollups are \"security-favoring\" solutions that bundle or \"roll up\" transactions into a single proof, which is posted to the main chain.\n\nThis process allows for high security, as the L1 blockchain directly secures them. In contrast, validiums are \"scale-favoring,\" designed to boost capacity by storing data off-chain but with proofs still on-chain, offering slightly less security for much greater scalability.\n\nThe distinction is nuanced but significant. While rollups are more expensive due to the data being posted on-chain, they offer higher security. Validiums, on the other hand, provide a cheaper alternative, with a slight tradeoff in security. Buterin suggests that the terminology should reflect these differences without delegitimizing either option. In the spectrum of L2 solutions, he proposes terms like \"strong L2\" for rollups and \"light L2\" for validiums to help users navigate their choices better.\n\nInterestingly, Buterin also points out that the architecture of L2 solutions is not strictly about security levels. He previously attempted to categorize these layers but recognized that there is a significant \"intermediate space\" between rollups and validiums, further complicating the classification."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY3J5cHRvLm5ld3MvcWNwLWV0aGVyZXVtLWxpa2VseS10by1zdXJwYXNzLWJpdGNvaW4taW4tbWlkdGVybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "QCP: Ethereum likely to surpass Bitcoin in midterm - crypto.news",
        "content": "Ethereum is outperforming Bitcoin, driven by market anticipation of potential spot ETH ETF approvals.\n\nEthereum (ETH) is showing signs of outperforming Bitcoin (BTC) in the midterm, according to QCP Capital’s latest market update report. This shift in market dynamics is linked to the anticipation of potential approvals for spot ETH ETFs.\n\n6/ The next major crypto events are BTC halving (mid-Apr), and potential ETH Spot ETF approvals from May. In the meantime, crypto might take some direction from macroeconomic events. — QCP Capital (@QCPCapital) January 17, 2024\n\nRecently, the U.S. Securities and Exchange Commission (SEC) approved multiple spot Bitcoin ETFs, following which Ether’s value saw an uptick of over 5%. In contrast, Bitcoin’s price experienced a decline of more than 6% during the same period.\n\nQCP Capital analysts project that Ethereum’s upward trajectory is likely to persist, especially with the narrative shifting toward the likelihood of ETH spot ETF approvals. Furthermore, the report highlights a notable ETH/BTC exchange rate increase, rising from 0.05 to 0.06 within a week.\n\nYou might also like: QCP Capital doubted market hype after spot Bitcoin ETFs launch\n\nUpcoming significant events in the crypto space, such as Bitcoin’s halving in mid-April and potential spot Ethereum ETF approvals starting from May, are also expected to impact market trends.\n\nThe potential for a spot Ether ETF gained further momentum following remarks from BlackRock CEO Larry Fink, who acknowledged the value of such a product in the United States. BlackRock, the world’s largest asset manager, had previously filed with the SEC for a spot Ethereum ETF in November, following its application for a spot Bitcoin ETF in June.\n\nThe percentage of Ether’s circulating supply in profit has also risen over the past week, reaching a multi-year high of 91.8%. Bitcoin has decreased to 86.2%, indicating growing investor confidence in Ethereum compared to Bitcoin.\n\nRead more: QCP Capital optimistic about spot BTC and ETH ETFs\n\nFollow Us on Google News"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLWNvdWxkLXJpc2UtZnVydGhlci1hcy1zdXBwbHktb24tZXhjaGFuZ2VzLW5lYXJzLWFsbC10aW1lLWxvdy0yMDI0MDExNzExMTfSAYsBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtY291bGQtcmlzZS1mdXJ0aGVyLWFzLXN1cHBseS1vbi1leGNoYW5nZXMtbmVhcnMtYWxsLXRpbWUtbG93LTIwMjQwMTE3MTExNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price could rise further as supply on exchanges nears all-time low - FXStreet",
        "content": "Share:\n\nEthereum supply on exchanges is close to its all-time low of 8.05%, lending support to ETH price gains.\n\nThe altcoin’s dominance surge against Bitcoin pushes ETH/BTC nearly 18.00% higher in the past week.\n\nEthereum added over 89,400 ETH addresses per day in the past week, according to Santiment data.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, noted a consistent increase in the number of new addresses created per day and a consistent decline in its supply on exchanges. In the past week, data from crypto intelligence tracker Santiment shows nearly 90,000 new addresses were added per day to Ether.\n\nAt the time of writing, the Ethereum/Bitcoin ratio is up nearly 18.00% in the past week.\n\nAlso read: Bitcoin records largest transaction of 2024, $665.3 million BTC transferred on Tuesday\n\nEthereum bullish on-chain activity supports price gains\n\nEthereum’s recent on-chain activity suggests the altcoin could see further gains. In the past few weeks, Ethereum added over 89,400 wallets to its chain on avearge every day, as seen in the Santiment chart below. Data from the on-chain tracker reveals that 96,300 new ETH wallets were created on Tuesday.\n\nEthereum price dominance and supply on exchanges. Source: Santiment\n\nThe creation of new wallets on a chain is a sign of its relevance among market participants, signaling that demand for the cryptocurrency is likely on the rise. Santiment data shows that Ethereum’s price has surged against Bitcoin, with ETH price up nearly 18.00% in the past week.\n\nMoreover, Ethereum supply on exchanges has hit a near all-time low at 8.06%, as seen in the chart below. ETH supply dropped from 8.97% in July 2023, and it hit a bottom of 8.05% in December 2023.\n\nTypically, a decline in exchange supply supports ETH price gains.\n\nETH supply on exchanges. Source: Santiment\n\nAt the time of writing, ETH is trading at 0.059 against BTC. ETH/BTC climbed nearly 18.00% in the past week and 12.23% in the past month. Ethereum price is $2,545.70 on Binance."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWRvbWluYW5jZS1vdmVyLWJpdGNvaW4tZ3Jvd3MtZXhjaGFuZ2Utc3VwcGx5LWF0LWFsbC10aW1lLWxvdy_SAWVodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS1kb21pbmFuY2Utb3Zlci1iaXRjb2luLWdyb3dzLWV4Y2hhbmdlLXN1cHBseS1hdC1hbGwtdGltZS1sb3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "ETH News: Ethereum Price Dominance Over Bitcoin Grows - CoinGape",
        "content": "While the Bitcoin price has been consolidating largely post-ETF approval, Ethereum (ETH) has been making strong upside moves, thereby closing the gap with BTC. At press time, the Ethereum price is trading 1.44% up at a price of $2,564 with a market cap of $308 billion.\n\nThe Ethereum Price Dominance\n\nAccording to insights provided by on-chain data provider Santiment, Ethereum’s price dominance has experienced a notable surge against Bitcoin, marking a +22.4% increase over the past week. This period has witnessed the creation of 89.4K new Ethereum addresses per day, further underscoring the platform’s growing traction. Notably, a staggering 96.3K wallets were created just yesterday.\n\nadvertisement\n\nIn addition to these on-chain activities, Santiment’s data reveals a significant trend in Ethereum’s supply on exchanges, nearing its All-Time Low of 8.05%. This movement toward self-custody and staking implies a reduced risk of an imminent selloff, presenting a more favorable scenario compared to concerns arising from a rising supply on exchanges. These on-chain dynamics shed light on Ethereum’s current market strength and its potential implications for future price movements.\n\nETH Price Action Going Ahead\n\nIn the recent trading session on Tuesday, Ethereum price initially experienced a slight pullback, testing the crucial $2,500 level. Notably, this level had previously served as significant resistance but now appears to be providing substantial support for the cryptocurrency. The price action suggests Ethereum’s attempt to enter a consolidation phase.\n\nThe $2,700 level emerges as a key threshold, representing the upper boundary of the short-term trading range. Analysts consider this level crucial, and a breakthrough could set the stage for a potential market surge, with Fear of Missing Out (FOMO) traders likely to join the rally. Beyond $2,700, the Ethereum price could further rally all the way to $3,400.\n\nConversely, a downside scenario could unfold if the second-largest crypto by market cap breaks below the hammer formed during the Monday session. In such a case, the cryptocurrency might see a downward movement toward the 20-Day Exponential Moving Average (EMA), situated around the $2,300 level. Traders are closely monitoring these critical levels, anticipating potential shifts in Ethereum’s short-term trajectory."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xNy9ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWxlYXBzLTE1LWluLWhvdXJzLWFmdGVyLWFubm91bmNlbWVudC1vZi1hLWZyZWUtdG8tcGxheS1nYW1lLWZvci10aGUtZWNvc3lzdGVtL9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xNy9ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWxlYXBzLTE1LWluLWhvdXJzLWFmdGVyLWFubm91bmNlbWVudC1vZi1hLWZyZWUtdG8tcGxheS1nYW1lLWZvci10aGUtZWNvc3lzdGVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Based Altcoin Leaps 15%+ in Hours After Announcement of a Free-To-Play Game for the Ecosystem - The Daily Hodl",
        "content": "One of the top memecoins in recent years is rallying after the announcement of a new free-to-play blockchain game.\n\nApeCoin (APE), a memecoin associated with the Bored Ape Yacht Club non-fungible token (NFT) collection, APE hit a high of $1.67 and a low of $1.44 on January 17th – a difference of approximately 16%.\n\nAPE has since stabilized at $1.59 at time of writing, still up 10% in the last 24 hours.\n\nAccording to the Yuga Labs Gaming account on the social media platform X, a new game is coming out soon.\n\n“Looks like Curtis needs to get the plunger out, there’s something in the toilet.\n\nDookey Dash Unclogged, coming Q1 2024. This time anyone can play.”\n\nApeCoin DAO (decentralized autonomous organization) owns and operates Yuga Labs, the maker of the upcoming game.\n\nAccording to a video on the game’s official website, the game appears to be a racer involving avatars speeding vehicles through racecourses of plumbing pipes and sewage drains. It is the sequel of a previous game, titled “Dookey Dash.”\n\n“Dookey Dash Unplugged (DDU) is a casual, free-to-play, cross-platform game that is a continuation of the beloved original Dookey Dash, with some new delights. (New here? Basically, the OG Dookey Dash was a dash through the sewers, as players dodged cows and trash in an attempt to make it to the butthole key. It’s kind of a long story.)”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Catalyst Labs/WindAwake"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xNy9ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXRoYXRzLXN1cmdlZC0yNDUtaW4tdGhyZWUtbW9udGhzLWxvb2tzLWluY3JlZGlibHktYnVsbGlzaC12ZXJzdXMtYml0Y29pbi1zYXlzLXRyYWRlci_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMTcvZXRoZXJldW0tYmFzZWQtYWx0Y29pbi10aGF0cy1zdXJnZWQtMjQ1LWluLXRocmVlLW1vbnRocy1sb29rcy1pbmNyZWRpYmx5LWJ1bGxpc2gtdmVyc3VzLWJpdGNvaW4tc2F5cy10cmFkZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Based Altcoin That’s Surged 245% in Three Months Looks ‘Incredibly Bullish’ Versus Bitcoin, Says Trader - The Daily Hodl",
        "content": "A closely followed crypto strategist thinks that one Ethereum (ETH)-based altcoin is about to soar against Bitcoin (BTC).\n\nPseudonymous analyst The Crypto Dog tells his 750,500 followers on the social media platform X that the decentralized exchange protocol Injective (INJ) is looking bullish on the INJ/BTC trading pair chart.\n\n“Incredibly bullish structure.”\n\nLooking at his chart, the trader suggests that INJ/BTC could soon flip a key resistance level into support, after failing to do so on two prior attempts in recent days.\n\nOn October 16th INJ/BTC closed at 0.0002737 BTC ($7.80) and is now at 0.0009446 BTC ($40.75), a gain of approximately 245%.\n\nThe trader also says that Injective looks like it is on the verge of a breakout after a period of consolidation in the high $30s and low $40s range.\n\n“INJ looks like another winner to come this week. Been consolidating here longer than expected, but it’s been just a matter of time.”\n\nThe trader also predicts that the fan engagement token Chiliz (CHZ) is about to undergo a trend reversal.\n\n“I took a CHZ position. Looks ready to break this two-year-long downtrend, big gains to be made if it does. Strong project, unique fundamentals, always been a fan. One of the first to merge the real world with crypto.”\n\nChiliz is trading for $0.106 at time of writing, up nearly 17% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWRlbmN1bi1pbnNjcmlwdGlvbnMtc3B1ci1ldGhzLXByaWNlL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWRlbmN1bi1pbnNjcmlwdGlvbnMtc3B1ci1ldGhzLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Will Dencun, Inscriptions spur ETH’s price? - AMBCrypto News",
        "content": "Ethereum saw a surge in activity due to rising interest in Inscriptions.\n\nA large amount of ETH got unstaked due to Celsius and Figment.\n\nRecently, Ethereum [ETH] experienced a massive uptick in network activity, partly driven by an increasing interest in Inscriptions.\n\nGas usage on the rise\n\nInscriptions constituted 77% of all Ethereum transactions for a brief period. This surge in Inscriptions contributed to a concurrent increase in gas usage on the network.\n\nThe influx of addresses, attracted to the network through Inscriptions, could positively impact Ethereum by enhancing its overall activity and engagement.\n\nInscriptions made up 77% of Ethereum txs for a few hours yesterday, a first for the L1 src: https://t.co/q6ZUx8QT6v pic.twitter.com/vDoflH0ko2 — hildobby (@hildobby_) January 15, 2024\n\nHowever, amidst this positive development, Ethereum could face a challenge in the form of significant staked ETH redemptions.\n\nAccording to an X (formerly Twitter) post, the start of January saw the largest staked ETH redemption since the Shanghai Upgrade. Notably, a substantial 656,200 ETH was fully withdrawn.\n\nEven though the unstaking was a result of the behavior of bankrupt crypto lender Celsius and staking service provider Figment, this withdrawal could potentially impact Ethereum’s staking ecosystem and affect market dynamics.\n\nLast week was the largest staked ETH redemption (Excl. Rewards) since the Shanghai Upgrade with 656.2k ETH (~$1.6B) being fully withdrawn 85% of the withdrawal is contributed by Figment + Celsius https://t.co/Xr8RWPWBPH pic.twitter.com/8yY4BE3RB3 — Tom Wan (@tomwanhh) January 15, 2024\n\nProgress on the development front\n\nLooking ahead, Ethereum is gearing up for the Dencun upgrade. In the next 24 hours, the Dencun upgrade will be deployed on the Goerli testnet. This upgrade introduces blobs to the testnet which is also known as “protodanksharding.”\n\nThis introduction aims to reduce Layer 2 transaction fees, which can help Ethereum in terms of scalability and cost-effectiveness.\n\nGoerli is forking this Wednesday (or Tuesday night, for parts of the world!). If you haven't done so yet, update your node 🤖! https://t.co/2MlxBtUo0X — timbeiko.eth ☀️ (@TimBeiko) January 15, 2024\n\nDespite these advancements, Ethereum’s market performance saw a decline in its price, trading at $2,529.86 at the time of writing. Over the last 24 hours, ETH experienced a decrease of 0.28%.\n\nDespite the price decline, the MVRV ratio continued to grow. This signaled that a significant number of addresses were holding profitable positions.\n\nWhile this might incentivize some addresses to sell their ETH, potentially impacting the price negatively, the Long/Short difference provided a contrasting perspective.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe growing Long/Short difference suggested a higher number of long-term holders compared to short-term holders.\n\nLong-term holders, being less likely to sell, can contribute to price stability and resilience in the face of short-term market fluctuations."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3ZpdGFsaWstYnV0ZXJpbi1pbnRlcmVzdGluZ2x5LXNoZWRzLWxpZ2h0LW9uLWV0aGVyZXVtLWxheWVyLTIv0gFdaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3Mvdml0YWxpay1idXRlcmluLWludGVyZXN0aW5nbHktc2hlZHMtbGlnaHQtb24tZXRoZXJldW0tbGF5ZXItMi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Interestingly Sheds Light on Ethereum Layer 2 - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nThe founder of the decentralised mining network and software development platform Ethereum Vitalik Buterin shared his insights about Ethereum layer 2 of the Ethereum blockchain.\n\nVitalik shared pivotal points regarding L2 networks which are considered as main scalability tool for the Ethereum Network.\n\nDebate About L2 Layer\n\nThe L2 layer on the Ethereum blockchain is a collective term for an Ethereum scaling solution that manages transactions off Ethereum layer 1 while still taking benefit of the robust decentralized security of Ethereum layer 1. Layer 2 is a different blockchain that extends Ethereum.\n\nL2 solution is designed to improve transaction capacity and pace without compromising on the security which is facilitated by the main chain layer1. This proves to be beneficial for the users as it helps users to understand the types of solutions available for their respective issues.\n\nVitalik engaged in a debate which was about “L2s” encompassing both rollups and validiums. The users need to understand the different security features where rollups are “security-favoring” solutions that bundle or “roll up” transactions into a single proof, which is posted to the main chain. This methodology enables high security, as the L1 blockchain instantly secures them.\n\nComparatively, rollups are a bit expensive due to their ability to its data on-chain which provides higher security on the other hand Validiums provide an inexpensive alternate option to rollups. The founder of Ethereum Vitalik has suggested that terminology should reflect these distinctions without delegitimizing either option. In the spectrum of L2 solutions, he suggests terms like “strong L2” for rollups and “light L2” for validiums to enable users to guide their choices better.\n\nVitalik also cleared that the whole process of L2 solution is not only about security as both rollups and Validiums have “intermediate space”."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMTMyODEvZnJhbmtsaW4tdGVtcGxldG9uLWxheWVyLW9uZS1ldGhlcmV1bS1zb2xhbmEtYWZ0ZXItYml0Y29pbtIBWmh0dHBzOi8vZGVjcnlwdC5jby8yMTMyODEvZnJhbmtsaW4tdGVtcGxldG9uLWxheWVyLW9uZS1ldGhlcmV1bS1zb2xhbmEtYWZ0ZXItYml0Y29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Laser-Eyed Franklin Templeton Sets Sights on Ethereum, Solana After Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a series of tweets on Wednesday, global investment firm Franklin Templeton opined about the merits of layer one blockchain Solana and Ethereum, leading to speculation about the investment giant’s next move.\n\nWe got the reins back. Thanks to our DA research team for the thread today. Please follow our @FTI_DA account for more updates from our Digital Assets team. https://t.co/D7Lgt0A0nU — Franklin Templeton (@FTI_US) January 17, 2024\n\nAD\n\nAD\n\nOne of the largest asset management companies in the world, Franklin Templeton, manages over $1.4 trillion in assets.\n\n“We believe as blockchains improve in fees and performance, the potential use cases that are unlocked grow exponentially,” the Franklin Templeton digital asset team said. “Improving the economics and experience for the end user cannot be overstated.”\n\nLast week, Franklin Templeton joined other major firms, including BlackRock, VanEck, Ark Invest, and Fidelity, in having their spot Bitcoin ETFs approved by the U.S. Securities and Exchange Commission.\n\nFranklin Templeton expressed admiration for the Solana blockchain, calling Solana Labs co-founder Anatoly Yakovenko's vision of it as a single atomic state machine a “powerful use case.”\n\n“On Solana, we see Anatoly’s vision of a single atomic state machine as a powerful use case of decentralized blockchains, lowering information asymmetry,” they said. “And we are impressed by all the activity seen on Solana in Q4 2023.”\n\nProjects driving the activity on the Solana Blockchain Franklin Templeton highlighted include DePIN, meme coins, NFTs, DeFi, and the high-performance validator client Firedancer.\n\nAD\n\nAD\n\nThe account also expressed excitement about Ethereum and its ecosystem, highlighting the growing pains of the largest proof-of-stake blockchain.\n\n“We are excited about ETH and its ecosystem,” the company said. “Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward.”\n\nWe are excited about ETH and its ecosystem. Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward\n\n-EIP 4844\n\n-Alt DA\n\n-Community Revitalization\n\n-Restaking — Franklin Templeton (@FTI_US) January 17, 2024\n\nThe firm highlighted several factors that it believes contribute positively to the Ethereum ecosystem's momentum, including EIP 4844, developments in alternative data availability (Alt DA), community revitalization, and restaking.\n\nThe Franklin Templeton account went on to say the company believes other layer-one blockchains besides Bitcoin, Ethereum, and Solana have potential.\n\n“Other L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature,” they said.\n\nOther L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature — Franklin Templeton (@FTI_US) January 17, 2024\n\n“The lawyers won't let us respond to comments, but we hear you,” the account concluded.\n\nAD\n\nAD\n\nThe lawyers won't let us respond to comments, but we hear you — Franklin Templeton (@FTI_US) January 17, 2024\n\nWhen asked to comment on the tweets, a Franklin Templeton spokesperson declined to comment further.\n\n“We cannot comment on any potential future fund offerings, but we can say that we are continuously monitoring developments in the digital assets and ETF ecosystems for opportunities to diversify our off,” the spokesperson told Decrypt.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMTgvZnJheC1maW5hbmNlcy1sYXllci0yLWZyYXh0YWwtdG8tZGVidXQtaW4tZmVicnVhcnktZm91bmRlci_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDI0LzAxLzE4L2ZyYXgtZmluYW5jZXMtbGF5ZXItMi1mcmF4dGFsLXRvLWRlYnV0LWluLWZlYnJ1YXJ5LWZvdW5kZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Frax Finance's Layer 2 Fraxtal to Debut in February: Founder - CoinDesk",
        "content": "Kazemian added that Fraxtal’s blockspace incentives feature, called Flox, makes it stand out among other layer 2s. Blockspace refers to the limited amount of data that can be stored in each block on the blockchain. Users and developers using the chain and paying for the blockspace stand to earn a constant yield through the incentive program and the weekly FXTL point gauge system."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDI0LzAxLzE3L3JpcHBsZS1jdG8tYWRkcmVzc2VzLWNvbmNlcm5zLWJlaGluZC14cnAtbGVkZ2VyLW1pc3NpbmctZ2VuZXNpcy1ibG9jay1jaXRlcy1ldGhlcmV1bS1leGFtcGxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ripple CTO Addresses Concerns Behind XRP Ledger Missing Genesis Block, Cites Ethereum Example - The Crypto Basic",
        "content": "David Schwartz, the CTO of Ripple, recently addressed concerns surrounding the missing genesis block on the XRP Ledger (XRPL), citing a similar case with Ethereum.\n\nSchwartz made the latest disclosures while responding to questions raised by community member MetaMan regarding the XRP Ledger’s seemingly unusual start at block 32,569.\n\nMetaMan voiced skepticism and emphasized the importance of transparency for XRP holders. “Tell me, is there any blockchain that lost its genesis block,” the XRP community member asked Schwartz on X.\n\n- Advertisement -\n\nSimilar Case with Ethereum\n\nIn response, the Ripple CTO drew a parallel to Ethereum’s genesis block ambiguity. He highlighted that Ethereum, despite having transactions predating its official start, does not publicly document them.\n\nThe choice of what to consider the genesis block is arbitrary. For example, ETH has lots of transactions before its genesis block that are not in the publicly available record. 1/2 — David \"JoelKatz\" Schwartz (@JoelKatz) January 16, 2024\n\nSchwartz pointed to a specific 2,622 ETH transaction on Aug. 3, 2016, moving over $6 million. He questioned, “Where did that ETH come from? Where’s the transaction that explains it?”\n\nAn XRP community member referenced transactions showing 40,000 ETH transferred during Ethereum’s genesis block.\n\n- Advertisement -\n\nSchwartz acknowledged this but stressed that the source of those 40,000 ETH was not publicly visible due to deliberate decisions in defining Ethereum’s genesis block.\n\nSchwartz argued that such decisions, including XRPL’s genesis block starting at ledger 32,569, were arbitrary. He contended that similar choices, like those made in Ethereum’s case, aimed to obscure fund sources.\n\nWhen asked if the 40,000 ETH tokens “just showed up out of thin air,” the Ripple CTO emphasized that, from the public blockchain perspective, they did. However, he stressed that Ethereum insiders possess more information on the matter.\n\nNonetheless, in the case of the XRP Ledger, being one of the original architects, Schwartz confirmed that the genesis ledger of the chain had no transactions. However, according to him, the first 32,570 ledgers contained 534 transactions, which are presumably lost now.\n\nBefore Schwartz’s response to MetaMan’s initial question, Mayukha Vadari, a Senior Software Developer at RippleX, explained the reason behind the loss of genesis block.\n\nShe noted that the initial set of XRPL servers experienced uniform configuration and simultaneous memory depletion, leading to ledger issues.\n\nSustained Concerns Around the XRPL Genesis Block\n\nThis isn’t the first time the genesis block’s peculiarity has been questioned. Critics, in the past, raised concerns about the distribution scheme of XRP, suggesting hidden motives behind the absence of earlier ledgers. Schwartz has consistently debunked such notions.\n\nAn XRP holder asked a similar question in the Bitcoin Stack Exchange forum in October 2013, a year after the XRP Ledger went live. He sought to know the reason behind starting the network at block 32,570.\n\nSchwartz responded to this query, noting that a bug affected Ripple servers, causing ledger headers to be lost.\n\nDespite efforts to collect data, insufficient information hindered ledger reconstruction. He reassured the user that the missing ledgers (1 – 32,570) held no significance for average XRPL users.\n\nMoreover, in a post from December 2019, Schwartz provided a broader historical perspective, emphasizing the XRP Ledger’s evolution since its live debut in June 2012. According to him, after the ledger went live, it featured bugs which they had to fix.\n\nSchwartz confirmed that, as a result of some of these bugs and reset exercises carried out on the network, data from the XRP Ledger’s first week, stored in ledgers 1 – 32,570, was lost. However, he assured that they did not recreate the initial 100 billion XRP supply upon the resets."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm5lcmR3YWxsZXQuY29tL2FydGljbGUvY3JlZGl0LWNhcmRzL2NyZWRpdC1jYXJkcy13aXRoLWNyeXB0by1yZXdhcmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Best Crypto Credit Cards - NerdWallet",
        "content": "We believe everyone should be able to make financial decisions with confidence. And while our site doesn’t feature every company or financial product available on the market, we’re proud that the guidance we offer, the information we provide and the tools we create are objective, independent, straightforward — and free.\n\nSo how do we make money? Our partners compensate us. This may influence which products we review and write about (and where those products appear on the site), but it in no way affects our recommendations or advice, which are grounded in thousands of hours of research. Our partners cannot pay us to guarantee favorable reviews of their products or services. Here is a list of our partners."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1jb21wbGV0ZXMtZGVuY3VuLW5ldHdvcmstdXBncmFkZS1vbi1nb2VybGktdGVzdG5ldC0yLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Completes Dencun Network Upgrade on Goerli Testnet - Cryptonews",
        "content": "Ethereum Completes Dencun Network Upgrade on Goerli Testnet\n\nEthereum has successfully implemented the Dencun network upgrade on the Goerli testnet.\n\nOn Jan. 17, Ethereum’s developers have deployed the previously announced Dencun upgrade, succeeding the Shapella upgrade (also known as the Shanghai upgrade) in 2023.\n\nThe Dencun upgrade prominently features the implementation of EIP-4844, known as proto-danksharding. Proto-danksharding, as the main component, allows for the temporary storage of off-chain data, easing the storage demands on Ethereum nodes.\n\nThis development is anticipated to significantly lower transaction fees for decentralized applications (dApps), particularly benefiting Layer 2 rollup chains.\n\nDencun is Goerli Testnet’s Last Upgrade\n\nAccording to the Ethereum core team, the Dencun upgrade will be the last upgrade for the Goerli testnet, Ethereum’s first multi-client testnet, before the developers stop supporting it.\n\n“Either three months after the Goerli Dencun activation, or one month after the Dencun mainnet activation, whichever comes later, teams will begin exiting their validators,” said the team. “Anyone relying on Goerli as a stable testnet should migrate elsewhere prior to this.”\n\n“Application and tooling developers are encouraged to use Sepolia to test decentralized applications, smart contracts, and other EVM functionality,” said the team. “Stakers and infrastructure providers concerned with protocol-level testing are encouraged to use the newly launched Holesky testnet.”\n\nThe upgrade is named “Dencun” as it combines the naming conventions for Ethereum’s consensus and execution layer upgrades. Consensus layer upgrades are typically named after stars, while execution layer upgrades follow the names of Devcon city locations.\n\n“Dencun” merges “Deneb,” a first-magnitude star in the Cygnus constellation, with “Cancun,” the host city for Devcon 3, reflecting the collaborative nature of the upgrade across both layers of Ethereum’s architecture.\n\nThe upgrade was livestreamed by the developers. If no major issues are found following the Goerli implementation, it will be deployed to Sepolia and Holesky.\n\nButerin Says Validiums are Not Genuine Rollup Solutions\n\nEthereum co-founder Vitalik Buterin has recently sparked a debate about the classification of layer 2 scaling solutions, particularly focusing on Ethereum’s validiums. Buterin asserts that validiums, which use off-chain data storage, should not be considered true rollup solutions.\n\nValidiums, while offering scalability through zero-knowledge proofs for off-chain transactions, face challenges in terms of data availability, differing from ZK-rollups which post full transaction data on the Ethereum mainnet.\n\nThe discussion in the Ethereum community regarding the evolution and categorization of its scaling solutions has become increasingly relevant as Ethereum now moves forward with its Dencun upgrade."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2V0aGVyZXVtLW5ld3MvcWNwLWNhcGl0YWwtZm9yZWNhc3RzLWV0aHMtZG9taW5hbmNlLW92ZXItYml0Y29pbi10by1wZXJzaXN0LWV0aGVyZXVtLWV0ZnMtaW4tZm9jdXMv0gF-aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vZXRoZXJldW0tbmV3cy9xY3AtY2FwaXRhbC1mb3JlY2FzdHMtZXRocy1kb21pbmFuY2Utb3Zlci1iaXRjb2luLXRvLXBlcnNpc3QtZXRoZXJldW0tZXRmcy1pbi1mb2N1cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "QCP Capital Forecasts ETH’s Dominance Over Bitcoin To Persist, Ethereum ETFs In Focus - NewsBTC",
        "content": "Over the past 30 days, Ethereum (ETH), the second-largest cryptocurrency, has experienced a notable surge of 17%, outperforming Bitcoin (BTC), which has recorded a surge of 2.5% over the same period.\n\nThis comes as the initial excitement surrounding the approval of the exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) appears to have waned, with BTC witnessing a 5% drop in the past seven days.\n\nInterestingly, according to crypto trading firm QCP Capital, following the approval of Bitcoin ETFs, the focus has shifted to the potential launch of an ETH spot ETF, which could be one of the factors for Ethereum outperforming BTC.\n\nEthereum Gains Ground Against BTC\n\nAccording to QCP Capital, the total volumes transacted across all 11 ETFs in the past week have reached $9.8 billion. The Grayscale Bitcoin Trust (GBTC) alone accounted for $4.6 billion.\n\nSince converting from a Trust to an ETF, GBTC has experienced outflows of $1.17 billion. This is “unsurprising” for the firm, considering GBTC had been trading at a discount since 2020, offering investors an opportunity to exit at par value.\n\nBTC initially surged to a high of $49,100 upon ETF approval but has since seen a decline, consolidating above the $40,000 support level. Volumes have slowed since the initial launch, and market attention is focused on GBTC outflows.\n\nMeanwhile, ETHBTC, which traded below 0.05, has seen an upward trend to 0.06. According to QCP Capital, Ethereum is anticipated to continue to outperform Bitcoin in the medium term as the narrative shifts towards potential ETH Spot ETF approvals.\n\nBitcoin Forward Contract Yields Decrease\n\nFollowing the launch of the BTC spot ETF, BTC forward contracts have experienced a greater decline compared to ETH forward contracts. BTC 1-month forward fell from 32% annualized to 9% (-23%), while ETH 1-month forward decreased from 28% to 12% (-16%).\n\nAccording to QCP Capital, despite declining yields, ETH forwards still appear attractive, offering 11-13% annualized returns. Additionally, selling ETH 1-month 2200 Puts presents a viable option with yields above 21% annually, and it could be a suitable level to buy in the event of a dip upon potential ETH spot ETF approvals.\n\nUltimately, the crypto firm suggests that the forthcoming BTC halving in mid-April and the potential approval of ETH Spot ETFs from May are anticipated to be significant events for the crypto market.\n\nIn the interim, market movements may also be influenced by macroeconomic events. The January Federal Open Market Committee (FOMC) meeting, as well as the February Non-Farm Payrolls (NFP) and Consumer Price Index (CPI) reports, are being closely monitored for insights.\n\nThe pace of the balance sheet runoff, discussed briefly in December 2023, is expected to provide further clarity during the January FOMC meeting. The market consensus suggests a slowdown in quantitative tightening (QT), but the timing and extent of these changes remain uncertain.\n\nOverall, the potential launch of an Ethereum spot ETF has sparked speculation and could have a transformative impact on the Ethereum ecosystem. As the market grapples with changing dynamics, attention remains on key events, such as the BTC halving and potential ETH Spot ETF approvals.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMTcvZGVuY3VuLXVwZ3JhZGUtZ29lcy1saXZlLW9uLWV0aGVyZXVtcy1nb2VybGkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Dencun Upgrade Goes Live on Ethereum's Goerli - Crypto Times",
        "content": "The eagerly anticipated Dencun upgrade for Ethereum went live on the Goerli testnet earlier on Wednesday. However, it was not completed in the allotted amount of time.\n\nDencun appeared to have split after failing to conclude as anticipated, despite being released on Goerli on Wednesday at 6:32 UTC, according to a live stream on YouTube.\n\nThe team waits for time to properly assess the improvement. But even so, one of the engineers had foreseen difficulties before the update.\n\n“It will take time to accurately evaluate the status. Therefore, before someone claims that the Goerli hard fork failed and Deneb is delayed, we should allow time for a proper analysis,” Terence, an Ethereum engineer, stated.\n\nThe price of Ethereum (ETH) is not significantly affected by the Dencun update. According to the screenshot below, ETH is currently trading at $2,545, up 0.83% over the previous day.\n\nBy the end of January, the team intends to deploy the Dencun update on the Sepolia testnet. It has set February 7 for the upgrade on the Holesky testnet in the interim. The Dencun mainnet upgrade is currently anticipated to be completed by the end of the first quarter."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tZmxpcHBlbmluZy10cmFkaW5nLWZpcm0tZXhwZWN0cy1ldGgtdG8tb3V0cGVyZm9ybS1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum flippening: Trading firm expects ETH to outperform Bitcoin - Finbold - Finance in Bold",
        "content": "One of the most controversial expectations in the cryptocurrency market is known as “the flippening.” The flippening is the forecast of Ethereum (ETH) surpassing Bitcoin (BTC) in market capitalization, which is both praised and criticized.\n\nInterestingly, QCP Capital foresees Ethereum outperforming Bitcoin in price appreciation in 2024, according to a January 17 market update. The trading firm specializing in digital assets and cryptocurrencies shared the report on a Telegram group with 11,000 subscribers.\n\nDespite not mentioning a ‘flippening,’ QCP Capital mentioned the positive results of a previous report on ETH paired against BTC. Moreover, the trading firm forecasts Ethereum to continue outperforming the leading cryptocurrency due to ETH spot ETF expectations.\n\n“When ETHBTC traded below 0.05, we mentioned that the cross looked attractive from both a technical perspective and with ETH as a catchup play. ETHBTC has since traded higher to 0.06. We expect ETH to continue outperforming BTC over the medium term as the narrative rotates to potential ETH Spot ETF approvals.” — QCP Capital Broadcast\n\nQCP Market update – 17 Jan 24. Source: CQP Capital Broadcast\n\nCould an Ethereum spot ETF approval cause the flippening?\n\nThe narrative started boiling after an interview with Larry Fink, CEO of BlackRock Inc. (NYSE: BLK), on CNBC. In particular, Fink explained that BlackRock sees value in tokenization and believes the SEC will approve an Ethereum spot ETF.\n\nNotably, Bitcoin has surged by nearly 150% since January 2, 2023, until its current price of $42,418. Rumors and expectations on a Bitcoin spot ETF approval gained traction during this period while the market was pricing it.\n\nBTC/USD weekly price chart. Source: TradingView\n\nA similar price action on Ethereum would put the leading Web3, and dominating DeFi blockchain, at above $6,235. This would drive ETH capitalization to around $750 billion, still nearly $100 billion lower than Bitcoin’s current market cap. Therefore, would not be enough for a ‘flippening,’ even if BTC kept its $830 billion value by press time.\n\nETH/USD weekly price chart. Source: TradingView\n\nNevertheless, QCP Capital is still optimistic about a medium-term outperformance for the second-largest cryptocurrency over the largest one. According to the trading firm analysis, ETH could offer a better risk-reward for 2024’s investors.\n\nStill, investing in this market is unpredictable, and having caution is crucial while deploying capital for price speculation.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtaXMtbGl2ZS1vbi1nb2VybGktdGVzdG5ldC1idXQtdGhlcmUtaXMtYS1jYXRjaC_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoZXJldW1zLWRlbmN1bi11cGdyYWRlLWlzLWxpdmUtb24tZ29lcmxpLXRlc3RuZXQtYnV0LXRoZXJlLWlzLWEtY2F0Y2gvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade is Live on Goerli Testnet, But There is a Catch - CryptoPotato",
        "content": "The widely-anticipated Dencun upgrade for the Ethereum network is live on the Goerli testnet. However, the upgrade is experiencing some issues.\n\nAccording to a livestream on YouTube, Dencun was launched on Goerli at 6:32 UTC on Wednesday, but the chain appears to have split as it failed to finalize when expected.\n\nEthereum’s Dencun Upgrade Goes Live\n\nThe Dencun upgrade is Ethereum’s biggest since the Shapella upgrade in April 2023. While Shapella enabled the withdrawal of staked ether (stETH) on the network, the former is expected to significantly reduce transaction costs on layer 2 (L2) networks. They are significant steps in Ethereum’s transition from a Proof-of-Work (PoW) consensus mechanism to a Proof-of-Stake (PoS) after the Merge.\n\nDencun is expected to enhance Ethereum L2 rollup efficiency through a mechanism called proto-danksharding or ephemeral blobs (EIP-4844). The approach introduces temporary storage space for higher transactional throughput by allowing access to off-chain data to reduce storage demands. This process will slash L2 transaction costs by 10x or more as analysts believe high costs hamper the growth of the protocols.\n\nThe upgrade was initially slated for October 2023 but moved to late Q1 or early Q2 2024. It will be implemented in three phases, with Goerli’s deployment being the first. The subsequent implementation will be on the Sepolia testnet on January 31 and then the Holesky testnet on February 7 before the final release on the Ethereum mainnet.\n\nFinality Issues\n\nDencun’s deployment on Goerli failed to reach a consensus and finality. Developers believe this may be because of low participation, roughly 80%, and validators being offline. Pseudonymous X user Terence explained that validators could be offline due to operators not upgrading a piece of software or the presence of a bug.\n\nDue to Goerli having a “highly” diverse set of validators, it could take a while before the issue becomes clear. Regardless, developers intend to conduct a proper non-finality test over the next few hours or days.\n\n“Personally, I will not base my assessment of Goerli Deneb’s readiness on the immediate finality results. It will take time to accurately evaluate the status. Therefore, before someone claims that the Goerli hard fork failed and Deneb is delayed, we should allow time for a proper analysis,” Terence stated."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9ldGhlcmV1bS1kZXZlbG9wZXJzLXRlc3RuZXQtZGVuY3VuL9IBQ2h0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9ldGhlcmV1bS1kZXZlbG9wZXJzLXRlc3RuZXQtZGVuY3VuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Developers Deploy Testnet for Dencun Upgrade - Coinspeaker",
        "content": "Currently, there are plans to deploy Dencun on the Sepolia testnet on January 31, and then on the Holesky testnet on February 7.\n\nAmong the many things that the crypto industry has to look forward to, there is the Dencun upgrade for the Ethereum network. Touted as a way for Ethereum to increase its data processing abilities and scalability, it is largely seen as a game-changer by those in the industry. Now, we are a step closer to this upgrade as Ethereum developers have deployed a testnet of Dencun on the Goerli test network. This took place on January 17, 2024, at 6:32 UTC.\n\nDencun Coming Soon\n\nWhile the Dencun testnet launch was eventually deployed, it did meet some challenges along the way. Most notably, it wasn’t able to reach finality and this is credited with validators not completing software upgrades and this led to low participation rates.\n\n“And it seems like we have a chain split! Client teams are looking into it, but it’s likely to take a while to pin down + fix the issues. Keep an eye out for updates!” Tim Beiko, an Ethereum core developer, said.\n\nFinality, in terms of blockchains, refers to the mechanism that makes transactions irreversible. It is one of the most important parts of any blockchain network and has to be gotten right. The developer teams have confirmed that they are looking into these issues and should resolve them in the next few days.\n\nAt the same time, this is one of the purposes of testnet deployment- to make sure that any potential kinks are worked out before the final launch date. And this isn’t the last deployment we will see before Dencun fully goes live.\n\nCurrently, there are plans to deploy Dencun on the Sepolia testnet on January 31, 2024, and then on the Holesky testnet on February 7. All these will lead up to the final Dencun deployment by the end of the first quarter of the year.\n\nWhy the Dencun Upgrade Is Vital\n\nOne thing that the blockchain community knows very well at this point is that a single network upgrade can change the very trajectory of an ecosystem. Ethereum itself experienced this with its last major upgrade that saw the network moving from a proof-of-work consensus to a proof-of-stake one. This move saw the network’s energy use cut by over 95% and made Ethereum much better for the environment.\n\nThe Dencun upgrade is also on track to be impactful by introducing proto-danksharding. This is a mechanism that will increase Ethereum’s capacity for data handling and make it cheaper to use. As such, Ethereum will become more scalable once it is implemented and naturally, there has been a lot of anticipation for this. While this testnet launch has seen its hiccups, we can hope that they are sorted and the final Dencun upgrade goes off without a hitch."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8yMTMwMDcvY3J5cHRvLWRldmVsb3BlcnMtZHJvcHBlZC0yNC1idWlsZGVycy1sb29rLWJleW9uZC1iaXRjb2luLWV0aGVyZXVt0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMzAwNy9jcnlwdG8tZGV2ZWxvcGVycy1kcm9wcGVkLTI0LWJ1aWxkZXJzLWxvb2stYmV5b25kLWJpdGNvaW4tZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Crypto Developers Dropped 24% in 2023 as Builders Look Beyond Bitcoin, Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the last year, thousands of developers have abandoned crypto—but in several other key metrics, the ecosystem looks as robust as ever.\n\nThat’s according to a new report out Wednesday from crypto venture firm Electric Capital, which says that the number of active, open-source crypto developers has dropped a sharp 24% from the end of 2022 through 2023. As of last month, just over 22,000 developers currently operate in the industry, across myriad blockchains.\n\nThe dropoff was all but certainly thanks to the crypto winter that set in after the $60 billion collapse of cryptocurrencies UST and LUNA in May 2022, and the subsequent collapse of FTX in November of that year, which cratered crypto’s reputation and industry growth.\n\nAD\n\nAD\n\nBut there’s a silver lining in that trend: The overwhelming majority of developers who left the industry in 2023 appear to have been fairweather builders, who had hardly spent any prior time in crypto.\n\nOver 52% of new crypto developers—with one year or less of experience—left the space by December 2023. In contrast, developers with one to two years of experience only dipped by a marginal 1%, and developers with over two years of experience actually grew as a category by the year’s end, up a resounding 33%.\n\nThe geographic diversity of those developers has also grown over time. In 2018, United States-based builders represented 40% of all crypto developers worldwide, according to Electric Capital. By 2023, that figure shrunk to 26%. Meanwhile, the share of crypto developers from non-Western countries in Asia, Africa, and Latin America has comparably ballooned in the same period, from 18% to 36%.\n\nEurope continues to produce the most crypto developers in the world—34% last year.\n\nWhat sorts of blockchains these developers work on has also developed promisingly over the years. As of 2023, 34% of all builders work on multiple chains, a marked increase that speaks to the scope and depth of development across the increasingly multi-chain crypto ecosystem.\n\nAD\n\nAD\n\nEthereum, unsurprisingly, continues to attract the majority of crypto developers; over 8,000 coders consistently contributed to the blockchain last year. But Ethereum scaling network Polygon and rival Solana have also seen a marked uptick in numbers of new contributors.\n\nSlightly below those three networks in new developer activity, but impressive in their own right, are BNB Chain, Cosmos, Arbitrum, Polkadot, NEAR, Avalanche, Optimism, and Internet Computer—each of which attracted between 2,000 and 4,000 new developers in 2023.\n\nThe fastest growing new crypto ecosystem of 2023 was Base: Coinbase’s Ethereum layer-2 network, which took the industry by storm after its launch in August. 999 unique developers contributed to Base over the last three months of 2023.\n\nBitcoin, meanwhile, despite its status as the original blockchain, is no longer the coolest kid at the party. Where once the network could brag, way back in 2015, that it attracted more new developers than any other blockchain—17%—by last year that figure shrunk to a measly 2%.\n\nThe Bitcoin ecosystem is now maintained by a core group of just over 1,000 developers. But some of those builders may be busier than others.\n\nAccording to Electric Capital’s report, less than 10% of Bitcoin developers work on Ordinals, digital assets inscribed in tiny denominations of BTC that are akin to NFTs. Despite that relatively low figure, Ordinals, which were a runaway phenomenon in 2023, have routinely accounted for over 50% of transaction traffic on the Bitcoin network.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZGVjcnlwdC5jby8yMTMyMDgvZXRoZXJldW0tZGVuY3VuLXVwZ3JhZGUtbGl2ZS10ZXN0bmV00gFEaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMzIwOC9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1saXZlLXRlc3RuZXQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Moves One Step Closer Toward Major Scalability Upgrade - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s Dencun upgrade went live on a testnet today in the decentralized network’s latest advancement.\n\nDencun was launched Wednesday on the Goerli test network—a way for developers to try out the upgrade before it becomes available to everyone on the mainnet.\n\nAlthough the test seemed to get off to a bumpy start, with Ethereum core developer Parithosh Jayanthi announcing on X (formerly known as Twitter) that developers were “debugging a client issue,” all seemed to go according to plan, with the “chain finalizing.”\n\nAD\n\nAD\n\nThe testnet launch today means Ethereum is one step closer to completing its upgrade. When fully live, Dencun will mean Ethereum—the blockchain behind ETH, the second-biggest cryptocurrency by market cap—will have addressed its scalability issues.\n\nThe goerli fork finalized! 😀https://t.co/LIa3d4Ml5H After the fix was patched in, the validators came back online and the chain started finalizing again. The MEV circuitbreaker automatically disables and mev-blocks have started flowing through as well. Yay client diversity! https://t.co/cLz3ZRxnXq — parithosh | 🐼👉👈🐼 (@parithosh_j) January 17, 2024\n\nIt will do this via its proto-danksharding (also known as EIP-4844) feature. Proto-danksharking will allow the network to scale and more cheaply handle over 100,000 transactions per second, according to developers, via Ethereum Layer 2 solutions.\n\nEthereum layer-2 solutions, like Optimism, are where most of Ethereum’s activity takes place, a report by market intelligence firm Messari said in October.\n\nProto-danksharking is the most talked about feature of the upgrade because Ethereum has long struggled with scalability; compared to other blockchains, it is slow and costly to do things on Ethereum, such as minting NFTs or sending ETH.\n\nAD\n\nAD\n\nDevelopers working on the new feature hope to solve this. “Danksharding is how Ethereum becomes a truly scalable blockchain, but there are several protocol upgrades required to get there. Proto-Danksharding is an intermediate step along the way,” developers explain on the Ethereum website.\n\n“Both aim to make transactions on Layer 2 as cheap as possible for users and should scale Ethereum to >100,000 transactions per second.”\n\nThe Dencun upgrade will be an Ethereum hard fork—when validators on the network have to upgrade to the newest software in order to keep participating. There have been various similar upgrades to the network in the past, most recently 2022’s “merge”, when the network moved from proof of work to proof of stake."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1oaXRzLXNuYWdzLWZpcnN0LXRlc3RuZXQtb3V0aW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Q1 Release at Risk? Ethereum Dencun Upgrade Hits Snags in First Testnet Outing - DailyCoin",
        "content": "Ethereum’s Dencun upgrade has gone live on the Goerli testnet.\n\nDespite preparations, the testnet launch has not gone as many hoped.\n\nThe timeline for when issues would be resolved remains unclear.\n\nThe long-anticipated Ethereum Dencun upgrade is now coming into full view. In line with timelines released in December 2023, developers have launched the upgrade on the Goerli testnet, the soon-to-be-phased-out Ethereum sandbox for staking infrastructure and other protocol-level changes.\n\nDespite months of preparation, however, the upgrade’s first testnet outing faced several roadblocks amid underwhelming participation.\n\nEthereum Dencun Upgrade Off To a Rough Start\n\nThe Dencun upgrade was released on the Goerli testnet around 6:32 UTC on January 17, as promised by developers in December 2023. The upgrade, however, did not get off to the start many would have hoped.\n\nEthereum Foundation protocol support member Tim Beiko reported that the upgrade failed to achieve finality, likely culminating in a chain split. Finality is assurance that crypto transactions cannot be reversed once executed.\n\nDevelopers linked the challenges faced in the upgrade’s first outing to low network participation as more validators failed to upgrade their clients. Ethereum developer Terence Tsao pointed out the lack of sufficient participation ahead of the Goerli fork, predicting that finality could be lost as participation was estimated to be around 80%. For context, finality will likely be lost with 10% of validators offline.\n\nBack to the Drawing Board?\n\nEthereum Foundation’s Beiko has noted that developers are investigating the hurdles faced during the Goerli fork. However, it remains to be seen when these issues will be resolved.\n\n“Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates!,” he wrote.\n\nDevelopers still have to test out the Dencun upgrade on two more testnets, Sepolia and Holesky, before they can launch it on the mainnet. While the initial timeline had indicated that a Q1 launch of the upgrade was likely, it remains to be seen how recent snafus will affect these projections.\n\nThe most anticipated feature of the upgrade is EIP-4844, also known as proto-danksharding, which promises to make fees cheaper on Ethereum Layer 2 chains by reducing the cost of storing data on the network with blobs.\n\nOn the Flipside\n\nDevelopers had allocated a minimum of a week to test Dencun on each testnet.\n\nThe upgrade had gone smoothly during the shadow forks of Goerli.\n\nThe Dencun upgrade will be the last upgrade Goerli will see before it is phased out in favor of Holesky.\n\nThe full danksharding vision tipped to address Ethereum’s scalability concerns is still years away.\n\nWhy This Matters\n\nRecent hiccups during the Goerli fork may adversely affect Dencun mainnet launch projections.\n\nRead this for more on the Dencun upgrade:\n\nETH Devs Set Tentative Dencun Launch Dates for Key Testnets\n\n\n\nLearn more about Ethereum’s growing dominance against Bitcoin:\n\nStrong Ethereum Fundamentals Fuel 20%+ Surge Against Bitcoin"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2hvdy10by1idXktZXRoZXJldW0taW4tMjAyNC13aXRoLWEtY2FyZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "How to Buy Ethereum in 2024 with a Card - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "As we navigate through 2024, Ethereum (ETH) remains a key player in the digital currency market. This article aims to shed light on how to purchase ETH using a card this year. We’ll explore what Ethereum is and its potential as an investment in 2024. The guide will then walk you through the practical steps of buying Ethereum, making it a valuable resource for both new and experienced investors in the cryptocurrency realm.\n\nWhat is Ethereum (ETH)?\n\nEthereum, commonly referred to as ETH, is a decentralized, open-source blockchain system. It is known for its native cryptocurrency, Ether (ETH), and its ability to support smart contracts and decentralized applications (dApps). Ethereum’s blockchain is highly versatile and has been at the forefront of the blockchain revolution, offering a platform where developers can build and deploy various decentralized applications beyond just simple transactions.\n\nIs Ethereum a Good Investment in 2024?\n\nEthereum has been a hot topic in the investment world, and many wonder if it’s a smart choice to invest in it in 2024. Let’s break this down in simple terms.\n\nFirst, think of Ethereum like a big digital building where lots of different apps and projects are made. Since more people are getting into digital currencies and apps, Ethereum might become even more popular. This is good news for its value.\n\nRemember how Ethereum made big changes in 2022 to use way less energy? That’s just one example of how it keeps getting better. It’s always updating to stay ahead, which can make it more valuable over time.\n\nEthereum is also like a favorite tool for people who create digital apps and projects. It’s got a lot of things built on it, from games to digital art, and even its own kind of digital money. It’s much bigger in this space than most of its competition.\n\nBecause Ethereum is used for so many projects, it’s more than just digital money – it’s a key part of the digital world. This doesn’t always make its price go up right away, but it shows that it’s really important and useful.\n\nSo, is Ethereum a good investment in 2024? While it’s true that prices can go up and down a lot, Ethereum looks like it could do well in the long run. It’s got a solid place in the digital world, it’s always improving, and a lot of people and projects depend on it.\n\nWhere to Buy ETH in 2024?\n\nBitget stands out in the crowded field of cryptocurrency brokers for several compelling reasons. Renowned for offering some of the lowest fees in the market, Bitget makes trading more cost-effective, ensuring that your investment goes further. Additionally, the platform’s user-friendly interface simplifies the trading process, making it accessible for both beginners and experienced traders alike.\n\n—> CLICK HERE TO OPEN AN ACCOUNT WITH BITGET <—\n\nHow to Buy ETH in 2024?\n\nNow that you know why we like Bitget, here’s a simple step-by-step guide on how to do so. If you’re just starting your crypto journey, start from the first steps. However, if you already have an account with Bitget, jump to step 3.\n\nSet Up Your Bitget Account\n\nBegin by creating a Bitget account. Go to this link and sign up using your email or your mobile number.\n\nComplete Your Identity Verification\n\nTo comply with regulatory standards and enhance your trading experience, complete Bitget’s identity verification process. This involves selecting your country, uploading identification documents, and submitting a selfie. Once verified, you’ll receive a notification, and you’re ready to proceed.\n\nBuy ETH with a Card\n\nEasily link your Visa or Mastercard by selecting the Credit/Debit card option in the Buy Crypto tab. Follow the screenshots below to replace USDT with ETH, add a new card and complete your transaction with zero fees.\n\nMore on Bitget:\n\nMore from Ethereum"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvLm5ld3MvMTBtLWluLWV0aGVyZXVtLWJ1cm5lZC1kZWNlbnRyYWxhbmQtYW5kLWJvcnJvZS1maW5hbmNlLWJ1bGxpc2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "$10m in Ethereum burned; Decentraland and Borroe Finance bullish - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum made headlines by burning $10 million of its cryptocurrency, ETH. This move, a step towards altering the currency’s economic model, adds another layer of complexity to the ever-changing world of digital assets.\n\nAs Ethereum burns more coins, other players like Decentraland and Borroe Finance (ROE) are riding the momentum, carving their paths in the dynamic cryptocurrency scene.\n\nEthereum’s $10 million blaze\n\nEthereum’s burning of $10 million in ETH stems from EIP 1559, a significant upgrade that overhauled Ethereum’s fee structure. This burning event is not just a stunt; it’s a calculated step to redirect Ethereum’s economic direction.\n\nThe burning mechanism permanently removes a portion of ETH from circulation. It offsets the ongoing issuance, potentially pushing Ethereum toward a deflationary state.\n\nDecentraland on the rise\n\nDecentraland, a metaverse where users can acquire, develop, and construct on virtual land, is reshaping the notion of digital ownership.\n\nThe recent rise in demand for virtual real estate establishes Decentraland as a pioneer in the metaverse realm, resonating with the crypto community’s spirit.\n\nBorroe Finance on Polygon\n\nAmid the cryptocurrency boom, Borroe Finance remains innovative and efficient on Polygon.\n\nLeveraging the power of CrossFi and Liquidity Pools, Borroe Finance redefines the user experience in decentralized finance (defi).\n\nYou might also like: Borroe Finance presale sparks optimism amid Litecoin and Aptos downturn\n\nCrossFi, a cross-functional financial platform, and Liquidity Pools enhance user experience, reflecting Borroe Finance’s commitment to efficiency and seamless functionality.\n\nBorroe Finance is not merely riding the current market wave but orchestrating a symphony of success.\n\nIn stage 3 of the ongoing presale, Borroe Finance has successfully sold over 219 million ROE, raising over $2.5 million.\n\nPresently, ROE is available for $0.0190.\n\nConclusion\n\nAs Ethereum sets ablaze with innovation, Decentraland constructs its digital paradise, and Borroe Finance charts its course on Polygon, the cryptocurrency world is a vibrant canvas with groundbreaking ideas and rising trends. As crypto recovers and sentiment changes, defi could rise even higher.\n\nRead more: Borroe Finance presale sparks optimism amid Litecoin and Aptos downturn\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZGV2ZWxvcGVyLWhhaWxzLWV0aC1idXJuaW5nLXdpbGwtZXRoZXJldW0tYnJlYWstMzAwMC_SAV9odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2RldmVsb3Blci1oYWlscy1ldGgtYnVybmluZy13aWxsLWV0aGVyZXVtLWJyZWFrLTMwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Developer Hails ETH Burning, Will Ethereum Break $3,000? - NewsBTC",
        "content": "Péter Szilágyi, an Ethereum (ETH) developer, has lauded EIP-1559 and its ETH burning mechanism as “the great equalizer.” Taking to X on January 16, Szilágyi admired EIP-1559’s ability to “level the playing field between validators and regular users.”\n\nDeveloper: EIP-1559 Is A “Great Equalizer”\n\nSince the implementation of EIP-1559, Ethereum adjusted how users bid gas fees, introducing the “base fee,” which was burned or sent to an irretrievable wallet. So far, data from Ultrasound Money shows that over 3.9 million ETH have been destroyed.\n\nIn the last week alone, the Ethereum network automatically sent more than 21,100 ETH out of circulation, “burning” ETH’s supply.\n\nSpecifically, Szilágyi mentioned the advantage regular users have with EIP-1559. Through this implementation, validators (previously miners before Ethereum shifted to a proof-of-stake blockchain) no longer have the privilege of arbitrarily adjusting gas limits and transaction fees.\n\nEarlier, that leeway created what the developer described as an “imbalance,” which made it tough for “regular users to compete.” However, following this implementation, everyone must adhere regardless of status as a validator, founder, or user.\n\nWith EIP-1559, the “base fee” adjustment is set at the protocol level. It is this base fee that the network burns, gradually making ETH deflationary, reading from the number of coins taken out of circulation since EIP-1559 went live in early August 2021. Even so, a sender can “tip” the validator, incentivizing them to prioritize validating a transaction.\n\nStability And Predictability Achieved, Ethereum Upsides Capped At $3,000\n\nSzilágyi’s comments reflect a growing consensus among Ethereum supporters regarding the positive impact of EIP-1559. Though a big percentage of EIP-1559 is fixated on the price impact of the proposal, there is more that it achieves.\n\nMost importantly, from a user experience perspective, it is now easier for senders to predict how much they will pay for a transaction. This is crucial, especially when the network is congested. Additionally, though the Ethereum gas fee remains relatively high, EIP-1559, though considered a “bad idea” by Szilágyi, has stabilized the network.\n\nETH burning is attributed to reducing inflation in Ethereum, a network whose total supply is not capped like Bitcoin. Over the long term, prices might benefit from this proposal. However, prices are bullish in the short to medium term. Still, upsides are limited to around the $3,000 psychological round number.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9yaXBwbGUtY3RvLWV4cG9zZXMteHJwLWFuZC1ldGhlcmV1bS1ldGgtZ2VuZXNpcy1ibG9jay1zZWNyZXRz0gFRaHR0cHM6Ly91LnRvZGF5L3JpcHBsZS1jdG8tZXhwb3Nlcy14cnAtYW5kLWV0aGVyZXVtLWV0aC1nZW5lc2lzLWJsb2NrLXNlY3JldHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ripple CTO Exposes XRP and Ethereum (ETH) Genesis Block Secrets - U.Today",
        "content": "In a recent revelation, David Schwartz, the Chief Technology Officer (CTO) at Ripple and one of the key architects behind XRP Ledger, disclosed an intriguing insight into the genesis block secrets of Ethereum (ETH). The discussion unfolded when a curious crypto enthusiast probed Schwartz about the peculiar genesis block numbering in XRPL.\n\nAdvertisement\n\nThe question pointed to a historical mishap that resulted in the loss of ledgers 1 through 32,569 in XRPL, creating an unconventional void in recorded data. Schwartz responded by asserting that the choice of considering a particular block as the genesis block is arbitrary, drawing parallels to Ethereum's own genesis block.\n\nTo illustrate his point, Schwartz shared a link to an August 2016 transaction moving a substantial 2,622.1 ETH, currently valued at $6.68 million. He questioned the origins of the ETH and emphasized that Ethereum's genesis block, much like XRPL's, had undisclosed transactions that determined the allocation of funds.\n\nSomeone decided to define the genesis of the ETH chain to be before that transaction but after the transaction that explained why 40,000 ETH went to that address. So you cannot publicly see the source of that ETH unless you know where to look for it. — David \"JoelKatz\" Schwartz (@JoelKatz) January 16, 2024\n\nAs the discussion unfolded, Schwartz delved into the intricacies of Ethereum's genesis block, revealing that certain transactions were deliberately excluded from the public blockchain. He suggested that decisions were made to obscure the source of funds, showcasing the arbitrary nature of defining a blockchain's genesis.\n\nWhat's with XRP?\n\nThe conversation further explored the absence of transactions in XRPL's genesis block, leaving 534 transactions in the first 32,570 ledgers presumed lost. Notably, the breakdown of XRP distribution at ledger 32,570 revealed specific ownership percentages, with individuals like Jed McCaleb, Chris Larssen, Arthur Britto and entities like OpenCoin holding precise and publicly known shares.\n\nEffectively, XRPL has a genesis block with balances in it just as ETH does, but a big difference is that the ownership of all but about .01% of those balances for XRPL is precisely and publicly known:\n\nJed: 9 %\n\nChris: 9 %\n\nArthur: 2 %\n\nOpenCoin: 79.99 %\n\nBeta testers and developers:… — David \"JoelKatz\" Schwartz (@JoelKatz) January 16, 2024\n\nThis revelation not only sheds light on the mysterious genesis blocks of both XRPL and Ethereum but also raises questions about the transparency and decision-making processes within blockchain ecosystems."
    }
]