[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1idWxscy1zaWdodC1oaWdoLTIwMjQv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLWJ1bGxzLXNpZ2h0LWhpZ2gtMjAyNC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Bulls Sight New High In 2024 As BTC Pumps Above $45K - NewsBTC",
        "content": "Ethereum price is eyeing an upside break above the $2,440 resistance. ETH could rally like Bitcoin if there is a close above the $2,500 level.\n\nEthereum is moving higher from the $2,250 support level.\n\nThe price is trading above $2,350 and the 100-hourly Simple Moving Average.\n\nThere was a break above a major bearish trend line with resistance near $2,300 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could accelerate higher if there is a clear move above $2,400 and $2,440.\n\nEthereum Price Eyes Key Upside Break\n\nEthereum price found support near the $2,250 level and recently started a fresh increase. ETH managed to recover after Bitcoin pumped above the $44,400 resistance zone.\n\nThe price cleared the $2,300 and $2,320 resistance levels. There was also a break above a major bearish trend line with resistance near $2,300 on the hourly chart of ETH/USD. The pair climbed above the 61.8% Fib retracement level of the downward move from the $2,445 swing high to the $2,258 low.\n\nBitcoin is now trading above $2,350 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,400 level. It is close to the 76.4% Fib retracement level of the downward move from the $2,445 swing high to the $2,258 low.\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is now near $2,445. A close above the $2,445 resistance could send the price toward $2,500. The next key resistance is near $2,550. If the bulls remain in action and push ETH above $2,550, there could be a drift toward $2,620. The next resistance sits at $2,650, above which Ethereum might rally and test the $2,800 zone.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,400 resistance, it could start another decline. Initial support on the downside is near the $2,350 level.\n\nThe first key support could be the $2,320 zone. A downside break and a close below $2,320 might start another major decline. In the stated case, Ether could test the $2,250 support. Any more losses might send the price toward the $2,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,320\n\nMajor Resistance Level – $2,400\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tbG9vay10by10aGUtdXBzaWRlLTEzOTk1ODbSAWRodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tY29udGludWVzLXRvLWxvb2stdG8tdGhlLXVwc2lkZS8xMzk5NTg2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Look to The Upside - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZXRoLXN1cnByaXNpbmctbmV4dC1rZXktcHJpY2UtdGFyZ2V0cy1oaW50ZWQtYnktdGhpcy1pbmRpY2F0b3LSAVxodHRwczovL3UudG9kYXkvZXRoZXJldW1zLWV0aC1zdXJwcmlzaW5nLW5leHQta2V5LXByaWNlLXRhcmdldHMtaGludGVkLWJ5LXRoaXMtaW5kaWNhdG9yP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's (ETH) Surprising Next Key Price Targets Hinted by This Indicator - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs 2024 kicks off on a bullish note, crypto analyst Ali hints at the next key price targets for Ethereum based on the indicator \"MVRV Pricing Bands.\"\n\nAdvertisement\n\nAccording to Ali, the next key price targets for $ETH are $3,830 and $5,100, based on the MVRV pricing bands. At current Ethereum prices, these targets represent 58% and 110% increases, respectively.\n\nIn a tweet on the first day of the year, Ali hinted that Ethereum might be poised for further gains. The reason he cited is that Ethereum faces no major barriers ahead.\n\n#Ethereum looks set for further gains!\n\n\n\nThe path ahead of $ETH is clear, with no significant supply barriers in sight, suggesting a potential rise to $2,700 or beyond. Additionally, a robust demand wall at $2,000 provides solid support, potentially cushioning any corrections. pic.twitter.com/s79YAlkS8w — Ali (@ali_charts) January 1, 2024\n\nAli noted that the path ahead for ETH seems clear, with no significant supply barriers in sight. This might suggest a potential rise to $2,700 or beyond, he added. A strong demand wall at $2,000, on the other hand, provides steady support, potentially cushioning any corrections.\n\nAt the time of writing, ETH had risen 6% in the previous 24 hours to $2,425, paralleling Bitcoin's ascent beyond $45,000.\n\nBitcoin topped $45,000 for the first time in nearly two years as investors awaited the approval of an exchange-traded fund that would invest directly in the largest cryptocurrency.\n\nFear of missing out among certain traders in the United States and Europe in the run-up to the approval may have sparked bullish bets in favor of crypto assets such as Ethereum.\n\nWhat's next?\n\nGoing forward, on the path to the aforementioned targets of $3,830 and $5,100, the Ethereum price may take some key intermediate steps. The initial goal would be to reach the $3,000 price level.\n\n\n\nOn the upside, a break and close above the Dec. 28 high of $2,448 may indicate that the bulls have not given up. If this is achieved, buyers will attempt to push the price above $2,700 once more, kicking off a new uptrend toward $3,000.\n\nOn the other hand, if bears make a comeback, Ethereum might find sturdy support at the daily MA 50 at $2,185. If the declines continue, the $2,148 low may be reached."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW1zLW5ldGZsb3ctY29udGludWVzLXRvLXN1cmdlLWFzLXNob3J0LXRlcm0taG9sZGVycy1leGl0LXdpbGwtZXRoLXByaWNlLWhvbGQtYnVsbGlzaC1tb21lbnR1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Netflow Continues To Surge As Short-Term Holders Exit! Will ETH Price Hold Bullish Momentum? - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nThe new year sparked a rise in crypto buying sentiment, pushing the total market cap up by over 5% to $1.84 trillion, a level last seen in May 2022. This surge helped both BTC and ETH prices break through key resistance levels. Yet, there’s a risk of correction. On-chain data suggests that short-term buyers, currently sitting on high profits, might sell off at these higher levels, potentially creating selling pressure.\n\nEthereum’s Netflow Continues Its Surge\n\nAfter hovering around a bearish consolidation range, Ethereum’s price finally achieved a breakthrough, surpassing the closely watched $2,400 level. This upward movement resulted in a total liquidation of $25.8 million, with sellers offloading more than $16.4 million in positions.\n\nYet, as Ethereum’s price rally paused above $2,430, a decrease in buying momentum was observed. This shift occurred as short-term buyers cashed in their positions, aiming to book maximum gains on the recent surge. Data from Coinglass indicates that approximately $9.4 million in long positions were liquidated during this period.\n\nThe potential for bearish momentum is growing, as indicated by a consistent rise in Netflow over the past week, based on data from IntoTheBlock. Following a dip to -111K ETH on December 26, there has been a notable shift with more Ethereum being moved to exchanges, as inflows began to exceed outflows.\n\nConsequently, Netflow has moved into positive territory, currently at 45.5K ETH, following a boost in buyer confidence in ETH’s price. Typically, a rising Netflow signals bearishness, suggesting that the increased inflow of an asset to exchanges often signals its sale at or near market peaks.\n\nThe hourly long/short ratio is showing a bearish trend, having fallen below the 1.0 threshold and currently trading at 0.8769. This indicates that bears are in control, with approximately 53.2% of positions anticipating a decline in value. In contrast, only 46.7% of positions are expecting a price increase in ETH.\n\nWhat’s Next For ETH Price?\n\nEther faced a rejection at $2,433 recently and is aiming to correct its price in the coming hours, indicating that bears are exerting pressure at higher levels. As of writing, ETH price trades at $2,370, surging over 2.9% from yesterday’s rate.\n\nOn the bullish side, the price has managed to stay above the 20-day Exponential Moving Average (EMA) at $2,333, bringing some hope. However, there’s a risk of increased selling if buyers fail to drive the price above the $2,500 soon.\n\nShould the 20-day EMA be breached, ETH price could decline towards the ascending support line at $2,250.\n\nConversely, a successful break and close above the channel would signal that bulls are still in the game. In this scenario, buyers might attempt to push the price beyond $2,433-$2,500, aiming for an uptrend towards the $3,000 mark. With the RSI level now stabilizing, we might see a strong rebound from the EMA20 trend line."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9rZXktZWxlbWVudHMtdG8td2F0Y2gtb24tZXRoZXJldW0tbmV0d29yay1yb2FkbWFw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Key elements to watch on the Ethereum network roadmap - Cointelegraph",
        "content": "On Dec. 30, 2023, Ethereum co-founder Vitalik Buterin shared the Ethereum roadmap for 2024, pointing out that there are only a handful of minor adjustments compared to last year.\n\nIn a thread on the X social network, Buterin detailed in a series of charts and diagrams revealing that the continued focus for Ethereum in 2024 is on six main components – the Merge, the Surge, the Scourge, the Verge, the Purge and the Splurge.\n\nHere was the one from last year. Notice that it's actually quite similar! As Ethereum's technical path forward continues to solidify, there are relatively few changes. I'll go through the important ones.https://t.co/F1MpfNdfa7 — vitalik.eth (@VitalikButerin) December 30, 2023\n\nThe Merge was highlighted as a key section on the roadmap, aiming to maintain a simple and resilient proof-of-stake (PoS) consensus. It took place in September 2022 integrating the Ethereum mainnet with the PoS blockchain the Beacon Chain.\n\nThe Surge targets 100,000 transactions per second across Ethereum and layer 2 networks and aims to enhance the blockchain’s scalability.\n\nThe Scourge focuses on mitigating risks related to Maximal extractable value (MEV) and liquid pooling, addressing concerns about economic centralization within the Ethereum ecosystem.\n\nButerin also endorsed single-slot finality (SSF) as a crucial solution for Ethereum’s current weaknesses and praised advancements in layer 2 networks and Verkle tree implementations. Finality aims to ensure that changes to a blockchain block are irreversible without burning at least 33% of the total staked Ether (ETH).\n\nSignificant progress on the Surge (rollup scaling) this year, both on EIP-4844 and from rollups themselves.https://t.co/uEjd2VETQU continues to be a good page to follow.\n\n\n\nAlso, cross-rollup standards and interop has been highlighted as an area for long-term improvements. pic.twitter.com/ixUsZEo7pi — vitalik.eth (@VitalikButerin) December 30, 2023\n\nThe Purge seeks to make the protocol easy to use, and the Verge aims to facilitate easier block verification while the Splurge encompasses all other elements crucial for Ethereum’s growth.\n\nEthereum improvement proposals (EIPs) to look out for\n\nEarlier on Oct. 21, 2023, the Ethereum All Core Developers meeting provided some tentative dates on the upgrade schedule for the next mainnet hard fork, Dencun.\n\nThis was revealed in a series of posts on X by Ethereum Developer Tim Beiko who revealed that “if no major issues arise”, the forking of Ethereum’s public testnets is scheduled for Jan. 17 for Goerly, Jan. 30 for Sepolia and Jan. Feb. 7 for Holesky.\n\nSo, if no major issues arise, we're looking at the following schedule:\n\n\n\n- Goerli: Jan 17, 6:32:00 UTC\n\n- Sepolia: Jan 30, 22:51:12 UTC\n\n- Holesky: Feb 7, 11:34:24 UTC\n\n\n\n... and then, mainnet pic.twitter.com/JFRt0ZHAi8 — timbeiko.eth ☀️ (@TimBeiko) December 21, 2023\n\nThis will be the last time that Goerli is included in the testing regimen, as the network is slated for deprecation, meaning client developers will no longer maintain it.\n\nThis move is part of the strategy to activate ‘Dencun’ on the Ethereum network in January 2024, marking a significant advancement in its technological capabilities.\n\nDencun is particularly expected to increase data availability for layer 2 rollups through EIP-4844 – Proto-Danksharding – resulting in a reduction of rollup transaction costs, which will be passed on to end-users.\n\nAlso key among the improvements on the Ethereum network are account abstraction: ERC-4337 and its extension, ERC-6900. It centers on the concept of smart accounts, which holds significant implications for end-user experience and will enable reduced transaction costs and secure social logins.\n\nThe top upcoming #Ethereum improvements for 2024:\n\n\n\n1. EIP-4844 (Proto-Danksharding): This major proposal aims to reduce data availability costs across all layer-2 solutions, potentially slashing rollups gas fees by up to 100x.\n\n\n\n2. ERC-4337 (Account Abstraction): This standard,… — ∆mir (@hey1994amir) January 2, 2024\n\nEIP-1153 (Transient Storage Opcodes) and EIP-6780 (Restrict Self Destruct) are expected to reduce gas costs and enhance the network’s scalability and stability.\n\nRelated: Vitalik Buterin reveals Ethereum game plan for 2024\n\nUpcoming Dencun upgrade could make Ethereum more competitive\n\nThere are narratives that Ethereum’s rivals are gaining relevance as critics argue that the ecosystem has failed due to its limited capacity for scaling and privacy solutions at the base layer level.\n\nThese negative conversations have been backed by the recent performance by Solana (SOL), Injective (INJ) and Avalanche (AVAX) which have gained 863%, 2,820% and 270%, respectively, over the last year against Ether’s 94%, according to data from CoinMarketCap.\n\nJames do you think EIP-4844 upgrade to Eth helps Ethereum to keep some of its dominance or is Eth just losing out to Solana over time — Brad (@BradMiles1) December 16, 2023\n\nOne of the key metrics determining the efficiency of a blockchain network depends on how affordable it is for users to process transactions. Transaction fees take into account the amount of computing power needed to process a transaction, known as gas, which also has a variable price measured in the native currency of the protocol and is directly related to network traffic.\n\nAccording to a January 2023 report by BitfinityNetwork, the average cost per transaction on the Ethereum network is 33.5 Gwei, which is higher than the 5 Gwei for the BNB Chain.\n\nLayer 1 transaction fees comparison. Source: Bitfinity Network\n\nOther blockchains such as Algorand (ALGO) and the Internet Computer (ICP) offer a negligible fixed fee that depends on the value of their token (0.001 ALGO and 0.0001 ICP, respectively), while using Polkadot costs nothing.\n\nHowever, when it comes to Ethereum layer 2 solutions, the Ethereum network is unmatched with respect to DApps’ engagement backed by the dominance of the Ethereum Virtual Machine (EVM).\n\nData from DAppRaddar ranks Ethereum highest in terms of DApp volumes ahead of BNB Chain, Solana and Avalanche.\n\nBlockchains ranked by 7-day DApps volumes, USD. Source: DappRadar\n\nApart from its absolute layer 1 dominance, the Ethereum network has posted a 16% growth in NFT volumes over the past 7 days, distancing itself from BNB Chain and Solana which are negative.\n\nMoreover, the Ethereum network's total value locked (TVL) of $53.32 billion invalidates much of the negative assessment. In comparison, BNB Chain holds a mere $2.54 billion TVL, while Solana's latest data stands at $1.47 billion, according to DappRadar.\n\nWith the Dencun upgrade expected to make a significant reduction in transaction costs, Ethereum is slated to become even more competitive asserting its dominance over its rivals.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hLWZsaXBzLWV0aGVyZXVtLWluLTctZGF5LXN0YWJsZWNvaW4tdm9sdW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana flips Ethereum in 7-day stablecoin volume - crypto.news",
        "content": "Blockchain users transacted $100 billion in stablecoin volume on Solana for the first time.\n\nOnce hailed as a so-called “Ethereum killer”, Solana has flipped crypto’s largest altcoin blockchain in stablecoin transaction value over seven days. The difference in volume between Solana and Ethereum was over $13 billion, according to Artemix.xyz.\n\nStablecoin volumes across major blockchains | Source: Artemis.xyz\n\nThis landmark for Solana (SOL) followed a flurry of activities on its blockchain ranging from an inscriptions craze to memecoin mania with some traders turning a few bucks into six-figure hauls. Airdrops like Jito also attracted thousands of users to SOL’s blockchain.\n\nThe interest in Solana directly impacted SOL as the crypto returned to prices not seen since Terra’s collapse in 2022. SOL gained 1,000% last year, and the digital asset traded above $110 when this report was written.\n\nYou might also like: Trader earns $5.7m after investing 30 SOL\n\nAs interest and significant price appreciation occurred, on-chain trading followed suit as crypto.news reported. Decentralized exchanges (DEX) on Solana recorded over $28 billion in volume during December alone. The blockchain also set new highs for monthly active addresses, with SOL’s market cap surpassing $50 billion.\n\nThis surge allowed SOL to leapfrog Ripple’s XRP token as the fifth-largest cryptocurrency on the market. At press time, Solana was on the heels of Binance’s BNB coin and even boasted greater 24-hour trading volume per Coingecko.\n\nWith upcoming token airdrops, more rewards for SOL participants may be on the way. Jupiter, a rising DEX on Solana, is scheduled to launch its native digital currency in January.\n\nTop 5 blockchains by market cap | Source: Coingecko\n\nFollow Us on Google News"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8wMi9ldGhlcmV1bS1jaGFpbmxpbmstYW5kLWFyYml0cnVtLWFyZS1hbW9uZy10b3AtNS1hbHRjb2luLXBsYXlzLWZvci10aGlzLXllYXItYWNjb3JkaW5nLXRvLW1pY2hhZWwtdmFuLWRlLXBvcHBlL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8wMi9ldGhlcmV1bS1jaGFpbmxpbmstYW5kLWFyYml0cnVtLWFyZS1hbW9uZy10b3AtNS1hbHRjb2luLXBsYXlzLWZvci10aGlzLXllYXItYWNjb3JkaW5nLXRvLW1pY2hhZWwtdmFuLWRlLXBvcHBlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Chainlink and Arbitrum Are Among Top 5 Altcoin Plays for This Year, According to Michaël van de Poppe - The Daily Hodl",
        "content": "Closely followed crypto strategist and trader Michaël van de Poppe is naming the top five altcoins he is bullish on in 2024.\n\nIn a new strategy video, Van de Poppe tells his 162,000 YouTube subscribers that his first top altcoin choice this year is the smart contract platform Ethereum (ETH).\n\nThe trader believes that money will soon flow from Bitcoin to ETH after BTC‘s significant rally to close out 2023.\n\nLooking at his chart, the trader suggests that ETH will rally to cross $3,400 later this year.\n\nHe also suggests that ETH against BTC (ETH/BTC) appears to have carved out a market bottom at around 0.0491 BTC ($2,221).\n\nThe ETH/BTC pair is trading for 0.05322 BTC ($2,377) at time of writing.\n\nHe also believes that if a spot market exchange-traded fund (ETF) is approved for Bitcoin, an Ethereum spot market ETF will soon get the nod and that would serve as a catalyst for an ETH rally.\n\nLastly, he suggests that ETH’s deflationary nature, brought about by its switch to a proof-of-stake consensus mechanism, is not yet priced in by the market.\n\nNext up, the trader believes that ETH layer-2 scaling solution Arbitrum (ARB) is printing a bullish pattern against Bitcoin (ARB/BTC), putting in higher highs and higher lows.\n\nARB/BTC is trading for 0.0000393 BTC ($1.78) at time of writing. Looking at his chart, the trader suggests that Arbitrum will soar to 0.0000647 BTC ($2.93).\n\nHis next pick is another layer-2 scaling solution, Optimism (OP). He predicts that OP will correct down to the $2.78 range after its big rally and then bounce beyond the $4.50 level in the coming months.\n\nOptimism is trading for $4.01 at time of writing, up 4.3% in the last 24 hours.\n\nThe fourth altcoin on the trader’s list is the decentralized oracle network Chainlink (LINK).\n\nHe says LINK is starting to show strength against Bitcoin (LINK/BTC), printing a bullish pattern of higher lows and higher highs. He is closely watching to see if LINK/BTC breaks through a key resistance level at 0.000450 BTC ($20.36), which he says would indicate a massive breakout is underway.\n\nLINK/BTC is trading for 0.0003472 BTC ($15.71) at time of writing.\n\nLastly, the trader picks the newer ETH rival Sui (SUI). He says SUI has the potential to perform as strongly as Fantom (FTM), Avalanche (AVAX) and Polygon (MATIC) did in 2021.\n\nAt time of writing, SUI is worth $0.865.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYmxvY2tvbm9taS5jb20vY291bnRkb3duLXRvLWRlbmN1bi11cGdyYWRlLXdpbGwtZXRoZXJldW0tcHJpY2VzLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Countdown to Dencun Upgrade: Will Ethereum Price's Rally? - Blockonomi",
        "content": "Ethereum is in the spotlight as its Dencun upgrade inches close. Will Ethereum break above $3,000?\n\nAccording to Ethereum Foundation Protocol Support Tim Beiko, Ethereum’s next upgrade, Dencun, will be released on January 18. Dencun is set to launch on the Goerli testnet first, with later deployments on the Sepolia and Holesky testnets on January 31 and February 7, 2024, respectively. The mainnet launch is slated for February 2024.\n\nWill this new upgrade makes things better for ETH?\n\nDencun Slated for Q1/2024\n\nDencun was initially expected to launch in late 2023, but concerns about testnet deployment timelines and consensus issues prompted Ethereum’s core developers to delay its implementation. While the event is now slated for early 2024, the team hasn’t finalized the upgrade dates.\n\nThe upgrade will introduce proto-danksharding, or EIP-4844, to boost data storage and improve the efficiency and scalability of rollups using “blobs.” Blobs are essentially chunks of data, much larger than typical Ethereum transactions, that can be attached to blocks. They can hold up to 125 kilobytes of information, compared to the standard transaction size of about 250 bytes.\n\nThe process is expected to positively impact Ethereum’s scaling protocols, such as a drop in transaction fees and network security. Layer 2 solutions have gained significant traction over the past few months due to their cost advantages. However, concerns persist surrounding their security and decentralization. With Dencun, Ethereum seeks to address these challenges within rollups and enhance the performance of bridges and staking protocols.\n\nRecent tests signified widespread acceptance of the Dencun upgrade among Ethereum nodes, with a 99% participation rate. Meanwhile, 95% of data blobs propagated in under two seconds, which suggests that the coming upgrade could result in potential improvements in scalability and network efficiency.\n\nDencun’s impact extends far beyond technical upgrades. It marks a turning point for the Ethereum ecosystem, paving the way for explosive growth and groundbreaking innovation.\n\nEnhanced data storage, streamlined transactions, and boosted scalability unlock new possibilities. These ripples will be felt across the entire community, nurturing an environment where groundbreaking developments can flourish and a more inclusive, robust digital economy takes root.\n\nOn December 31, Ethereum’s creator, Vitalik Buterin, issued the blockchain’s 2024 roadmap. The key highlights are the application of single-slot finality to solve the problems of the proof-of-stake mechanism, Dencun implementation, solutions to miner extractable value (MAV), the centralization of liquid staking, and Ethereum’s design simplification.\n\nIn a post published on December 27, Vitalik suggested three ways to make Ethereum’s proof-of-stake “considerably simpler and lighter.” He proposed reducing validator signatures to 8192, encompassing decentralized staking, two-tiered staking, and rotating validator participation. His proposal aims to ease the system’s technical load while maintaining efficiency, security, and decentralization.\n\nSpot Ethereum ETF Outlook\n\nAlong with the highly anticipated Dencun upgrade, Ethereum enthusiasts eagerly await the US Securities and Exchange Commission’s (SEC) decision on spot Ethereum exchange-traded funds (ETFs). Market observers believe the SEC’s upcoming ruling on spot Bitcoin ETFs, expected by January 10th, could serve as a catalyst for approving spot Ethereum ETFs.\n\nMajor institutions like BlackRock, ARK Invest, VanEck, Fidelity, Invesco, and Grayscale have all filed applications for spot Ethereum ETFs in the US. While no approvals have been granted, the SEC extended its decision deadline for these proposals to May 2024. However, with the outcome of spot Bitcoin ETF filings looming, analysts anticipate a similar one for spot Ethereum ETFs likely to follow.\n\nEthereum is trading at around $2,300 at current prices. There’s growing anticipation in the crypto community about Ethereum’s potential to reach new heights this year in alignment with a series of important events. If an ETF hits the markets in 2024, ETH’s price will likely rise.\n\nNow, we just have to wait and see how the upgrade goes, and what the 2024 crypto market brings."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tZXRoLWZhY2VzLW9uZS1rZXktb2JzdGFjbGUtb24taXRzLXdheS10by0zNTAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Faces One Key Obstacle On Its Way to $3500 - Watcher Guru",
        "content": "The price of Ethereum (ETH) could be well on its way to a breakout, facing off against one ikey obstacle on its ascension to $3500. Since the start of 2024, ETH has been on its way to an increase. Moreover, its weekly and daily Relative Strength Index (RSI) has shown bullish signs.\n\nAltogether Ethereum has seen notable increases since the start of October. JP Morgan has even projected it to perform better throughout 2024 than Bitcoin. Yet, for projections like this to come true, the asset will have to win its upcoming face-off at a critical resistance level.\n\nAlso Read: Shiba Inu, Bitcoin & Ethereum: 3 Boldest Price Predictions For 2024\n\nEthereum Set to Propel Toward $3500\n\nHeading into the new year, excitement within the digital asset sector is at an all-time high. The performance of Bitcoin has led the way to gains mostly across the board. Subsequently, a potential Spot Bitcoin ETF approval in the first week of January could push all assets even higher in price.\n\nAlongside that, Ethereum (ETH) is set to face one crucial obstacle on its way toward the $3500 mark. Currently, the asset is trading at $2364 and is up more than 1.6% over the last 24 hours, according to CoinMarketCap. However, a massive rally could very well be in the cards.\n\nAlso Read: Solana Surpasses Ethereum in Google Searches\n\nSince May of 2022, Ethereum has seen growth alongside a support trend line. Moreover, that line has been validated a host of times since, with the most recent occurrence happening in October of last year. Additionally, BeInCrypto noted that the asset has produced eight candlesticks- a bullish indicator- in just 11 weeks. Currently, it is creating ninth.\n\nUltimately, if the RSI indicator remains above the 50 mark, then the bulls have certainly provided an advantage. Conversely, anything below 50 would show a clear victory for bears. The asset is facing resistance at $2,370, which could lead to a 40% increase that propels it well ahead of the $3,300 mark."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWV0aC1wcmljZS1wb2lzZWQtZm9yLTItM3gtZ2FpbnMtYXMtcGVyLXRoZXNlLW9uLWNoYWluLWluZGljYXRvcnMv0gFjaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tZXRoLXByaWNlLXBvaXNlZC1mb3ItMi0zeC1nYWlucy1hcy1wZXItdGhlc2Utb24tY2hhaW4taW5kaWNhdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Poised for 2-3x Gains As Per These On-Chain Indicators - CoinGape",
        "content": "As the bitcoin (BTC) price jumped 7% shooting past $45,000 in the wake of Bitcoin ETF approval, altcoins too joined the party. The Ethereum (ETH) price is up once again by 2% in the last 24 hours, moving closer to $2,400.\n\nOn-chain indicators for Ethereum continue to show strength, suggesting a much larger rally ahead from here onwards. Predictions are already strong that the ETH price can rally all the way to $10,000 by this year’s end.\n\nadvertisement\n\nEthereum (ETH) On-Chain Indicators\n\nIn a recent market analysis, renowned crypto analyst Ali Martinez expressed a bullish outlook for Ethereum (ETH). Martinez highlighted a promising path ahead for Ethereum, emphasizing the absence of significant supply barriers, which could pave the way for potential gains to $2,700 or beyond.\n\nAdditionally, the analysis pointed out a robust demand wall at $2,000, indicating substantial support that may act as a cushion in the event of corrections. The positive forecast aligns with the current market dynamics, reflecting optimism regarding Ethereum’s price trajectory in the near term.\n\nIn insights shared by crypto analyst Ali Martinez, the Ethereum MVRV Pricing Bands indicate pivotal price targets for the cryptocurrency. Martinez pointed out that, according to the data, the next significant price targets for Ethereum ($ETH) are identified at $3,830 and $5,100. This analysis provides valuable guidance for investors and market participants, shedding light on potential future price movements in the Ethereum market.\n\nETH Exchange Supply Falling Sharply\n\nAnother positive indicator for Ethereum is the sharp drop in the exchange supply. Data from Santiment reveals that the supply of ETH tokens on exchanges has reached an unprecedented all-time low since the inception of Ether.\n\nAs of the latest data, Ethereum’s supply on exchanges represents only 8.04% of the total ETH supply. This marks the lowest level recorded since the cryptocurrency’s genesis. The on-exchange supply of an altcoin like ETH often plays a crucial role in influencing its market price. A decrease in the supply is generally perceived as a bullish indicator, suggesting a potential reduction in selling pressure on ETH.\n\nEthereum co-founder Vitalik Buterin recently shared a roadmap that seeks to improve the efficiency of the PoS system."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2tzdGVyLmNvbS8xMC1yZWFzb25zLXdoeS1ldGhlcmV1bS13aWxsLXN1cmdlLWluLTIwMjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "10 Reasons Why Ethereum Will Surge in 2024 - Blockster",
        "content": "I am the Co-Founder, Editor-In-Chief and Creative Director at Blockster. I curate our publication's stories, build partnerships with premium Web3 brands, and oversee our product direction."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9jcnlwdG8tbWFya2V0LWFuYWx5c2lzLXhycC10aGlzLXBvcHVsYXItZXRoZXJldW0ta2lsbGVyLXByZXBhcmluZy1mb3ItY3Jhc2gtd2hhdHMtbmV4dC_SAYABaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2NyeXB0by1tYXJrZXQtYW5hbHlzaXMteHJwLXRoaXMtcG9wdWxhci1ldGhlcmV1bS1raWxsZXItcHJlcGFyaW5nLWZvci1jcmFzaC13aGF0cy1uZXh0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Crypto Market Analysis: XRP & this Popular Ethereum Killer Preparing for Crash, What’s Next? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nStory Highlights Crypto markets gain some momentum as the top crypto rises above the prolonged and extended consolidation zone\n\nDespite the formation of a strong base, some of the altcoins appear to trigger a significant pullback soon\n\nThe Bitcoin price rises above the pivotal range, suggesting the start of a healthy upswing that may transform into a bull run ahead. This has induced strong bullish momentum within the markets, due to which the popular tokens have soared by a decent margin. However, some altcoins like XRP & Avalanche (AVAX) are feared to lose their profits soon as the bears are about to knock on the door, causing a significant correction.\n\nRipple (XRP) Price Analysis\n\nThe XRP price has experienced significant bearish heat, which squashed all the gains incurred with the final judgement in the Ripple vs. SEC lawsuit. The XRPArmy appeared to try hard to keep up the momentum, but the bears left no stone unturned in keeping the price within the range. The XRP price is trading within a bearish pattern and hence is believed to shed huge gains in the coming days.\n\nThe XRP price is trading within a descending triangle and has failed to surpass the upper resistance in recent times. Considering the current trade setup, it appears that the XRP price is trading under acute bearish influence. The token, which has been testing new support since July, is expected to maintain a steep declining trend, leading to a major drop soon. The triangle remains active, with the lower highs forming below EMA 50.\n\nAdditionally, the declining RSI suggests a major drop in volume, which substantiates the bearish claim. Hence, the price after reaching the apex is believed to drop close to the first support at $0.56, and if bulls fail to defend, a major drop below $0.5 may be imminent.\n\nAvalanche (AVAX) Price Analysis\n\nThe avalanche price rally has raised eyebrows as the token has managed to surge above 400% since November. Despite this, the price failed to surpass the pivotal zone around $50, as it faced a major rejection at $49.96, causing a 20% drop. Although the token has triggered a rebound, the bulls appear to be incapable of maintaining an upswing.\n\nAfter producing a fine 480% rise since the September lows, the price trembled down as the volume marked new lows in December. The volume kept rising along waves 1 to 4, and through waves 4 to 5, the volume dropped, which may trigger a correction. The most revealing signal of all is the inverted cup or rounded top pattern, which suggests the top is in. Hence, one final surprise move before the correction.\n\nBesides, the AVAX price managed to close and stay below EMA21, which suggests a crash or correction could be on the horizon, which may end in a higher low compared to September before long-term growth."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8venljcnlwdG8uY29tL2tleS1tYXJrZXQtaW5kaWNhdG9yLXBvaW50cy10by0zODMwLWFuZC01MTAwLWFzLW5leHQta2V5LXByaWNldGFyZ2V0cy1mb3ItZXRoZXJldW0tZXRoL9IBcGh0dHBzOi8venljcnlwdG8uY29tL2tleS1tYXJrZXQtaW5kaWNhdG9yLXBvaW50cy10by0zODMwLWFuZC01MTAwLWFzLW5leHQta2V5LXByaWNldGFyZ2V0cy1mb3ItZXRoZXJldW0tZXRoLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Key Market Indicator Points To $3,830 And $5,100 As Next Key PriceTargets For Ethereum (ETH) - ZyCrypto",
        "content": "Advertisement\n\nAs the new year unfolds, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, is charting a promising course. After a noteworthy surge in price on January 1st, it has consistently mirrored Bitcoin’s bullish trajectory, sustaining its upward momentum into Tuesday.\n\nOver the past month, ETH consolidated after breaking above the $2,100 resistance level early last month and emerging from an ascending triangle pattern. Notably, after a successful retest of this area, Ethereum now seems poised for further gains, according to popular crypto analyst Ali Martinez.\n\nIn a post on X today, Martinez shed light on Ethereum’s MVRV (Market Value to Realized Value) Pricing Bands, offering valuable insights into the cryptocurrency’s potential upward movement. Notably, this indicator compares the current market value to the average cost of coins in circulation, providing traders with a tool to identify potential market tops and bottoms.\n\nSpecifically, when the values surpass ‘3.7,’ it signals a potential market top, suggesting it might be prudent to consider selling positions. Conversely, values below ‘1’ indicate a possible market bottom, signalling a negative MVRV value and prompting a strategic consideration for taking a gradual long position.\n\nAccording to Martinez, with the MVRV indicator currently positioned between the two values, Ethereum (ETH) is poised for a further surge, potentially reaching key price targets at $3,830 and $5,100.\n\nAdvertisement\n\nEarlier on Monday, Martinez expressed optimism, stating that Ethereum appears set for further gains, with no significant barriers ahead.\n\n“Ethereum looks set for further gains! The path ahead of ETH is clear, with no significant supply barriers in sight, suggesting a potential rise to $2,700 or beyond. Additionally, a robust demand wall at $2,000 provides solid support, potentially cushioning any corrections.” He wrote.\n\nBeyond technical analysis, Ethereum’s surge in institutional interest has become a prominent narrative. The holdings of Ethereum by institutions, both directly and indirectly through trusts, ETFs, and funds, experienced a sudden increase in November 2023. Notably, the allure for institutional investors lies in Ethereum’s enhanced technical features, such as Ethereum 2.0 upgrades and improved smart contract functionalities, underscoring its long-term investment potential.\n\nThat said, looking ahead, Ethereum anticipates enhancements to its network, with Vitalik Buterin recently unveiling an ambitious roadmap for 2024. Notably, the visionary behind Ethereum plans to cultivate authentic decentralization, enhance the network’s security, and refine its staking mechanisms. These initiatives align with a broader goal of establishing a sustainable business model for Ethereum and are poised to attract more investors to the network, potentially adding steam to ETH.\n\nAt press time, ETH was trading at $2,364, reflecting a 5.23% surge over the past 24 hours. In comparison, one of its biggest competitors, Solana, was priced at $116 after an impressive 11% surge during the same period."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9keW1lbnNpb24tYW5ub3VuY2VzLWdlbmVzaXMtcm9sbGRyb3AtZXRoZXJldW0tMDcwMTAxNDAzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Dymension Announces “Genesis Rolldrop,” Ethereum, Solana, Cosmos Users Can Claim DYM Tokens - Yahoo Finance",
        "content": "Dymension Announces “Genesis Rolldrop,” Ethereum, Solana, Cosmos Users Can Claim DYM Tokens\n\nDymension, a layer-1 blockchain built on Cosmos, has announced a \"genesis rolldrop\" of its DYM token to more than a million crypto users across various chains and projects. The airdrop is open to users who meet certain criteria, with approximately 70 million DYM tokens (7% of the supply) being offered.\n\nDymension is a network for deploying app chains called \"RollApps,\" and it enables connections across various rollup scaling networks. The network uses Ethereum Virtual Machine (EVM) addresses and allows RollApp creators to choose which virtual machine and token to use, and can publish data to external chains like Celestia or Avail.\n\nEligible users for the airdrop include those who staked the TIA token in Celestia, users of Ethereum layer-2 networks Arbitrum, Optimism, Base, and the upcoming Blast, and users of the Cosmos Hub, Stride, and Osmosis decentralized exchange (DEX). Additionally, more than 500,000 Solana users are eligible for the airdrop, including addresses that have used protocols like cross-chain bridge Wormhole, leading NFT marketplace Tensor, and NFT distribution platform Drip.Haus. Owners of certain NFTs, including Pudgy Penguins, Mad Lads, Tensorians, and Bad Kids, can also claim an allotment of DYM tokens.\n\nFollowing the genesis airdrop, Dymension has proposed allocating a further 2.5 million DYM to users who bridge funds to the chain from other networks, with eligible tokens including USDC, TIA, USDT, ATOM, ETH, and SOL.\n\nDymension's airdrop is part of a growing trend of networks and projects distributing their tokens to users. Recent high-profile airdrops include those from Jito, Celestia and Pyth Network.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tsYXl0bi1vbmJvYXJkcy1nb2xkc3RhdGlvbi1hbmQtZ3BjLWxhdW5jaGluZy10aGUtZmlyc3QtZ29sZC1yd2EtZGVmaS1wbGF0Zm9ybS1vdXRzaWRlLW9mLWV0aGVyZXVtLTMwMjAyNDM4MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Klaytn Onboards Goldstation and $GPC, Launching the First Gold RWA DeFi Platform Outside of Ethereum - PR Newswire",
        "content": "Goldstation, the first-ever gold DeFi platform on a public mainnet outside of Ethereum , combines Klaytn's low fees and latency to offer more efficient gold investments through $GPC, a gold-pegged token 1:1 backed by physical gold.\n\nSouth Korean residents will be able to convert their physical gold holdings into NFTs via The Mining Club, then using the NFT as collateral to mint $GPC. A global launch for Goldstation is planned.\n\nKlaytn Foundation and CREDER intend to expand beyond gold to tokenize more precious metals for the domestic and global markets.\n\nSINGAPORE, Jan. 2, 2024 /PRNewswire/ -- Klaytn Foundation, established to build and decentralize the ecosystem of South Korea's leading Layer 1 blockchain Klaytn, announced today that Klaytn Governance Council (GC) member CREDER has launched $GPC (Gold-Pegged Coin), a digital asset pegged to the real-time market price of gold; and Goldstation, a decentralized finance (DeFi) platform for $GPC, on Klaytn.\n\nKlaytn Onboards Goldstation and $GPC, Launching the First Gold RWA DeFi Platform Outside of Ethereum\n\n$GPC marks two firsts in the RWA tokenization industry — it is the first tokenized gold to be available on DeFi outside of the Ethereum ecosystem, and also the first gold-pegged token that does not charge a percentage-based commission for transactions. These two attributes allow $GPC to truly deliver on the benefits of real-world asset tokenization, with Klaytn's low gas fees allowing individuals with small investment capital to add gold to their portfolios without gas fees eating a significant portion of their investment, and the lack of percentage-based fees ensuring that trading gold on-chain remains cost-effective regardless of the amount one wishes to transact.\n\nGoldstation also marks the first-ever gold real-world asset (RWA) token DeFi platform powered by a public mainnet other than Ethereum. It will commence its services, which includes $GPC staking and more, on 24 January 2024. Goldstation will transform gold investments from conventionally relying only on market profits, into DeFi interest revenue generation opportunities. In addition, Goldstation will serve as a hyper-efficient and more profitable gold investment destination, thanks to Klaytn's low transaction fees, high TPS capabilities, and support for the ERC-3643 tokenization standard.\n\nTo mint $GPC, users will need to first convert their gold assets into NFTs via The Mining Club, which is a platform operated by CREDER that proves users' unique digital ownership of real gold assets using blockchain technology. Once a user's gold assets are recorded as an NFT, they will be able to issue $GPC at Goldstation by placing their gold NFT as collateral. This entire physical gold to $GPC tokenization process can be easily carried out with a few clicks by connecting their crypto wallets that support Klaytn, such as Kaikas, Metamask, and Kakao KLIP.\n\nGoldstation is currently only available for South Korean residents, with plans for a global launch in the future.\n\nLeading up to the launch, Klaytn Foundation worked closely with CREDER, sharing its business network of leading domestic and foreign partners while cooperating for regulatory compliance, platform optimization, and domestic and global marketing. In addition, as Klaytn recently integrated support for the ERC-3643 tokenization standard, Klaytn Foundation and CREDER plan to comprehensively expand precious metals RWA tokenization beyond gold in the future.\n\n\"Gold NFTs and $GPC can be ledgered on-chain for anyone through Oracle Network's Proof of Reserve (POR),\" said James Lim, CEO of CREDER, \"we will create a new standard for RWA with Klaytn based on the power of transparency and trust that Web 3.0 finance will deliver.\"\n\n\"We are very pleased that Klaytn is the mainnet of choice for CREDER's Goldstation, the first gold RWA token DeFi platform outside of the Ethereum ecosystem,\" said Sam Seo, Representative Director of Klaytn Foundation. \"Klaytn Foundation has been working together with CREDER's meticulous preparation for $GPC and Goldstation. Moving forward, we will closely cooperate with them to deliver more diverse metal RWA tokenization projects for the domestic and global markets.\"\n\nAbout CREDER, Blockchain Financial Platform\n\nFounded in 2022, CREDER (CEO James Im) is a digital transformation (DX) company that is conducting Korea's first 100% real gold-based RWA (Real World Asset) tokenization business. It has developed a decentralized finance (DeFi) platform that can utilize the issuance of gold NFTs and tokens linked to real gold. CREDER is currently the governance council (hereinafter referred to as GC) of Korea's leading global Layer 1 blockchain platform, Klaytn. More information about CREDER can be found at https://www.creder.biz.\n\nAbout Klaytn Foundation\n\nKlaytn Foundation was established in 2020 to expand the ecosystem of Klaytn, a global Layer 1 blockchain platform, and has since been actively collaborating with its Governance Council members worldwide. Klaytn Foundation facilitates the adoption and development of new technologies to ensure that Klaytn fulfills its role as an open, trusted, and sustainable blockchain platform for developers and users alike. It also facilitates decision-making to ensure that the ecosystem continues to expand optimally in the rapidly changing blockchain landscape. In line with its long-term Governance Roadmap, Klaytn Foundation plans to fully implement the Decentralization Phase of the Klaytn blockchain in 2023 and beyond.\n\nSOURCE Klaytn Foundation"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzAyL2V0aGVyZXVtLWJhc2VkLWFsdGNvaW4tcGx1bW1ldHMtbmVhcmx5LTc4LWFmdGVyLXRlYW0tZGVwb3NpdHMtaW50by1jb2luYmFzZS1vbi1jaGFpbi1kYXRhL9IBf2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzAyL2V0aGVyZXVtLWJhc2VkLWFsdGNvaW4tcGx1bW1ldHMtbmVhcmx5LTc4LWFmdGVyLXRlYW0tZGVwb3NpdHMtaW50by1jb2luYmFzZS1vbi1jaGFpbi1kYXRhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Based Altcoin Plummets Nearly 78% After Team Deposits Into Coinbase: On-Chain Data - The Daily Hodl",
        "content": "An Ethereum (ETH)-based altcoin collapsed in value after the project’s team members moved thousands of tokens to the crypto exchange Coinbase, according to on-chain data.\n\nThe blockchain data tracker Lookonchain says that the decentralized oracle protocol Tellor Tributes (TRB) went on a parabolic rally before a sudden massive correction, causing the liquidation of tens of millions of dollars.\n\nSays Lookonchain,\n\n“In the past 24 hours, TRB soared to $600 [on December 31st] and then plummeted to $137, causing $68 million of assets to be liquidated, making it the most liquidated token.”\n\nLookonchain noticed Tellor team members moved thousands of TRB onto the top US exchange Coinbase after the price surge and right before the price collapse.\n\n“We noticed that the Tellor team deposited 4,211 TRB ($2.4 million) after the price of TRB skyrocketed.”\n\nTRB has since recovered some of its losses and is trading for $183.64 at time of writing, up about 18% in the last 24 hours.\n\nIn November, crypto analytics firm Santiment noticed that deep-pocketed TRB holders were aggressively adding to their holdings. At that time, wealthy traders who owned between 1,000 to 100,000 TRB added 15% of the total supply to their holdings over a seven-week period for a total of 46% of the asset’s total supply. The buying spree came as TRB’s value jumped from under $15 in September to $134.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy1ldGhlcmV1bS1maW5hbGx5LWdvaW5nLXRvLWJyZWFrLWFib3ZlLTItNGstZXRoLXByaWNlLWFuYWx5c2lzL9IBXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy1ldGhlcmV1bS1maW5hbGx5LWdvaW5nLXRvLWJyZWFrLWFib3ZlLTItNGstZXRoLXByaWNlLWFuYWx5c2lzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Is Ethereum Finally Going to Break Above $2.4K? (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has encountered a significant obstacle at the critical $2.4K resistance, leading to an extended consolidation phase within this pivotal range.\n\nThis situation and the bullish sentiment in the futures market have heightened expectations for a potential bullish breakout.\n\nTechnical Analysis\n\nBy Shayan\n\nEthereum Price Analysis: The Daily Chart\n\nA detailed examination of Ethereum’s daily chart reveals an ascending consolidation period, with the price approaching a substantial resistance at $2.4K. This zone includes the static $2.4K resistance and aligns with the upper boundary of a multi-month wedge pattern, forming a robust barrier. Despite this, ETH is displaying bullish momentum, attempting to break above this crucial range. A successful breach could see the price reclaim the $2.4K resistance, setting the stage for a renewed bullish surge.\n\nHowever, considering the bearish divergence between the price and the RSI indicator, there is still a possibility of a bearish reversal.\n\nDespite the overall bullish market conditions, a sudden rejection may lead to a sustained cascade towards the 100-day and 200-day moving averages. Therefore, caution is advised during these market conditions, given the potential for sudden impulsive movements.\n\nThe 4-Hour Chart\n\nExamining the 4-hour chart, Ethereum appears to be confined within a critical range, bordered by the substantial support at $2.1K and the significant resistance at $2.4K, resulting in sideways consolidation. Notably, the $2.1K level aligns with the crucial range between the 0.5 and 0.618 levels of the Fibonacci retracement, acting as a notable barrier against sellers.\n\nDespite this consolidation, the price has recently surged, reaching its prior major high near the $2440 mark. However, the outcome hinges on whether buyers can reclaim the $2.4K resistance. If successful, an ascending trend is likely. Conversely, a rejection could lead to a market decline towards the lower threshold of the range.\n\nOn-chain Analysis\n\nBy Shayan\n\nEthereum’s recent price performance has been notably bullish, bringing the market close to the $2.4 resistance region. However, a recent shift into a prolonged consolidation phase has raised questions among market participants about whether this marks the end of the mid-term bullish phase or is simply a correction.\n\nExamining the sentiment in the futures market becomes crucial to address this uncertainty. The provided chart illustrates funding rates, a valuable metric indicating the sentiment in the futures market by showing whether buyers or short-sellers are executing orders more aggressively. Positive values generally indicate a bullish sentiment, while negative values suggest pessimism among futures traders.\n\nNotably, the funding rates have consistently been positive, with recent trends showing an upward trajectory, signaling heightened bullish sentiment in the perpetual markets and fostering expectations for a bullish breakout. However, caution is advised, as excessively high funding rates could be interpreted as a bearish signal.\n\nThis scenario suggests the market might be on the verge of a long liquidation cascade. If such liquidations occur, the price is likely to experience a rapid decline toward the 200 and 100-day moving averages. Monitoring these metrics becomes crucial for anticipating potential shifts in market dynamics and adjusting strategies accordingly."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2hpYmEtaW51LWJpdGNvaW4tZXRoZXJldW0tMy1ib2xkZXN0LXByaWNlLXByZWRpY3Rpb25zLWZvci0yMDI00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu, Bitcoin & Ethereum: 3 Boldest Price Predictions For 2024 - Watcher Guru",
        "content": "The cryptocurrency markets started the new year of 2024 on the front foot as Bitcoin climbed above the $45,000 mark. The price rise pulled other leading altcoins into the green as Ethereum touched $2,400. The positive rise was also reflected in the memecoin segment as Shiba Inu deleted a zero and hit $0.00001080 on Tuesday. The cryptocurrency market momentum for Bitcoin, Ethereum, and Shiba Inu remains positive with investors’ enthusiasm on a high for 2024.\n\nAlso Read: Shiba Inu: Can SHIB Reach $0.01 in 2024?\n\nA handful of analysts have provided bold price predictions for Bitcoin, Ethereum, and Shiba Inu in 2024. In this article, we will highlight how high BTC, ETH, and SHIB cryptocurrencies can rise this year in 2024, according to analysts.\n\n3 Boldest Price Predictions For 2024: Bitcoin, Ethereum, & Shiba Inu\n\n1. Bitcoin (BTC) 2024 Price Prediction\n\nSource: Pintrest\n\nInvestors are hopeful that the SEC will approve the much-awaited Bitcoin ETF before Q2 of 2024. The move will allow a flood of investments into the cryptocurrency markets, especially Bitcoin. The prices of BTC are expected to soar after the BTC ETF approval, which will eventually make other cryptocurrencies hit new highs. CoinShares has provided a bold prediction claiming that Bitcoin’s price could climb above the $80,000 mark this year in 2024.\n\n“Estimations suggest that a 20% investment increase from current assets under management (around US$3 billion) could potentially propel Bitcoin prices to US$80,000,” said James Butterfill, CoinShares Head of Research to CNBC.\n\nAlso Read: Shiba Inu: Shibarium To Start Burning SHIB Tokens From January 2024\n\n2. Ethereum (ETH)\n\nSource: CNN\n\nA leading price prediction analyst boldly claims that Ethereum could “easily” hit $10,000 this year in 2024. According to the prediction, ETH could reach a deflationary stage making the cryptocurrency begin surging in price. The development might make Ethereum sustainably scale up in the charts and add new investments along the way. The combination of fresh funds and its deflationary status might make Ethereum reach $10,000, claims the prediction.\n\nAlso Read: 5 U.S. Sectors To Be Affected If BRICS Ditches the Dollar For Trade\n\n3. Shiba Inu (SHIB)\n\nSource: Watcher Guru\n\nA handful of predictions boldly claim that Shiba Inu could delete most of its zeroes and reach the $0.01 mark. These predictions are not new in 2024 but have been repeating on a loop since 2020. There’s nothing to be taken at face value as SHIB has a long way to reach the $0.01 mark as its circulating supply stands at 549 trillion tokens. There is no guarantee that Shiba Inu will skyrocket in price in 2024.\n\nThe cryptocurrency markets are highly volatile and can swing both ways delivering losses to investors. There is no guarantee that BTC could reach $80,000 ETH $10,000, and SHIB to $0.01. It is advised to do thorough research before taking an entry position into the cryptocurrency markets at the moment."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLW1vbnRobHktdHJhbnNhY3Rpb24tY291bnQtY2xpbWJzLXRvLWhpZ2hlc3QtbGV2ZWwtc2luY2UtanVseS0yMDIyLTIwMjQwMjAxMTMwNtIBigFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1tb250aGx5LXRyYW5zYWN0aW9uLWNvdW50LWNsaW1icy10by1oaWdoZXN0LWxldmVsLXNpbmNlLWp1bHktMjAyMi0yMDI0MDIwMTEzMDY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum monthly transaction count climbs to highest level since July 2022 - FXStreet",
        "content": "Share:\n\nEthereum’s monthly transaction count amounted to 36.02 million in January.\n\nThis is its highest monthly count since July 2022.\n\nDespite the surge in demand for the network, its NFT sales volume and DeFi TVL saw declines.\n\nEthereum (ETH) recorded a monthly transaction count of 36.02 million, marking its highest in 20 months.\n\nAlso read: Ethereum Price Prediction: $2,500 in sight as bullish metrics steer ETH back into the channel\n\nSurge in user activity\n\nProof-of-Stake network Ethereum (ETH) experienced a significant increase in activity in January, recording its highest monthly transaction count since July 2022, according to The Block Data dashboard. Information from the data provider showed that during the 31-day period, transactions on the network totaled 36.02 million.\n\nEthereum monthly transaction count\n\nA rise in a Network’s Transaction Count is often due to a corresponding uptick in user activity. Data from The Block showed that in January, the daily number of unique addresses that were active on Ethereum, either as a sender or receiver, rose by 4%. The Daily Active Addresses on Ethereum was 14.1 million, the highest recorded since October 2022.\n\nEthereum’s NFT and DeFi verticals lose steam\n\nWhile the network saw an increase in user activity, the growth markers of Ethereum’s non-fungible tokens (NFTs) and Decentralized Finance (DeFi) ecosystems showed a decline in both verticals in January.\n\nTo assess the performance of a network’s NFT ecosystem, its sales volume is considered. Data from CryptoSlam showed that in January, NFT sales volume on Ethereum plummeted by 2%. According to the data provider, 138,465 NFT transactions were completed on the chain with a sales volume of $356 million.\n\nInterestingly, the fall in Ethereum’s sales volume did not mirror the general market’s performance. According to data from NFTGo, the total volume of NFT sales across all collections in January climbed by 41%.\n\nRegarding Ethereum’s DeFi sector, it witnessed a 7% dip in its Total Value Locked (TVL) in the last month, per data from DefiLlama. At press time, Ethereum’s DeFi TVL was $31.85B\n\nDouble-digit decline in network fees and revenue\n\nDespite the surge in user activity and demand for Ethereum in January, it took a significant hit to its transaction fees and revenue.\n\nEthereum Monthly Fee and Revenue\n\nData from Token Terminal showed that during the period under review, users paid a total of $213 million in fees to use Ethereum. This marked a 34% decline from the $325 million the network received as user fees in December.\n\nLikewise, the revenue it derived from last month’s fees plunged by 37%. In January, Ethereum’s monthly revenue totaled $179 million. In December, it was almost $290 million.\n\nWith the consistent sideways movement in ETH’s price, the network may witness a decline in demand in February unless market sentiment improves. Should this happen, network fees and revenue may plunge further."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjQvMDEvMDIvZXRoZXJldW0tcHJpY2UtY2FuLXNvYXItdG8tNTEwMC10b3AtYW5hbHlzdC1oaW50cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Can Soar to $5,100, Top Analyst Hints - The Crypto Basic",
        "content": "Current Ethereum (ETH) on-chain data hints that the coin could soar as high as $5,100, the upper band of its next key target.\n\nTop market analyst Ali Martinez shared this hint, drawing insight from the Ethereum Market Value to Realized Value (MRVR) ratio. Using this metric, Martinez claimed that the next major price target for the coin lies within the $3,830 to $5,100 range.\n\nThis price range is highly ambitious for Ethereum, and while its All-Time High (ATH) of $4,891.70 falls in between this range, meaning it is achievable, current market dynamics hint at how challenging it might be to hit this price target in the short term.\n\n- Advertisement -\n\nEthereum On-Chain Outlook\n\nMartinez is bullish on Ethereum, judging by his previous posts shared on the X platform. At the moment, Ethereum has no major supply barriers in sight, with a psychologically important resistance point set around the $2,700 zone. Should this level be flipped, Martinez believes there is no major obstacle ahead for the digital currency.\n\nAt the time of writing, Ethereum was trading for $2,399.10, up by more than 4% in the past 24 hours. The coin’s market has jumped by 4% to $288,470,978,345, and trading volume has soared 60% to $10,933,692,743.\n\nPer the chart shared by Ali Martinez, Ethereum has at least four different Realized Price (RP) levels, including $1,275.57 and $1,594.46, which form the likely point the coin’s price could slip to. These Realized Prices also hint at the upper band of $3,826.70 and $5,102.27, as pointed out by the analyst.\n\nAccording to the #Ethereum MVRV Pricing Bands, the next key price targets for $ETH are $3,830 and $5,100! pic.twitter.com/cLo4crWkPF — Ali (@ali_charts) January 1, 2024\n\n- Advertisement -\n\nConflicting Ethereum Price Calls\n\nThe outlook on Ethereum has been quite controversial in recent times. Market experts like Ali Martinez and Michael van de Poppe are bullish on the coin as the latter denounced the idea that Ethereum is dead.\n\nHowever, Ethereum is not favored by legendary trader Peter Brandt, who is convinced the digital currency may not be around for the next ten years. Brandt, in his strong belief that Ethereum is poised to fall, revealed he had shorted the coin as he noted the coin could fall as low as $650 in the long term."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy1ldGhlcmV1bXMtcm9hZG1hcC1mb3ItMjAyNC1hY2NvcmRpbmctdG8tdml0YWxpay1idXRlcmluL9IBW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy1ldGhlcmV1bXMtcm9hZG1hcC1mb3ItMjAyNC1hY2NvcmRpbmctdG8tdml0YWxpay1idXRlcmluLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Here’s Ethereum’s Roadmap for 2024, According to Vitalik Buterin - CryptoPotato",
        "content": "Vitalik Buterin, the co-founder of Ethereum, has released a roadmap detailing the network’s upgrades and activities for 2024.\n\nIn a series of tweets, Buterin stated that the 2024 roadmap contained few changes from the 2023 plan and that the network is set to focus on the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nEthereum’s Roadmap For 2024\n\nSince the Merge took place in September 2022, the Ethereum network will now prioritize implementing the role of a single slot finality (SSF). While the Merge saw Ethereum transition from a Proof-of-Work (PoW) consensus mechanism to that of Proof-of-Stake (PoS), SSF will resolve the network’s current weaknesses.\n\nThe concept of SSF can make Ethereum’s consensus mechanism validate blocks more efficiently; the blocks could be proposed and finalized in the same slot, significantly reducing time-to-finality by 15 minutes. Buterin believes this is the easiest path to fixing Ethereum’s PoS issues.\n\nThen comes the Surge with a goal of 100,000 transactions per second on rollups. The Ethereum co-founder revealed that cross-rollup standards and interop have been highlighted as areas for long-term improvements, and 2024 will see significant progress on rollup scaling both on EIP-4844 and from rollups themselves.\n\nEthereum is also looking to fix its centralization issues through the Scourge. Per the roadmap, the focus will be on mitigating such concerns in the network’s PoS design, especially around Maximal extractable value (MEV) and liquid staking or pooling. Buterin earlier recommended reducing the cost of running nodes to fix the challenge.\n\nEasing Block Verifications\n\nFurthermore, the roadmap mentioned the Verge, which could make block verification easier. Verkle trees are almost ready for inclusion, and soon, verifying blocks would only involve downloading some bytes of data, performing a few basic computations, and verifying a Succinct, Non-Interactive Argument of Knowledge (SNARK).\n\nThe network would explore Ethereum Virtual Machine (EVM) verification precompile to arrive at a fully SNARKed Ethereum.\n\nIn addition, the Purge will simplify the protocol, eliminate technical debts, and limit network participation costs, while the Splurge will fix everything else.\n\n“‘Increase L1 gas limit’ was removed to emphasize that the limit can be raised *at any time*; no need to wait for full SNARKs esp for small increases. ‘State expiry’ has been shrunk, to reflect a general consensus that it’s a fairly low-priority and low-urgency item esp given stateless clients and PBS / execution tickets,” Buterin explained."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8yMTE1MTUvZHltZW5zaW9uLWxhdGVzdC1haXJkcm9wLXNvbGFuYS1ldGhlcmV1bS1jb3Ntb3MtdXNlcnPSAVVodHRwczovL2RlY3J5cHQuY28vMjExNTE1L2R5bWVuc2lvbi1sYXRlc3QtYWlyZHJvcC1zb2xhbmEtZXRoZXJldW0tY29zbW9zLXVzZXJzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Dymension Is the Latest Airdrop for Solana, Ethereum, and Cosmos Users - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s a new year, but airdrop season is continuing at full force into 2024. The latest: Dymension, a network for deploying app chains called “RollApps,” has revealed a token drop for more than a million crypto users across various chains and projects.\n\nDymension is a layer-1 blockchain built on Cosmos and the inter-blockchain communication protocol (IBC) to enable connections across various rollup scaling networks. “Dymension standardizes rollups with IBC, similar to how tokens were standardized with ERC,” Dymension wrote on Twitter (aka X), referring to Ethereum’s token standards.\n\nThe network lets RollApp creators choose which virtual machine and token to use, and can publish data to external chains like Celestia or Avail. Dymension CEO and co-founder Yishay Harel told Decrypt that the L1 network uses Ethereum Virtual Machine (EVM) addresses.\n\nAD\n\nAD\n\nOn Tuesday, Dymension revealed its “genesis rolldrop,” which offers up DYM tokens to eligible users until January 21. United States residents cannot participate in the airdrop. However, a wide array of other crypto users are eligible for the airdrop, with some 70 million DYM tokens (7% of the supply) being offered up.\n\nStarting today, over one million addresses have the opportunity to participate in Dymension’s Genesis Rolldrop! Eligible participants can claim up to 70M DYM (7% of total supply), the native asset of Dymension, until 21 January 2024, 12:00 UTC — Dymension (@dymension) January 2, 2024\n\nFull details are available in this blog post, but eligible users include those who staked the TIA token in Celestia as of December 19, 2023, along with users of Ethereum layer-2 networks Arbitrum, Optimism, Base, and the upcoming Blast based on certain criteria.\n\nCosmos Hub and Stride users who meet certain eligibility can also claim DYM tokens, along with users of the Osmosis decentralized exchange (DEX).\n\nMore than 500,000 Solana users are also eligible, according to the post, including addresses that have used protocols like cross-chain bridge Wormhole, leading NFT marketplace Tensor, and NFT distribution platform Drip.Haus.\n\nAD\n\nAD\n\nAdditionally, owners of Pudgy Penguins, Mad Lads, Tensorians, and Bad Kids NFTs can also claim an allotment of DYM tokens. Pudgy Penguins is minted on Ethereum, Mad Lads and Tensorians are on Solana, and Bad Kids is on the Cosmos-based Stargaze chain.\n\nLastly, following the genesis airdrop, Dymension has proposed allocating a further 2.5 million DYM to users who bridge funds to the chain from other networks. Eligible tokens include USDC, TIA, USDT, ATOM, ETH, and SOL, with that program expected to begin about a week following the upcoming Dymension airdrop launch.\n\nDymension joins a growing list of networks and projects that are dropping their tokens lately, including recent high-profile airdrops from Jito and Pyth Network and upcoming drops from the likes of Jupiter, Starknet, Portal, Frame, and Blast.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi16b29tcy1wYXN0LTQ1ay1ldGhlcmV1bS1hbmQtcGVwZS1jb2luLXJhbGx5L9IBYWh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi16b29tcy1wYXN0LTQ1ay1ldGhlcmV1bS1hbmQtcGVwZS1jb2luLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Zooms Past $45K, Ethereum and Pepe Coin Rally - CoinGape",
        "content": "The crypto market was buoyant on the first day of the new year, with Bitcoin breaking above the $45,000 mark — the first time in the last 20 months. The price surge came as the market warmed up to the possibility that the US securities regulator could approve a spot Bitcoin exchange-traded fund (ETF) any moment now.\n\nBitcoin price rose quickly from the $42,000 level on Jan 1, jumping more than 7% in the last 24 hours to $45,373. The OG cryptocurrency now commands a market capitalization of 887.77 billion — a more than 7% jump in the past day. Its trading volume over the last 24 hours surged by 54.54% to $25.88 billion. The leading cryptocurrency has appreciated more than 170% year-to-date.\n\nadvertisement\n\nMeanwhile, Ethereum price climbed nearly 5% in the last 24 hours. It last changed hands at $2,382, a 4.86% rise from yesterday’s closing price. The 24-hour trading volume also saw a 21% surge to $8.52 billion, with Ether sitting at a total market cap of roughly $286.2 billion.\n\nOther major tokens, such as Tether (USDT) and Binance Coin (BNB), were in the green zone, as of writing, rising 0.02% each in the last 24 hours. At press time, Tether’s price stood at $1 while BNB’s price stood at $318.\n\nBitcoin’s price rally on Jan 1 also fueled a surge in the prices of other altcoins. Solana’s (SOL) price rose 0.24% to $111.49 in the last 24 hours, while XRP’s price appreciated by 0.07% to $0.634. However, Cardano’s (ADA) price was down 0.10% to $0.629 in the past day.\n\nBitcoin’s phenomenal 24-hour run along with marginal gains recorded by other major tokens, sent the global crypto market cap soaring to $1.74 trillion, up 5.64% in the last 24 hours.\n\nTop Cryptos for Today\n\nPepe Coin Rallies Over 10%\n\nMeme coin PEPE was among the top gainers in the past day, with the PEPE price standing at 0.0000000001773 at press time. The altcoin has rallied more than 10% in the last 24 hours and appreciated by more than in the last seven days. The 24-hour trading volume surged by a whopping 1345% to $1,656.\n\nShiba Inu Surges Nearly 5%\n\nThe OG meme coin also had a good run in the last 24 hours, surging more than 5% to $0.00001082. The price surge was reflected in the altcoin’s market cap, which grew by over 5.4% to nearly $6.38 billion. Meanwhile, the 24-hour trading volume stood at $114.02 million, up more than 29%.\n\nSEI Price Jumps Roughly 30$\n\nThe price rally in the SEI token outpaced market heavyweights like Bitcoin, Ethereum, and Solana in the last 24 hours. As of writing, SEI’s price stood at $0.755, up more than 30% in the past day."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vMzgzMC01MTAwLW1ham9yLWV0aGVyZXVtLXRhcmdldHMtYWNjb3JkaW5nLW1vZGVsL9IBW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vMzgzMC01MTAwLW1ham9yLWV0aGVyZXVtLXRhcmdldHMtYWNjb3JkaW5nLW1vZGVsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "$3,830 & $5,100 Next Major Ethereum Targets According To This Model - NewsBTC",
        "content": "An analyst has explained that $3,830 and $5,100 could be the next major targets for Ethereum based on an on-chain pricing model.\n\nEthereum MVRV Pricing Bands Have Next Targets At $3,830 And $5,100\n\nIn a new post on X, analyst Ali talked about the next key targets for Ethereum based on the “MVRV Pricing Bands.” The “Market Value to Realized Value” (MVRV) is a popular ratio in on-chain analysis calculated by dividing the Bitcoin market cap by its realized cap.\n\nThe “realized cap” here refers to a capitalization model for BTC that assumes that the true value of any coin in circulation is not the current spot price but the value at which the coin was last transacted on the blockchain.\n\nThe last transfer price of any coin may be considered as its buying price, so the realized cap considers the cost basis of all the investors. Put another way, the indicator keeps track of the total amount the holders have invested in the cryptocurrency.\n\nThus, the MVRV ratio tells us how the value that the investors hold right now (the market cap) compares against the total investment they made. Because of this, the MVRV ratio is often used to judge whether the asset is overpriced or underpriced currently.\n\nNow, here is a chart that shows “pricing bands” for Ethereum corresponding to different values of the MVRV ratio:\n\nThe trend in the MVRV Pricing Bands over the past few years | Source: @ali_charts on X\n\nAs displayed in the above graph, Ethereum currently trades above the 0.8 and 1.0 MVRV Pricing Bands. At these lines, the MVRV ratio is 0.8 and 1.0, respectively.\n\nWhen the price is under these lines, the investors are in a state of loss, and the asset may thus be considered “undervalued.” Historically, this is where bottoms have become more likely to form for the cryptocurrency.\n\nETH is currently on its way up, with the gap to these lines widening. From the chart, it’s visible that the next important MVRV Pricing Bands are 2.4 and 3.2. At these levels, Ethereum becomes overheated as the investors carry significantly more than they put into the coin.\n\nProfit-taking becomes much more likely when this happens, which can impede any price rise. In the past, the major tops in the cryptocurrency have formed when the price has been above one or both of these levels.\n\nThese two MVRV Pricing Bands currently correspond to ETH prices of around $3,830 and $5,100, respectively. Therefore, these ceilings may be ones to watch currently, as the asset hitting the targets could imply that it’s starting to become overvalued.\n\nETH Price\n\nEthereum has enjoyed a 4% jump during the past day and has breached the $2,400 level.\n\nLooks like the value of the coin has registered a sharp increase over the last 24 hours | Source: ETHUSD on TradingView\n\nFeatured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, Glassnode.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9kZWZpLWRldmVsb3BtZW50cy10by13YXRjaC1mb3ItaW4tMjAyNC11bmlzd2FwLWNlbGVzdGlhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "DeFi developments to watch for in 2024 – DL News - DLNews",
        "content": "What you'll learn 2024 might be the dawn of KYC'd DeFi.\n\nModularity is DeFi's new shiny toy.\n\nHow many times can one Ether be staked?\n\nEach year that goes by, the world of decentralised finance — which began in earnest in 2020 — becomes more and more complex.\n\nWhat started out as a handful of simple Ethereum apps enabling users to swap or lend against tokens is now a sprawling metropolis of interconnected protocols, each clawing to capture as much of the $52 billion DeFi market as possible.\n\nMaking sense of it all is hard — even more so now that the DeFi ecosystem is spread out over more than 200 different blockchains.\n\nTo help make sense of the latest trends in DeFi, DL News has identified key developments that are sure to make waves in 2024.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nUniswap’s ‘Hooks’ let developers make custom features—like KYC\n\nBack when Uniswap first revealed its new Hooks function as part of Uniswap v4, onlookers immediately warned that it could be used to create liquidity pools with compliance requirements, such as know-your-customer checks.\n\nSome DeFi puritans said Hooks were antithetical to the founding principles of DeFi — namely its permissionless nature.\n\nBut others argue that permissioned Uniswap pools may benefit DeFi by removing the very real fear among institutions of inadvertently interacting with entities sanctioned by the US Office of Foreign Assets Control through DeFi protocols.\n\nAs Uniswap is the furthest along in providing optional KYC functionality via Hooks, such a development should reinforce the protocol’s moat and competitiveness, said VanEck.\n\nJoin the community to get our latest stories and updates\n\nIf permissioned DeFi does start to gain traction with traditional financial players, Uniswap Hooks will likely be where it starts.\n\nEigenLayer will make Ethereum more modular\n\nIn recent years, Ethereum has grown beyond the confines of the main Ethereum network and now encompasses more than a dozen so-called layer 2 blockchains, too.\n\nWhile these layer 2 chains offer vastly reduced fees and faster transactions, they also introduce a significant problem: a fracturing of Ethereum’s trust network because transaction validation happens outside of the Ethereum mainnet.\n\nValidation involves checking if transactions conform to the blockchain’s rule.\n\nWhile layer 2s ultimately send all transactions that happen on them back to the Ethereum mainnet for finality, they require an outside validation network to do so. Finality is when validated transactions are rendered irreversible on the blockchain.\n\nCurrently, the companies building layer 2s handle this validation themselves in a centralised manner. But most, if not all, have expressed a desire to decentralise their validation as much as possible.\n\nThat’s where much-hyped protocols like EigenLayer come in.\n\nEigenLayer will let the blockchains built on top of Ethereum, as well as other protocols like decentralised oracle networks, tap back into mainnet validation for their various validation needs.\n\nThe desired result is a more efficient and aligned validation system that covers not just the main Ethereum chain but also everything else that relies on it for transaction validation.\n\nIf EigenLayer becomes successful, Ethereum should start to resemble modular blockchains like Cosmos, Celestia or Polkadot but with a much more decentralised validation network. Modular blockchains work by separating network functions into special layers instead of their monolithic counterparts like Bitcoin and Ethereum that try to handle all functions on one layer.\n\nEigenLayer has also taken things beyond validation. It’s also working on EigenDA, a way to help layer 2s scale by providing extra data availability.\n\nIt is fair to say that EigenLayer’s full launch could be the spark that reignites interest in Ethereum and its many layer2 networks in 2024.\n\nFor investors, EigenLayer offers a tantalising prospect by letting them restake their staked Ether, thus offering even more yields. But restaking has also caused some anxiety among the Ethereum community.\n\nEthereum co-founder Vitalik Buterin has warned restaking, if constructed poorly, could threaten the network’s stability.\n\nEchoing Buterin, JPMorgan analysts are also wary that that restaking may lead to a “cascade of liquidations if a staked asset drops sharply in value.”\n\nEigenLayer founder Sreeram Kannan told DL News in May that he understands the fear and the project moves cautiously.\n\nBig names set to launch on Celestia\n\nEigenLayer isn’t the only project offering the magic combination of modularity and data availability.\n\nCelestia is doing the same, but instead of operating through a set of smart contracts on Ethereum, it uses a purpose-built blockchain.\n\nRather than having to create a validation network themselves, blockchains can build on or migrate to Celestia to benefit from the validation and data availability provided by the project’s main blockchain.\n\nSo far, only a handful of blockchains — or settlement layers — have been deployed on Celestia. But some big names are set to deploy in 2024.\n\nBerachain, which raised $42 million in its April Series A, is likely the most well-known among DeFi natives. But lesser-known projects, like Neutrino and Layer N, shouldn’t be overlooked.\n\nA number of existing infrastructure projects such as cross-chain bridge Axelar, Optimism’s OP Stack, and the Cosmos SDK framework have also opted to integrate with Celestia.\n\nWith so much potential, Celestia’s growing ecosystem will likely be one of the biggest stories of the coming year.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8yMTE1NDcvc29sYW5hLW5mdC1zYWxlcy1za3lyb2NrZXQtZXRoZXJldW0tbW9udGhseS12b2x1bWXSAVJodHRwczovL2RlY3J5cHQuY28vMjExNTQ3L3NvbGFuYS1uZnQtc2FsZXMtc2t5cm9ja2V0LWV0aGVyZXVtLW1vbnRobHktdm9sdW1lP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana NFT Sales Skyrocket, Topping Ethereum in Monthly Volume for First Time - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana’s surging fortunes of late have produced a surprising result in the NFT market: monthly sales volume of NFTs on the network beat that of NFTs on Ethereum in December 2023, for the first time ever.\n\nAccording to data from analytics platform CryptoSlam, Solana NFT sales tallied about $366.5 million worth in December compared to $353.2 million on Ethereum. CryptoSlam’s “organic” sales figures exclude suspicious trades marked as “wash trading,” with about $381 million worth of Ethereum sales excluded and just $10.1 million worth of Solana sales pulled out.\n\nSolana’s total of $366.5 million in trades nearly matched the network’s all-time high, according to CryptoSlam, which was about $373.5 million worth in October 2021 as the space was just heating up. We’ve seen daily Solana NFT sales volume pop above Ethereum at times, but never in terms of a full month’s worth of trades.\n\nAD\n\nAD\n\nSolana saw about double the amount of unique buyers and sellers in December too, and far more total NFT transactions. CryptoSlam reports about 218,000 sellers and 279,000 buyers on Solana across nearly 6.6 million NFT transactions. Compare that to about 114,000 sellers and over 143,000 buyers on Ethereum, across 698,000 transactions.\n\nEthereum’s NFT sales volume in December was pretty much flat compared to November’s total of almost $350 million worth, while Solana saw a surge from about $83 million worth then.\n\nOf course, Solana has seen its price rise dramatically of late. SOL is up over 71% in the past month, and has more than quadrupled in price over the past three months. Ethereum, by contrast, is up 9% in the last 30 days and about 44% since three months ago.\n\nSolana’s price jump may be part of the reason why the value of its NFT sales spiked in December, but it doesn’t account for the roughly tripled number of unique traders and sixfold increase on monthly NFT transactions. Also, the average NFT sale on Solana actually fell from about $74 in November to under $56 in December.\n\nThe surge in users and transactions may be due to broader momentum around Solana and hype around particular projects tied to potential access to airdrops and other perks. Tensorians, for example, the NFT project tied to leading Solana marketplace Tensor, saw $28 million worth of trades in December, while Mad Lads generated $24.5 million in trades.\n\nAD\n\nAD\n\nAccording to CryptoSlam, the top Ethereum NFT project in December was the Bored Ape Yacht Club with $19.5 million worth of NFT trades, with Pudgy Penguins following behind with about $18.3 million worth of trades.\n\nAt a glance, CryptoSlam’s data suggests that Bitcoin Ordinals trades—that is, the protocol that enables NFT-like media to be put on the Bitcoin blockchain—generated more trading volume than Ethereum and Solana combined in December, with $881.2 million worth across over 493,000 transactions.\n\nHowever, CryptoSlam tracks Bitcoin Ordinals differently than it does NFTs on other networks. The data includes trading of BRC-20 tokens, which are minted via the Ordinals protocol but function like fungible, interchangeable tokens on other chains. CryptoSlam does not track the trading of Ethereum ERC-20 tokens or Solana SPL tokens, which are effectively similar to BRC-20 tokens.\n\nUncategorized Ordinals—that is, various media assets that aren’t part of a defined project—made up about $88.5 million worth of trades in December, with the top individual Ordinals project being Bitcoin Frogs at $27.7 million.\n\nThe next-highest ranking individual Ordinals project that isn’t a BRC-20 token? Bitcoin Punks, a CryptoPunks knockoff, with less than $3.3 million worth of trades in December. Fungible token trades make up an enormous portion of Ordinals trading tracked on the platform, making it difficult to take the Bitcoin figures at face value."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8yMTEyOTgvdGhpcy13ZWVrLW9uLWNyeXB0by10d2l0dGVyLWV0aGVyZXVtLXZzLXNvbGFuYS1yaXZhbHJ5LWhlYXRzLXVw0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMTI5OC90aGlzLXdlZWstb24tY3J5cHRvLXR3aXR0ZXItZXRoZXJldW0tdnMtc29sYW5hLXJpdmFscnktaGVhdHMtdXA_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "This Week on Crypto Twitter: Ethereum vs. Solana Rivalry Heats Up - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt\n\nAfter weeks of jubilance over the Solana ecosystem’s resounding comeback—one that boosted SOL, Solana NFTs, Solana meme coins, and even the lackluster Solana smartphone—the momentum began to cool this week, triggering intensified exchanges between advocates of the blockchain and those of its dominant rival, Ethereum.\n\nOn Thursday, Ethereum co-founder Vitalik Buterin bemoaned the dying Web3 vision that originally spurred much crypto development, blaming stalled progress on the exorbitant cost of gas fees.\n\nAD\n\nAD\n\nSolana co-founder Anatoly Yakovenko was quick to add his voice to the discourse, dismissing Ethereum as a “cockroach settlement layer.”\n\nSolana founder calls ETH “a cockroach settlement layer” Solana vs Ethereum war heating up pic.twitter.com/RZQdJJipIU — borovik.eth (@3orovik) December 29, 2023\n\nThe tension was likely heightened by the declining fortunes of key Solana winners of recent weeks, most notably the once-unstoppable dog-themed meme coin BONK.\n\n$BONK if your horny Down 65% from the highs in a week. Think late shorts get pulverized — Johnny (@CryptoGodJohn) December 28, 2023\n\nAnd just in time, native tokens of Ethereum layer-2 networks such as Optimism and Arbitrum shot up over 30% and 16%, respectively—likely due to those blockchain’s lower gas fees.\n\nAD\n\nAD\n\nNo one in my feed talking about the nearly 40% gain 📈 for $OP today 👀#Optimism #Optimistic pic.twitter.com/pvklTR8RG1 — ȺSA 💎 ALGO 🟩⚡️ (@ASAgemsALGO) December 22, 2023\n\nSoon, animosity between ascendant Ethereum maximalists and defensive Solana advocates came to define almost every corner of Twitter discourse.\n\nEth vs Solana twitter fights pic.twitter.com/98TdwBqbL4 — Swop (@SwopLabs) December 28, 2023\n\nEven seemingly unrelated news events got sucked into the fray. When news broke earlier in the week that Donald Trump had started offloading millions of dollars worth of ETH from his struggling NFT projects, Twitter users were quick to view the news as a referendum on the never-ending Ethereum/Solana fracas.\n\nI bet he’s buying Solana — Priestmaux (@Priestmaux) December 28, 2023\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tc2hvcnQtc3F1ZWV6ZWQtb24tamFudWFyeS0yLWZvci1tYXNzaXZlLWxpcXVpZGF0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum short-squeezed on January 2 for massive liquidations - Finbold - Finance in Bold",
        "content": "On December 26, Finbold posted a short squeeze alert for January 2024, warning for massive possible liquidations early this month. In particular, Bitcoin (BTC) and Ethereum (ETH) were the forecasted top candidates for this speculated event, now proven accurate.\n\nThe short squeeze happened as expected, driving Bitcoin’s price to new multi-year highs above $45,900 on January 2. Ethereum was traded as high as $2,446 after Finbold’s alert, for a 10% surge one day after publishing. Interestingly, it was a similar increase to BTC’s in a week — from publishing the alert to today’s highs.\n\nIn this context, the price action liquidated 62,258 traders in the last 24 hours, for a total of $205.73 million in liquidations.\n\nA total of $127.13 million (61.7%) came directly from short positions, causing what is known as a short squeeze. Notably, one short-seller on Binance lost $10.16 million in a single liquidation with the BTC/USDT pair, according to CoinGlass data.\n\nLiquidation Heatmap on January 2. Source: CoinGlass\n\nBitcoin and Ethereum short-squeeze liquidations on January 2\n\nIn particular, Bitcoin dominated 45% (92.63 million) of the total daily liquidations on the cryptocurrency market. Of these, $74.32 million (80%) came from Bitcoin short-sellers.\n\nIt is possible to see how BTC managed to hit the previously reported liquidity zones in the weekly time frame.\n\nBTC 1-week Liquidation Heatmap. Source: Finbold\n\nOn the other hand, Ethereum had a balanced liquidation weight among short and long positions. Its $32.28 million total liquidations originated from approximately 46% shorts and 54% longs.\n\nThese short-squeeze events highlight the risks of speculating in such a volatile market. Essentially, while retail traders build their positions, professional market makers are hunting the liquidity these operations leave behind. Traders must learn how to hedge their positions through proper risk management strategies.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vbWFya2V0LW5ld3MvY3licmlhcy1ncm91bmRicmVha2luZy1tYWlubmV0LXNldC10by10cmFuc2Zvcm0tZXRoZXJldW0tZWNvc3lzdGVt0gFsaHR0cHM6Ly93d3cuY29pbnRydXN0LmNvbS9tYXJrZXQtbmV3cy9jeWJyaWFzLWdyb3VuZGJyZWFraW5nLW1haW5uZXQtc2V0LXRvLXRyYW5zZm9ybS1ldGhlcmV1bS1lY29zeXN0ZW0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Cybria’s Groundbreaking Mainnet Set to Transform Ethereum Ecosystem - CoinTrust",
        "content": "Cybria’s Groundbreaking Mainnet Set to Transform Ethereum Ecosystem Jan 2, 2024\n\nCybria’s Groundbreaking Mainnet Set to Transform Ethereum Ecosystem\n\nIn a significant stride towards reshaping the blockchain landscape, Cybria has announced the imminent launch of its revolutionary Cybria Mainnet. Commencing its journey in August 2023, Cybria set forth with a bold mission to lead a blockchain revolution, culminating in the launch of its innovative platform on December 30, 2023. This milestone is poised to elevate the Ethereum ecosystem by introducing advancements in scalability, transaction speed, and security through the fusion of blockchain technology and Artificial Intelligence (AI).\n\nPositioning Cybria as a Strategic Layer 2 Blockchain\n\nOperating strategically as a Layer 2 blockchain platform within the Ethereum network, Cybria is meticulously designed to amplify scalability and streamline transaction efficiency. Leveraging the synergies of Cybersecurity and AI technologies, Cybria not only fortifies network security but also optimizes overall performance. The integration of AI into the blockchain framework heralds a new era of possibilities, showcasing the pivotal role that AI will play in shaping various facets of Cybria.\n\nEvolution from Testnet to Mainnet Launch\n\nThe transformative journey began with the experimental Testnet v1, evolving into the more robust v2. This evolution marked the emergence of a Layer 2 Blockchain solution, distinguished by its enhanced AI capabilities. The progression from Testnet to Mainnet underscores the experimental foundations that have matured into a powerful and innovative blockchain application.\n\nAnticipation Surrounding Cybria Mainnet Launch\n\nAfter four months of eager anticipation, the Cybria Mainnet is scheduled to launch on December 30, 2023. This significant event not only marks the official unveiling of the Mainnet but also introduces key components such as the Cybria Bridge and Cybria Swap, integral elements that will animate the broader Cyba Ecosystem. The launch symbolizes a pivotal moment where the convergence of blockchain and AI is set to redefine the digital landscape.\n\nKey Components of Cybria Ecosystem\n\nThe Cybria Bridge stands as a crucial gateway facilitating the seamless transfer of digital assets and data between Ethereum and Cybria. With the Ethereum-Cyba Chain Bridge becoming available at the Mainnet release, users can experience fluid movement of assets between the two ecosystems. Simultaneously, the Cybria Swap empowers users to transact on the Cyba Chain while enhancing liquidity, presenting a comprehensive solution for those entering the Cyba ecosystem.\n\nIn summary, the impending Cybria Mainnet launch marks a significant stride towards integrating blockchain and AI, unlocking new possibilities and setting the stage for a transformative era in the Ethereum ecosystem. The introduction of innovative components underscores Cybria’s commitment to pioneering advancements that enhance the scalability, efficiency, and security of blockchain applications."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1haXJkcm9wLWluY2l0ZXMtc2NhbW1lci1hY3Rpdml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana marketing ploy leads to proliferation of scams - Blockworks",
        "content": "Solana advocates like to drive home the merits of relatively cheap transaction fees on the blockchain, especially in relation to gas paid in ether, on Ethereum mainnet.\n\nA new marketing campaign tokenizes that narrative in the form of LFG, or LessFnGas, which launched on New Year’s Day.\n\nThe project targets Ethereum users who have spent at least 2 ether (ETH) in gas fees, offering them LFG tokens through an airdrop. Holders of eligible wallets can specify a Solana address to receive the newly created token.\n\nAs of 9 am ET, the project said on X that more than 45,000 wallets had claimed the LFG token.\n\nBut while the airdrop itself was promoted by Solana co-founder Anatoly Yakovenko, scammers quickly sprung into action, setting up fake versions of the legitimate domain and seeking to phish unsuspecting claimants, often via replies in related threads on X.\n\nRead more: The 5 biggest DeFi hacks of 2023\n\nBill Lou, co-founder of Nest wallet, reported linking to a Medium post which led him to inadvertently sign a transaction that drained 52 stETH (approximately $125,000).\n\nLoading Tweet..\n\nEach post on X from the official account has scam account replies seeking to take advantage of inattentive airdrop hunters.\n\nLFG, which currently has no utility, was trading at around $0.00007 as of 12 pm ET, making a successful claim worth around $30.\n\nWhile overtly pitched as a way to onboard some Ethereum users, the dismissive tone of the campaign has alienated others.\n\n“We understand that ETH has led the way for many years,” LessFnGas wrote. “The fact of the matter is, the tech is outdated and for things to move forward, something must be left behind.”\n\nRead more: The 3 biggest DeFi innovations of 2023\n\nThe team of 10, which is not disclosed, has reserved for itself 10% of the 1 trillion tokens created (currently worth about $7 million), and promises a second airdrop for those claimants who supply liquidity for the token on decentralized exchanges.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3VuY2hhaW5lZGNyeXB0by5jb20vYXJiaXRydW1zLW5hdGl2ZS10b2tlbi1zdXJnZXMtMzAtaW4tYS13ZWVrLXRvLWFuLWFsbC10aW1lLWhpZ2gtZnVlbGVkLWJ5LW1hcmtldC1leHBlY3RhdGlvbnMtb2YtZWlwLTQ4NDQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum's Native Token Surges 30% in a Week to an All-Time High, Fueled by Market Expectations of EIP-4844 ... - Unchained",
        "content": "ARB’s milestone comes less than one week after OP, the token of rival layer-2 rollup Optimism, reached an all-time high.\n\nThe native governance token for the blockchain Arbitrum (disclosure: sponsor of Unchained) reached an all-time high Tuesday morning.\n\nARB climbed to a peak of $1.83, growing nearly 13% in the past 24 hours and about 30% in the past seven days, according to data from CoinGecko. The token has since slid to $1.71 at press time.\n\nArbitrum is a layer 2 scaling technology that aims to make Ethereum more efficient by bundling many transactions and posting them on Ethereum’s digital ledger book. Through Arbitrum, users can execute transactions on Ethereum more quickly and cheaply.\n\nWith more than $10 billion in value locked in its smart contracts, Arbitrum is the largest layer 2 rollup, data from L2BEAT shows.\n\nThe ARB token, airdropped to community members in March 2023, is a governance token that enables token holders to vote on protocol upgrades. Its all-time high occurred less than one week after the OP token from rival layer 2 rollup Optimism reached an all-time high.\n\nThe surge in both governance tokens stems from the market’s expectations for Ethereum improvement proposal (EIP) 4844, said Steve Kim, CEO and co-founder of crypto research firm Four Pillars.\n\n\n\nThe “market expects EIP-4844 to be the catalyst for rollup scalability,” wrote Kim to Unchained on Telegram. “ETH people believe that 4844… can increase the TPS [transaction per second] of rollups and at the same time reduce the gas fee (because after 4844, rollups don’t have to compete against ETH native apps to use ETH blockspace), so it is bullish for L2s in general.”\n\nEthereum researcher Dankrad Feist and Ethereum co-founder Vitalik Buterin are two of the co-authors of EIP-4844. The EIP will employ proto-danksharding, a concept named after Feist that is designed to increase the total number of transactions Ethereum could process.\n\n“Danksharding is the full realization of the rollup scaling,” Ethereum Foundation posted on its blog. “Danksharding will bring massive amounts of space on Ethereum for rollups to dump their compressed transaction data. This means Ethereum will be able to support hundreds of individual rollups with ease and make millions of transactions per second a reality.”\n\nEthereum developers will implement EIP-4844 on Jan. 17, when Dencun, the next major Ethereum upgrade, will go live on testnet Goerli, Ethereum educator Anthony Sassal posted on X."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYXQtYS10aXBwaW5nLXBvaW50LWNhbi1zdXJnaW5nLW9wZW4taW50ZXJlc3QtZnVlbC1ldGgtcmFsbHktcGFzdC0zMDAwL9IBdmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYXQtYS10aXBwaW5nLXBvaW50LWNhbi1zdXJnaW5nLW9wZW4taW50ZXJlc3QtZnVlbC1ldGgtcmFsbHktcGFzdC0zMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price At A Tipping Point, Can Surging Open Interest Fuel ETH Rally Past $3,000? - CoinGape",
        "content": "Ethereum price steadied the uptrend, starting the New Year bullish with a breakout above $2,400. The leading smart contracts token extended the upper leg to $2,432, compelling investors to believe in the likelihood of a breakout to $3,000.\n\nHowever, caution is advised especially among traders who intend to enter new long positions and those contemplating either closing current open positions or hanging onto the bullish theory.\n\nadvertisement\n\nEthereum Price Prediction: What Will It Take To Reach $3,000?\n\nCrypto analyst Rekt Capital said via X that Ethereum “may have no choice” but to rally in tandem with Bitcoin, which broke above $45,000 on the first day of the New Year.\n\nThe analysts highlighted a breakout from a period of consolidation suggesting that it is only a matter of time before the tailwind behind ETH price intensifies resulting in a remarkable rally.\n\nMeanwhile, Ethereum price is trading at $2,369 amidst a correction from the previous highs. The Relative Strength Index (RSI) reveals that sellers are gaining ground and fast. With a strength of 59 from highs close to the overbought region, the path with the least resistance could remain downwards.\n\nIf the short-term support at $2,360 holds, Ethereum price might cut short the forming downtrend while favoring the continuation of the uptrend to $3,000.\n\nThe 20 Exponential Moving Average (EMA) (in blue) and the 50-day EMA (in red) are in line to absorb the selling pressure if the decline intensifies over the coming sessions.\n\nThe same RSI is slightly bullish in longer timeframes like on the daily chart. Based on the trend strength indicator, those holding Ethereum do not need to worry about the lower time frames’ ups and downs but focus on the potential gains likely to follow the consolidation between $2,200 support and $2,400 resistance.\n\nThe 20-day EMA reinforces support at $2,280 while the 50-day EMA holds to provide support at $2,179. If Ethereum price overshoots the pivotal level at $2,000, the 200-day EMA (purple) would be in line to prevent losses from reaching the local support at $1,850.\n\nAn incoming buy signal from the Moving Average Convergence Divergence (MACD) indicator could help steady the bullish thesis. As traders and investors seek more exposure to ETH, the path with the least resistance is bound to remain upwards.\n\nRecommended for you: Ethereum (ETH) Price Poised for 2-3x Gains As Per These On-Chain Indicators\n\nEthereum Open Interest Above $7.5B\n\nThe Ethereum futures open interest (OI) is growing steadily to hold above $7.5 billion on Tuesday, according to data provided by Coinglass.\n\nThe persistent rise in OI interest signals that investors entertain a positive outlook for ETH. This backs the bullish narrative in the short term, with Ethereum likely to blast off above $3,000 before the end of January.\n\nRelated Articles"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1tYXJrZXQtcmFsbHktaGVyZXMtd2h5LWJ0Yy1ldGgtc29sLXhycC1hbmQtb3RoZXJzLWFyZS11cC10b2RheS_SAV9odHRwczovL2NvaW5nYXBlLmNvbS9jcnlwdG8tbWFya2V0LXJhbGx5LWhlcmVzLXdoeS1idGMtZXRoLXNvbC14cnAtYW5kLW90aGVycy1hcmUtdXAtdG9kYXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Crypto Market Rally: Here's Why BTC, ETH, SOL, XRP, And Others Are Up Today - CoinGape",
        "content": "The global crypto market cap increased more than 6% to $1.75 today, reaching the May 2022 level, backed by a 30% rise in total crypto market volume in the last 24 hours. Bitcoin dominance rises again to 50.94% after a splendid 8% rally over the last day. On the other hand, Ethereum (ETH) price soars 7% to a hit of $2,428 and gaining in momentum towards 3,000.\n\nThe broader crypto market rally began on New Year’s Day as positive sentiment rose ahead of a plausible spot Bitcoin ETF approval by the U.S. Securities and Exchange Commission (SEC) near January 10, 2024.\n\nadvertisement\n\nWhy Bitcoin and Crypto Market Are Rallying?\n\nAs predicted by CoinGape on Dec 30, the crypto market started 2024 with a bullish rally despite concerns over Bitcoin and Ethereum open interests (OI) getting wiped out completely during an $11 billion annual expiry last week. Bitcoin and Ethereum futures and options OI started rising gradually.\n\nThe crypto market saw over $160 million in liquidation in the last 24 hours. Coinglass data indicate massive shorts liquidation of over $130 million today. More than 46k traders were liquidated in the last 24 hours, with the largest single liquidation order on Binance’s BTCUSDT worth $10.16 million. As a result of over $200 million of shorts liquidation, the broader crypto market is “green” today.\n\nIn addition, the total Bitcoin futures OI on all exchanges skyrockets almost 10% to $20 billion. BTC OI on CME and Binance jumped 7.76% and 14.20%, respectively. Also, BTC options data saw 70% of calls, with the most volume in the last 24 hours.\n\nThe total Ethereum futures OI is $$8.24 billion, up 9% in the last 24 hours. ETH OI on the top three futures crypto exchanges Binance, Bybit, and OKX rose 9-11%. Also, ETH options data saw 75% of calls in the last 24 hours.\n\nCoinGape also reported Bitcoin funding rate reached a staggering 66%, which shows that the bulls are willing to hold their positions. Matrixport reported that Bitcoin mining companies are showing a trend of limiting supply around the upcoming halving cycles, anticipated for April 2024.\n\nCoinbase Premium Gap started to increase again on Jan 2, suggesting strong Bitcoin buying pressure on Coinbase. BTC price started to move suddenly as traders and investors made new bets.\n\nAlso Read: Solana Labs Co-Founder Addresses Community Concerns Over Ecosystem Security\n\nCrypto Market Rally: Bitcoin and Altcoins Prices\n\nBTC price jumped 8% in the past 24 hours, with the price currently trading at $45,765. The 24-hour low and high are $42,547 and $45,899, respectively. Furthermore, the trading volume has increased by 92% in the last 24 hours, indicating a rise in interest among traders.\n\nEthereum climbed 7% and SOL skyrocketed 12% amid rising activity on the chain. Whereas, other altcoins XRP, ADA, AVAX, DOGE, DOT, and MATIC pumped 3-7% in the last 24 hours amid a broader recovery.\n\nAlso Read: Binance Burns 5.57 Billion Terra Luna Classic, LUNC And USTC Prices Rise Over 7%"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZ2xvYmFsY3J5cHRvLnR2L3ZpdGFsaWstYnV0ZXJpbi1sZWFkcy1ldGhlcmV1bS1pbnRvLWEtbmV3LWVyYS13aXRoLTIwMjQtcm9hZG1hcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Leads Ethereum into a New Era with 2024 Roadmap - Global Crypto",
        "content": "Reading Time: 2 minutes\n\nIn a pivotal announcement for the blockchain community, Ethereum co-founder Vitalik Buterin recently shared the Ethereum roadmap for 2024, underscoring both its continuity and minor adjustments from the previous year’s plans. This strategic outline, revealed through a series of posts on X (formerly Twitter), focuses on six key elements: the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge. Each of these components represents a crucial step in Ethereum’s evolving journey.\n\nAt the heart of the roadmap is the Merge, a fundamental change already implemented in September 2022, transitioning Ethereum from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism. This shift has significantly reduced the network’s overall energy consumption, marking a milestone in Ethereum’s commitment to sustainability.\n\nFurther developments in the roadmap include enhancements to Ethereum’s single-slot finality (SSF). SSF is becoming increasingly central to Ethereum’s PoS design, offering a straightforward solution to many current challenges in the network’s architecture. Buterin emphasized the growing importance of SSF, stating, “The role of single slot finality (SSF) in post-Merge PoS improvement is solidifying. It’s becoming clear that SSF is the easiest path to resolving a lot of the Ethereum PoS design’s current weaknesses.”\n\nMoreover, Buterin expressed a desire to revive the original ethos of the “cypherpunk” revolution within the blockchain space. Cypherpunks advocate for the use of encryption and technology to protect privacy, especially against government surveillance. Ethereum, initially conceived as a “public decentralized shared hard drive” facilitating peer-to-peer messaging and decentralized file storage, had seen this vision wane with the platform’s increasing financialization since 2017. In response, Buterin highlighted the growing prominence of rollups, zero-knowledge proofs, account abstraction, and second-generation privacy solutions, which align with the principles of cypherpunk values.\n\nThese developments not only signify Ethereum’s commitment to technological innovation but also its dedication to upholding the foundational principles of blockchain technology: decentralization, security, and privacy."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vdGhlbWVya2xlLmNvbS9uZXdseS1sYXVuY2hlZC1wdXNoZC1wdXNoZC1zdXJnZXMtaW4tcHJlc2FsZS13aGlsZS1zb2xhbmEtc29sLWFuZC1ldGhlcmV1bS1ldGgtZHJvcC1pbi12YWx1ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Newly Launched Pushd (PUSHD) Surges In Presale While Solana (SOL) And Ethereum (ETH) Drop In Value - The Merkle Hash",
        "content": "About The Author\n\nNull Transaction PR is a cryptocurrency marketing group responsible for article distribution across a myriad of news sites. If you're looking to advertise with us, contact us by email at [email protected] or visit our website."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvLm5ld3MvYW5kcmUtZHJhZ29zY2gtc2F5cy1ldGhlcmV1bS13aWxsLW91dHBlcmZvcm0tYml0Y29pbi1pbi0yMDI0LWFuYWx5c3RzLWZvcmVjYXN0LW1lbWUtbW9ndWxzLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "André Dragosch says Ethereum will outperform Bitcoin in 2024; analysts forecast Meme Moguls prices - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nThe head of research at ETC Group, André Dragosch, has predicted that Ethereum will outshine Bitcoin in 2024. Another analyst said Bitcoin will rise to $130k in 2025. Meanwhile, another one said Meme Moguls could reach $0.1 in 2024.\n\nEthereum may outperform Bitcoin in 2024\n\nAndré Dragosch, the head of research at ETC Group, believes that Ethereum has a bright future.\n\nHe praised Ethereum for being a trailblazer in the smart contracts platform.\n\nDragosch predicts Ethereum to recover in 2024.\n\nYou might also like: Analyst says Ethereum on clear path to $2,700\n\nAccording to Dragosch, several things affect Ethereum.\n\nOne of the crucial ones is the “burn mechanism” introduced by Ethereum Improvement Proposal EIP-1559 in August 2021.\n\nThis feature is expected to decrease ETH’s overall supply, which, according to Dragosch, could support prices.\n\nDragosch said combining reduced supply and staking rewards could help Ethereum outperform Bitcoin.\n\nEthereum is currently hovering around $2,300 when writing as bulls aim for $2,500.\n\nMeme Moguls to $0.1 in 2024?\n\nMeme Moguls is an online platform that connects game lovers and meme enthusiasts.\n\nOne of its popular features is the “wealth leaderboard,” which rewards the top 20 players with cash prizes every day.\n\nUsers can invest 20% of their virtual money in a single investment to encourage diversification.\n\nMeme Moguls also offers a virtual world, “Mogul World”, where players can mine tokens, stake them, and interact with others.\n\nYou might also like: Analyst bullish on Fantom; Aptos and Meme Moguls also shine\n\nThe platform’s native token, MGLS, is trading for $0.0025 but could reach $0.1 by 2024.\n\nMeme Moguls has raised over $1 million in the ongoing presale.\n\nBitcoin may reach $130,000\n\nA crypto analyst, CryptoCon, believes Bitcoin could reach $130,000 by November or December 2025.\n\nAbout 2 Weeks ago, I made the claim that #Bitcoin topped out at 45k, and I am still sticking to it.\n\n\n\nThe LMACD adds another layer of confirmation with a cross of the Descending Cycle Mid-Top Trend.\n\n\n\nSo if this isn't the cycle top, why does this matter?\n\n\n\nThe mid-top typically… pic.twitter.com/ex4J4edn5M — CryptoCon (@CryptoCon_) December 26, 2023\n\nHowever, he also thinks there might be a significant drop before it reaches that high.\n\nYou might also like: Bitcoin Lightning Network transfer capacity continues growing\n\nIn his view, Bitcoin may cool off by between 38% and 52%, lasting for about five to six months, ending around May 2024.\n\nDespite predicting this dip, CryptoCon remains optimistic about Bitcoin’s long-term growth and noted that there would be an upward surge after that.\n\nConclusion\n\nBitcoin and Ethereum are established projects.\n\nHowever, emerging players like Meme Moguls plan to offer a unique platform for trading and gaming.\n\nLearn more about the MGLS here:\n\nVisit Meme Moguls | Join the Community\n\nYou might also like: Analyst predicts Dogecoin to reach $0.115, Meme Moguls’ prospects bullish\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3Mvdml0YWxpay1idXRlcmluLW1hZGUtMTltLXdpdGhpbi13ZWVrLWFtaWQtbWFya2V0LWVudGh1c2lhc20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin made $19m within week amid market enthusiasm - crypto.news",
        "content": "The total value of cryptocurrencies held by Ethereum co-founder Vitalik Buterin has increased by $19 million over the past week amid a broader resurgence in the digital asset markets.\n\nData provided by blockchain analytics firm Arkham Intelligence shows that the balance of Buterin’s known crypto wallets rose from $561 million on Dec. 26 to $580 million on Jan. 2 — an increase of nearly 3.4%. The gains coincide with a spike in the price of Ethereum (ETH) and other major cryptocurrencies like Bitcoin (BTC).\n\nVitalik Buterin’s crypto wallets’ value chart. | Source: Arkham Intelligence\n\nYou might also like: Vitalik Buterin reveals 6 main focuses for Ethereum in 2024\n\nButerin’s holdings are dominated by Ethereum, which explains the gain. Ethereum climbed from around $2,218 to nearly $2,370 over the same period, increasing around 6.6%.\n\nEthereum is the only part of this $580 million portfolio worth millions, followed by $635,000 of Kyber Network (KNC) and $456,000 of Wrapped Ethereum (WETH). The development follows Buterin’s recent criticism for proposing cutting Ethereum’s security to increase the network’s efficiency.\n\nVitalik Buterin is a Russian-Canadian computer programmer best known as Ethereum’s co-founder. He was born in 1994 in Kolomna, Russia, and moved with his family to Canada when he was six. As a child, Buterin displayed an aptitude for math, programming, and economics. He first became interested in cryptocurrency and blockchain technology as a teenager.\n\nButerin co-founded Bitcoin Magazine, one of the first serious publications dedicated to cryptocurrencies, and in 2013, Buterin published the white paper for Ethereum. He argued Bitcoin needed a scripting language for application development. Ethereum launched in 2015 after starting development in 2014 with Buterin as a co-founder.\n\nFollow Us on Google News"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGUtcmFjZS10by10aGUtYmlnZ2VzdC1ibG9ja2NoYWluLWJ5LXR2bC1pbi0yMDIzLXdoby13b24tZXhjbC1ldGhlcmV1bS_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vdGhlLXJhY2UtdG8tdGhlLWJpZ2dlc3QtYmxvY2tjaGFpbi1ieS10dmwtaW4tMjAyMy13aG8td29uLWV4Y2wtZXRoZXJldW0vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "The Race to the Biggest Blockchain by TVL in 2023: Who Won? (Excl. Ethereum) - CryptoPotato",
        "content": "TL;DR\n\nShifts in Blockchain TVL: The year 2023 saw changes in the total value locked (TVL) rankings among various blockchain platforms, with significant fluctuations and new entries making an impact.\n\nHighlights in Blockchain Performance: Certain networks gained popularity and development recognition, outperforming rivals in aspects like Google searches, NFT sales, and on-chain trading volume.\n\nCryptocurrency Value Fluctuations: There were notable increases in the prices of some cryptocurrencies, influenced by factors like TVL dynamics and market trends, though the direct correlation between TVL and price is not always clear.\n\nShifting Positions Throughout 2023\n\nAccording to Coin98 Analytics, the blockchain platform with the highest total value locked (TVL) as of the end of 2023 is Tron (over $8 billion). BNB Chain ($3.5 billion) and Arbitrum ($2.4 billion) rounded up the top 3 list, while Solana comes next with $1.4 billion. The analysis excludes Ethereum, whose figure reached almost $30 billion.\n\nHowever, the current standings have not always been the case. The three leading platforms retained their positions for the entire year, although BNB Chain was first at the beginning, whereas Tron came second.\n\nSolana was at the bottom in January 2023 with a TVL of $210 million. As the year passed, new blockchain networks emerged and shifted the landscape. One example is Coinbase’s layer-2 solution – Base – which saw the light of day in August. Its TVL gradually increased throughout 2023, reaching almost $440 million by the end.\n\nFor its part, Blast – an upcoming L2 blockchain – made waves in the industry in the final quarter, positioning itself among the leaders and finishing the year in the fifth spot with a TVL of over $1 billion. The rising popularity of the network led to a phishing attack in November, following which a victim parted with more than $130,000. Blast’s mainnet launch is scheduled for February this year.\n\nOptimism, Avalanche, Polygon, and Cardano are the remaining blockchains from the top 10. Cardano started the year with less than $50 million and crossed the finish line at above $400 million.\n\nAt the end of 2023, besides #Ethereum, here are the top 10 blockchains with the highest TVL: Tron\n\nBNB Chain\n\nArbitrum\n\nSolana\n\nBlast\n\nOptimism\n\nAvalanche\n\nPolygon\n\nBase\n\nCardano pic.twitter.com/jvgGvJCwKN — Coin98 Analytics (@Coin98Analytics) December 31, 2023\n\nSome cryptocurrencies, including Solana’s SOL and Cardano’s ADA, have charted notable price increases last year. The former surged from less than $10 to almost $125 by Christmas, whereas the latter experienced a 150% surge to above $0.60.\n\nWhile the rising TVL could be a factor for those spikes, the relationship is not always directly proportional. Total value locked refers to the entire amount of crypto assets deposited in a particular DeFi protocol and might be considered a sign of trust and stability in the relevant network.\n\nOn the other hand, rising TVL could be a result of a bull market. In this case, new funds do not enter the ecosystem, but the value of the locked assets heads north as prices do so too.\n\nSolana and Cardano in the Spotlight\n\nThose two networks have been particularly intriguing to industry participants lately due to their achievements toward the year’s end. Solana surpassed Ethereum regarding Google searches in mid-December, becoming more popular in countries like Spain and the Philippines.\n\nIt outpaced its rival on the non-fungible token field, too. Its NFT sales volume exploded to $75 million on a weekly basis last month versus $72 for Ethereum. Additionally, Solana’s on-chain trading volume peaked above $2.6 billion on December 22, while Ethereum recorded $1.6 billion on that day.\n\nFor its part, Cardano was highlighted as the top network by development activity in the last 30 days. This happened at the end of December, with Polkadot, Kusama, and Avalanche next in line."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vaW52ZXp6LmNvbS9uZXdzLzIwMjQvMDEvMDIvc29sYW5hLXN1cnBhc3Nlcy1ldGhlcmV1bS1hcy1hLW5ldy1hbHRjb2luLWpvaW5zLXRoZS1jb250ZXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana surpasses Ethereum as a new altcoin joins the contest - Invezz",
        "content": "As 2024 starts, Solana (SOL) has emerged as a frontrunner, surpassing Ethereum in stablecoin volume and dominating search interest. Simultaneously, Pullix, an upcoming hybrid exchange, made waves with its “Trade-To-Earn” PLX token presale.\n\nLet’s delve into these significant developments that have captivated the attention of crypto enthusiasts and investors alike.\n\nSolana surpasses Ethereum in stablecoin volume\n\nCopy link to section\n\nIn a monumental stride, Solana has outpaced Ethereum in stablecoin transaction volume. While Ethereum remains the most dominant chain when it comes to the total market cap of the issued stablecoins according to DeFilama data, the amount of stablecoin transactions carried out on Ethereum over the last seven days has surpassed that carried out on Ethereum according to data on Artemis.\n\nScreenshot of Stablecoin transfer volume on Artemis terminal\n\nAccording to the information from Artemis, the volume of stablecoins transacted on Solana over the last seven days stands at approximately $103 billion compared to Ethereum’s $90.87 billion.\n\nThe volume of stablecoin transferred on different chains in the last 7 days\n\nOnce hailed as an “Ethereum killer,” Solana has solidified its position as a formidable blockchain player, showcasing remarkable growth and user engagement. The blockchain’s vibrant ecosystem, marked by activities ranging from inscriptions craze to memecoin mania, contributed to this milestone.\n\nFeatured Broker Looking to invest? Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 71% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. Open your account CFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 71% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money. Ad\n\nSolana’s surge in stablecoin volume underscores its growing popularity, with traders finding value in its robust infrastructure and diverse offerings, including the trending BONK meme coin and the Solana Saga phone. Airdrops like the Jito Airdrop and the rise of decentralized exchanges (DEX) on Solana have also fuelled the blockchain’s ascent, pushing its market cap beyond $50 billion. This momentum positions SOL as a prominent player in the cryptocurrency market.\n\nAre you looking for fast-news, hot-tips and market analysis? Sign-up for the Invezz newsletter, today.\n\nSolana (SOL) overtakes Ethereum in Google search\n\nCopy link to section\n\nBeyond transactional prowess, Solana has eclipsed Ethereum in search interest, signalling a shift in crypto enthusiasts’ curiosity. Google Trends data reveals that from December 17 to December 23, the term “Solana” garnered a higher search interest score than “Ethereum” in various regions, including Spain and the Philippines.\n\nThis surge in search interest can be attributed to Solana’s recent achievements, including surpassing Ripple’s XRP and Binance’s BNB in market capitalization. The blockchain’s price appreciation, decentralized exchanges recording over $28 billion in volume in December alone, and the anticipation of upcoming token airdrops have contributed to this heightened interest in Solana.\n\nPullix (PLX): new altcoin contending with SOL for top spot\n\nCopy link to section\n\nAmidst the excitement surrounding Solana (SOL), Pullix (PLX) has emerged as a noteworthy contender.\n\nPullix, an innovative hybrid exchange scheduled to launch in January 2024, is set to revolutionize the trading landscape by seamlessly blending centralized and decentralized exchange features. The platform addresses critical issues such as liquidity problems in DeFi, offering a unified solution for traders.\n\nAt the heart of Pullix’s ecosystem is the PLX token, dubbed the crypto market’s first “Trade-to-Earn” cryptocurrency, which is currently in the presale stage. The token empowers users to earn instant rewards for trading on the platform and completing challenges. The presale of PLX has generated significant buzz, with analysts predicting a 580% rise during the presale and a potential 100x increase upon launch.\n\nThe PLX token’s unique revenue-sharing mechanism sets Pullix apart, allowing token holders to profit from the daily revenue of the exchange and earn a fixed passive income. By incentivizing users to provide liquidity, Pullix aims to enhance liquidity and offer more competitive prices compared to other platforms, further attracting traders to its ecosystem.\n\nConclusion\n\nCopy link to section\n\nIn the ever-evolving landscape of cryptocurrencies, Solana’s stellar performance and Pullix’s groundbreaking approach signify a shift towards innovation and user-centric platforms.\n\nSolana’s dominance in stablecoin volume and search interest, coupled with Pullix’s presale success and the introduction of the PLX token, demonstrate the dynamism and potential within the crypto market.\n\nThis article is a collaboration between our Editors and our Partners, and it may contain sponsored advertising content and links. The content is not intended as financial advice and is for informational purposes only."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2ZpbmJvbGQuY29tL3NpZ25zLXBvaW50aW5nLXRvLWFuLWV0aGVyZXVtLWV0aC1jb3JyZWN0aW9uLWJlbG93LTJrLWRlY2VudHJhbGFuZC1tYW5hLWFuZC1yZWJlbC1zYXRvc2hpLXJibHotcmVhZHktZm9yLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Signs Pointing to an Ethereum (ETH) Correction Below $2K; Decentraland (MANA) and Rebel Satoshi ($RBLZ) Ready ... - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nIn the ever-fluctuating world of cryptocurrencies, market trends can shift rapidly. Recently, Ethereum showed signs of a potential correction below the crucial $2K mark. However, as Ethereum contemplates its next move, Decentraland and Rebel Satoshi seem poised for an upward surge. Let’s delve deeper into these developments.\n\nEthereum’s Uncertain Waters\n\nEthereum, one of the top crypto coins globally, recently faced turbulence as its price slipped below the pivotal $2,000 level. This dip followed a robust rally, raising questions about the cryptocurrency’s immediate trajectory. Market observers keenly await its next move, with many pointing to a potential correction phase.\n\nOn closer inspection, the Relative Strength Index (RSI) signalled an overbought condition, hinting at the looming correction. However, the current scenario also showcases a bullish flag formation. Such patterns typically suggest a market correction rather than a full-fledged bearish trend. If Ethereum manages to break above this flag, it could indicate a renewed bullish momentum.\n\nDecentraland’s Meteoric Rise\n\nWhile Ethereum grapples with its next steps, Decentraland (MANA) emerges as a beacon of hope for investors. Often regarded as one of the top altcoins, MANA has witnessed a staggering 47% surge in recent weeks. Lately, it outperformed all other top 100 cryptocurrencies, marking an impressive 12% gain.\n\nWhile the exact catalyst behind MANA’s surge remains elusive, the broader resurgence of the cryptocurrency market plays a significant role. With the gaming and metaverse sectors gaining traction, Decentraland stands at the forefront, showcasing its potential as a top crypto to buy.\n\nRebel Satoshi’s Rising Potential\n\nAnother notable mention in the crypto realm is Rebel Satoshi ($RBLZ). With Citizens Round 3 that has already garnered over 82 Million $RBLZ and raised $1,000,000, Rebel Satoshi is making waves. The milestone of exceeding a sale value of $1 million further cements its position in the crypto sphere.\n\nBuilt on the Ethereum network, Rebel Satoshi leverages one of the most secure blockchains available. For crypto beginners and seasoned investors alike, the security and potential of Ethereum-based projects make $RBLZ an enticing prospect. Furthermore, with its smart contracts audited by the reputable Source Hat, investors can find assurance in its reliability.\n\nFor those pondering which crypto to buy today for long-term gains, Rebel Satoshi offers compelling reasons. Its foundation on Ethereum ensures robust security, while its rising popularity signifies growing market trust. As discussions about the best cryptocurrency to invest in gain momentum, $RBLZ’s performance and potential cannot be overlooked.\n\nConclusion and Investment Call\n\nWhile Ethereum navigates its corrective phase and Decentraland basks in its recent gains, Rebel Satoshi emerges as a promising contender in the crypto arena. With its presale success and strong foundation, $RBLZ offers a unique investment opportunity. As always, potential investors should conduct their research, but with the current momentum and backing, Rebel Satoshi presents a compelling case as a top crypto to buy.\n\nFor the latest updates and more information, be sure to visit the official Rebel Satoshi Presale Website or contact Rebel Red via Telegram"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ob3N0ZWQtdGVsbG9yLXB1bXBzLWFuZC1kdW1wcy03My1tbG4tbGlxdWlkYXRlZC_SAVNodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0taG9zdGVkLXRlbGxvci1wdW1wcy1hbmQtZHVtcHMtNzMtbWxuLWxpcXVpZGF0ZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-hosted Tellor pumps and dumps, $73 mln liquidated - AMBCrypto News",
        "content": "TRB marked a 52-week high but was later subject to a massive dump.\n\nOpen Interest increased as traders side with short positions.\n\nMarket participants who tried to capitalize on the rise in Tellor’s [TRB] price were met with a big shock as 2023 closed.\n\nOn the 31st of December, the price of TRB increased and tapped $600. In the process of the rally, some traders wanted to have a piece of the cake.\n\nHowever, TRB’s price crashed moments later. This dump caused a $73 million liquidation. Coinglass showed the wipeout was the highest of any crypto contract in the last 24 hours.\n\nHold the Tellor team responsible\n\nAt press time, TRB’s price was $198.35, indicating that the token was tilting toward the upside again. The Tellor project is not as popular as other coins in the market. As of this writing, it was number 124 on the market cap standings.\n\nPer its fundamentals, AMBCrypto discovered that it was built on the Ethereum [ETH] blockchain. It also serves as an infrastructure for making off-chain data available on smart contracts.\n\nHowever, it seems that the Tellor team was not just interested in the utility of the project.\n\nThis was because of a recent revelation by Lookonchain. According to Lookonchain, the pump and dump of the token could be a case of manipulation by the Tellor team.\n\nThe smart money handle posted that the team deposited $2.4 million of TRB shortly after the price started to rise.\n\nIn the past 24 hours, $TRB soared to $600 and then plummeted to $137, causing $68M of assets to be liquidated, making it the most liquidated token. We noticed that the #Tellor team deposited 4,211 $TRB($2.4M) after the price of $TRB skyrocketed. Address:https://t.co/efHPXCiMiG pic.twitter.com/IBty2Wf2gI — Lookonchain (@lookonchain) January 1, 2024\n\nSo, it is likely that the team was also involved in dumping the tokens and putting retail traders in pain.\n\nShorts plan to thrive but…\n\nFurthermore, the Open Interest in TRB had increased to $423.24 million. Open Interest is the value of outstanding derivative contracts in futures trading.\n\nIncreasing Open Interest (OI) implies that new money has flowed into the market. On the other hand, a decreasing OI implies that traders are closing positions and taking out their liquidity.\n\nSo, the spike in the 8-hour Open Interest suggests that there were some traders with open TRB contracts.\n\nIs your portfolio green? Check out the TRB Profit Calculator\n\nBut what positions are these traders taking? This is where the OI-Weighted Funding Rate comes in. Funding Rate gives an insight into the sentiment traders have. If the Funding Rate is positive, traders are bullish and have many long positions open.\n\nHowever, TRB’s Funding Rate at press was down to -1.937%. This reading indicated that short positions were dominant in the market at press time. But with the price in a recovery phase, it might not be a good idea to short TRB in the meantime."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9jYXJkYW5vLXByaWNlLWFuYWx5c2lzLWFkYS1wcmljZS1wb2lzZWQtZm9yLTQwLXJhbGx5LXNvb24v0gFjaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2NhcmRhbm8tcHJpY2UtYW5hbHlzaXMtYWRhLXByaWNlLXBvaXNlZC1mb3ItNDAtcmFsbHktc29vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Cardano Price Analysis: 40% Rally on the Cards, Ethereum to Be Left Behind? - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nStory Highlights After a long bearish period, ADA soared over 170% in Q4 2023 thanks to increased liquidity and DeFi activity.\n\nCardano aims to compete with Ethereum in DeFi, achieving $424 million TVL, but still trailing behind Ethereum's dominance.\n\nTechnical indicators suggest further bullish momentum for ADA, with potential to reach the 80-cent mark.\n\nCardano (ADA), a prominent smart contract-focused cryptocurrency, has demonstrated a remarkable recovery, marking a significant shift in its market trend. Since the end of the 2021 bull run, ADA has been experiencing a bearish trend. However, closing the fourth quarter of 2023, it has shown a bullish outlook, registering an impressive gain of over 170%.\n\nThe renewed interest in ADA’s value can be mainly credited to growing liquidity and increased trading on both centralized and decentralized financial (DeFi) platforms. Notably, the open interest in ADA has risen sharply, moving from under $100 million in October to over $300 million recently.\n\nNow, what next? Read on to discover more about your favourite cryptocurrency!\n\nAmbitions Run High\n\nCardano’s goal to challenge Ethereum’s leading position in the DeFi sector is gaining momentum. By emphasizing the broader adoption of smart contracts, Cardano has secured a Total Value Locked (TVL) of approximately $424 million. Although this is a significant achievement, it still trails behind Ethereum’s impressive $29.9 billion.\n\nThe rising popularity of Cardano’s DeFi protocols and meme coins, especially Snek (SNEK), has sparked discussions within the crypto community.\n\nAlso Read: Which Altcoin Will Hit $1 in January 2024: Cardano (ADA) or Ripple (XRP)?\n\nADA’s Potential Growth and Technical Analysis\n\nLooking at ADA’s short-term price trends, technical experts are optimistic. The daily chart shows an ascending triangle pattern, indicating potential bullish movement. Captain Faibik, a respected crypto analyst on the X platform, suggests that if ADA can close above this pattern’s upper boundary, it might aim for the 80-cent level.\n\nFurther supporting this positive view is ADA’s weekly Relative Strength Index (RSI), which has surpassed the key level of 70 for the first time since 2021. Additionally, analyzing ADA’s weekly chart using the Elliott wave theory suggests that the cryptocurrency is setting up for a third bullish phase, possibly similar to Bitcoin’s past performance. Considering these technical insights and the evolving market conditions, ADA’s future looks promising for many in the crypto space.\n\nAlso Read: Top Cryptocurrency Picks for January 2024\n\nCardano’s on fire, but can it dethrone Ethereum? Share your thoughts."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5uZnRjdWx0dXJlLmNvbS9uZnQtbmV3cy8yMDI0LXRoZS15ZWFyLW9mLWFsdGVybmF0aXZlLWxheWVyLTFzLXJpc2luZy1pbi10aGUtbmZ0LXJlYWxtLXNvbC10ZXpvcy1hbmQtc2VpLWxlYWQtdGhlLWNoYXJnZS_SAYoBaHR0cHM6Ly93d3cubmZ0Y3VsdHVyZS5jb20vbmZ0LW5ld3MvMjAyNC10aGUteWVhci1vZi1hbHRlcm5hdGl2ZS1sYXllci0xcy1yaXNpbmctaW4tdGhlLW5mdC1yZWFsbS1zb2wtdGV6b3MtYW5kLXNlaS1sZWFkLXRoZS1jaGFyZ2UvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "2024: The Year of Alternative Layer 1s Rising in the NFT Realm – SOL, Tezos, and SEI Lead the Charge - NFT Culture",
        "content": "The Dawn of a New Era in NFTs: Exploring the Rise of Alternative Layer 1s\n\nAs we venture into 2024, the NFT landscape is undergoing a seismic shift, with alternative Layer 1 blockchains like Solana (SOL), Tezos, and SEI emerging as significant players. This shift marks a pivotal moment in the evolution of the NFT ecosystem, diversifying the platforms on which digital art and collectibles thrive.\n\n1. Diversification Beyond Ethereum: A Breath of Fresh Air for NFTs\n\nHistorically, Ethereum has been the dominant force in the NFT space. However, alternative Layer 1s like SOL, Tezos, and SEI offer fresh opportunities. Their unique features, such as lower transaction fees and faster processing times, make them attractive to artists and collectors seeking new avenues for NFT creation and trade.\n\n2. Niche Communities and Innovative Use-Cases\n\nThese alternative blockchains are carving out niche communities and fostering innovative use-cases. For instance, Tezos has become a hub for eco-conscious artists due to its energy-efficient design, while SEI’s high throughput is appealing for high-frequency trading NFTs.\n\n3. Enhanced Scalability and Performance\n\nScalability remains a key concern in the NFT space. Alternative Layer 1s address this issue head-on, offering superior scalability and performance compared to older blockchains. This feature is crucial as the NFT market expands and requires more efficient infrastructure.\n\n4. Tailored Solutions for Diverse Needs\n\nEach of these alternative Layer 1s brings tailored solutions to the table. Solana, known for its lightning-fast speeds, is ideal for projects that require quick transactions. Tezos, on the other hand, appeals to those prioritizing eco-friendliness.\n\n5. Growing Ecosystems and Partnerships\n\nThe expanding ecosystems and partnerships surrounding these blockchains are a testament to their growing influence. Collaborations with artists, brands, and tech companies are broadening the scope and appeal of NFTs on these platforms.\n\nBTC’s Entry into NFTs: Ordinals and Inscriptions\n\n2024 also witnesses a groundbreaking development in the NFT space with Bitcoin (BTC) introducing ordinals and inscriptions. This new concept involves directly inscribing digital assets onto individual satoshis, the smallest unit of Bitcoin, adding a fresh dimension to the NFT market.\n\nThe Significance of Bitcoin’s Ordinals\n\nBitcoin’s foray into the NFT world is notable for several reasons. Firstly, it leverages the robust security and widespread recognition of the Bitcoin network. Secondly, ordinals introduce a unique way of tokenizing assets, differing from traditional NFT standards. This innovation could attract a new wave of collectors and creators, eager to explore the possibilities within the Bitcoin ecosystem.\n\nImplications for the NFT Landscape\n\nThe introduction of Bitcoin ordinals and inscriptions is poised to enrich the NFT landscape. It not only expands the range of blockchain options for NFTs but also brings the credibility and stability of Bitcoin to the forefront of digital art and collectibles.\n\nThe Unstoppable Rise of Layer 2s: Ethereum’s Counter\n\nWhile alternative Layer 1s and Bitcoin’s new venture are making waves, Ethereum’s Layer 2 solutions, particularly Arbitrum, are not to be overlooked, especially in the gaming sector. Arbitrum is poised to extend its lead in 2024, offering a blend of Ethereum’s security with enhanced scalability and lower fees, making it ideal for NFT-based games.\n\nConclusion: A Balanced NFT Future\n\n2024 promises to be a landmark year for NFTs, with both alternative Layer 1s, Bitcoin’s innovative ordinals, and Ethereum’s Layer 2 solutions like Arbitrum playing critical roles. This balanced growth ensures a vibrant, diverse, and technologically advanced NFT ecosystem.\n\nTLDR: 2024 marks the rise of alternative Layer 1 blockchains like Solana, Tezos, and SEI in the NFT space, alongside Bitcoin’s introduction of ordinals and inscriptions, offering diversification, niche communities, scalability, and tailored solutions. Ethereum’s Layer 2 solutions, especially Arbitrum, continue to be pivotal, particularly in NFT gaming. The year promises a balanced and thriving NFT ecosystem."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbmV3cy8yNC8wMS8zNjQ0OTE4Ny9iaXRjb2luLWNyb3NzZXMtNDVrLW9uLWZpcnN0LWRheS1vZi0yMDI0LWV0aGVyZXVtLWRvZ2Vjb2luLXNwaWtlLWFzLXdlbGwtaW50ZXJlc3QtcmF0ZS1hdmFsYW5jaGUtdXPSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzY0NDkxODc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Crosses $45K On First Day Of 2024, Ethereum, Dogecoin Spike As Well, Interest Rate Avalanche: US - Benzinga",
        "content": "Bitcoin Crosses $45K On First Day Of 2024, Ethereum, Dogecoin Spike As Well, Interest Rate Avalanche: US Office Buildings Brace For $117B Debt Cliff - Top Headlines Today While US Was Sleeping"
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGFpbHljb2luLmNvbS9kZWZpLXR2bC1jb250aW51ZXMtMjAyMy1yZWNvdmVyeS10by1oaXQtMTYtbW9udGgtaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "DeFi TVL Continues 2023 Recovery to Hit 16-Month High - DailyCoin",
        "content": "The TVL across all DeFi protocols hits $55.7 billion.\n\nMomentum in DeFi protocols has been trending high er since late Q4 2023.\n\nChanging DeFi market dynamics suggest users are shunning Ethereum.\n\nIn October 2023, DeFi markets hit a local bottom as the total value locked (TVL) fell below $37 billion. However, decentralized finance protocols began gaining momentum, with crypto sentiment improving towards the end of Q4 2023. This momentum has continued into the new year, with DeFi TVL reaching $55.7 billion on January 2, marking a 16-month high.\n\nDeFi TVL Trends Higher\n\nOn January 2, the TVL in DeFi protocols hit $55.7 billion for the first time since September 2022, indicating a continuation of strength from the late Q4 2023 surge going into the new year.\n\nLast year was characterized by indecision, with TVL trending higher from the start of 2023 to reach a local top of $52.8 billion by April 15, 2023. Since then, investors displayed caution, leading to outflows that dipped TVL to a yearly low of $35.9 billion by October 13, 2023.\n\nHowever, a wider crypto market recovery attributable largely to spot Bitcoin ETF approval hype saw capital flowing into the DeFi market to print a marked uptrend to close 2023 on a high.\n\nDeFi TVL in dollars per DeFiLlama\n\nWhile DeFi TVL sees a continuation of inflows into the new year, there is a noticeable change in DeFi dominance.\n\nThe Decline of Ethereum DeFi?\n\nEthereum has been the dominant DeFi blockchain since the inception of decentralized finance in mid-2020. While that remains the case, with Ethereum currently holding 53.7% of the TVL across all chains, its market dominance was as high as 60% in the summer of 2023.\n\nIn the meantime, several other blockchains have been gaining traction, suggesting a change in DeFi market dynamics, including Cardano, which entered the top 10 DeFi protocols recently, and Solana, which spiked to fifth place as meme coin mania driven by Solana-based Bonk took markets by storm.\n\nOn the Flipside\n\nGrowing TVL mirrors a broader rebound in crypto markets, with the total cap growing 115% over the past year to $1.73 trillion .\n\nMainstream adoption of crypto and DeFi remains relatively low versus TradFi , indicating ample growth opportunities .\n\nThe TVL in Ethereum has shown an enduring downtrend since 2022 when priced in ETH (rather than dollars).\n\nWhy This Matters\n\nThe resurgence in DeFi TVL demonstrates a growing appetite for crypto-enabled financial tools despite recent scandals and ongoing concerns over asset security. While the road to mainstream adoption remains long, the milestone recapture of $55 billion inspires confidence that the industry is on the right path.\n\nLearn more about Ethereum DeFi exploits in 2023 here:\n\nEthereum Exploits Account for 70% of all DeFi Losses in 2023\n\n\n\nFind out why the Bitcoin price is pumping here:\n\nBitcoin Spot ETF Early Nod Rumors Blast Price Past $45k"
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvY3J5cHRvLXByaWNlLXByZWRpY3Rpb24tdG9kYXktamFudWFyeS0yLWV0aC1uZWFyLXNlaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Prediction For January 2: ETH, NEAR, SEI - CoinGape",
        "content": "Crypto Price Prediction: The crypto market entered 2024 with strong bullish momentum, with a majority of major coins witnessed aggressive buying. The uptick is likely fueled by growing optimism for the potential approval of a Bitcoin spot ETF by the U.S. Securities and Exchange Commission (SEC), anticipated around January 10, 2024\n\nThe Top two leading coins Bitcoin and Ethereum showcased an 8% and 6% jump in the last 48 hours to currently trade at $45616 and $2398 respectively\n\nadvertisement\n\nThe global cryptocurrency market capitalization now stands at $1.76 trillion, marking a notable rise of 6.45% in the past day. Meanwhile, the total volume of cryptocurrency traded in the last 24 hours has surged to $65.2 billion, reflecting a significant 39.61% increase. As for Bitcoin, it currently asserts 50.87% dominance in the market, a slight uptick of 0.52% from the previous day.\n\nIn today’s crypto price prediction, we’ll analyze the near future projection of smart contract giant Ethereum(ETH), and the highest intraday gainer Near Protocol(NEAR), and SEI.\n\nEthereum Price Sees 10% Jump With This Resistance Breakout\n\nThe Ethereum (ETH) cryptocurrency has been on a steady upward trend for over 10 weeks, clearly identifiable by an ascending support trendline. Starting from a mid-October low of $1522, ETH’s price has surged to a current level of $2400, marking a significant 57.5% growth.\n\nThis rally has been characterized by several pullbacks, each met with robust demand at the rising trendline, a positive indicator of a well-established uptrend. This trend suggests that the Ethereum price rally is likely to persist as long as the support trendline remains unbroken.\n\nToday, the ETH price has seen an intraday increase of 2%, hinting at a potential bullish breakout from the last swing high resistance of $2400. If the price can surpass this barrier with a solid daily close above it, there’s room for an additional 10.8% increase, potentially reaching the next key resistance level of $2650.\n\nAdditionally, the 50-day EMA offers dynamic support, further bolstering the ongoing recovery\n\nConstructive Pullback Sets Near Protocol(NEAR) Price Rally to $7\n\nThe Near Protocol (NEAR) coin recently experienced a slight downturn, dropping 23.36% from its yearly high of $4.62. However, it found reliable support at $3.50, just above the 38.2% Fibonacci retracement level.\n\nThis correction was short-lived, as buyers quickly pushed the price back up, surpassing the $4 mark with a 9.4% intraday gain. Currently, the positive sentiment and healthy retracement have managed to recuperate the exhausted bullish momentum of this asset,\n\nThe Near Protocol price is now trading at $4.16, aiming to surpass its previous swing high of $4.1628. The daily chart reveals a bullish reversal pattern known as a rounding bottom, indicative of sustained investor accumulation.\n\nThis pattern suggests NEAR could aim for targets of $5.25, followed by $6.1 and $7.35. Despite the recent correction, the upward trend of the Bollinger band’s upper boundary signals that bullish momentum remains strong.\n\nSEI Coin Price Eyeing the $1 Milestone with Accelerated Growth\n\nUnder the influence of a rising channel pattern, the SEI Coin price has also shown a significant recovery since mid-December. The price surged from a low of $0.223 to $0.75, a 236% increase.\n\nRecently, the SEI price broke through the upper boundary of its channel pattern, signaling an eagerness among buyers for a more robust recovery. If the coin maintains its position above this newfound resistance level, the upward trend could extend by another 20%, targeting the $0.9 mark and potentially reaching the psychological threshold of $1.\n\nThe widening gap between the MACD and its signal line, currently in a bullish crossover state, indicates a strengthening buyer control over the asset.\n\nRelated Articles:"
    }
]